<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>FreeDOS command: foxcalc</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Command: foxcalc</h1>
<pre>
  FOXCALC est une calculatrice simple pour DOS avec une interface
  textuelle. Le programme prend en charge la souris, donc prenez
  soin de lancer votre pilote de souris avant d'ex&eacute;cuter FOXCALC ;
  elle sera bien plus facile de l'utiliser.
</pre>
<h2>Syntaxe :</h2>
<pre>  - aucune -</pre>
<h2>Options :</h2>
<pre>
  Si vous ne pouvez vraiment pas utiliser une souris, vous trouverez
  ci-dessous une liste de touches de raccourci. Cette liste devrait
  appara&icirc;tre tout seule si FoxCalc ne peut trouver un pilote de souris.
  Touche         Fonction

  0-9            0-9 (chiffres)
  "+"            +   (addition)
  "-"            -   (soustraction)
  "=" or ENTER   =   (retour chariot)
  "."            .   (comma)
  "*"            *   (multiplication)
  "/"            /   (division)
  "%"            %   (percent)
  "]"                (racine carr&eacute;e)
  "["                (carr&eacute;)
  "^"                (exponentiation)
  "!"            x!  (factorisation)
  ":"            MOD (modulo)
  "m"            M+  (addition &agrave; la m&eacute;moire)
  "M"            M-  (soustraction de la m&eacute;moire)
  "r"            MR  (rappel de la m&eacute;moire)
  "c"            MC  (effacement de la m&eacute;moire)
  "\"            +/- (changer le signe)
  ESC            OFF (quitter)
  DEL            AC  (tout effacer)
  BackSpace      C   (effacer)
  "s"            snd (activer ou d&eacute;sactiver le son)
  "?"            ?   (au sujet du programme)
</pre>
<h2>Commentaires :</h2>
<pre>
  CALCUL
  FoxCalc utilise la biblioth&egrave;que GMP (GNU Multi-Precision) et la
  biblioth&egrave;que MPFR pour tous les calculs. Cela le rend pr&eacute;cis et
  tr&egrave;s fiable. Toutes les op&eacute;rations sont effectu&eacute;es avec une pr&eacute;cision
  de 60 chiffres. Les nombres en virgule flottante qui ne rentrent
  pas dans la fen&ecirc;tre sont tronqu&eacute;s sont aucun arrondi. Lors de
  l'utilisation de la fonctionnalit&eacute; MOD dans FoxCalc, vous pouvez
  obtenir des r&eacute;sultats diff&eacute;rents des autres calculatrices ou langages
  de programmation. Ce n'est pas un bug. L'op&eacute;ration modulo sur les
  nombres n&eacute;gatifs peut &ecirc;tre effectu&eacute; selon plusieurs m&eacute;thodes.
  G&eacute;n&eacute;ralement, les ordinateurs traitent une op&eacute;ration "X MOD Y" en
  utilisant les valeurs absolues de X et Y et changent le signe du
  r&eacute;sultat selon le signe de X. C'est la fa&ccedil;on la plus facile, et
  c'est ainsi que les processeurs Intel fonctionnent. FoxCalc se
  comporte diff&eacute;remment. Donc, l'op&eacute;ration "7 mod -3" peut &ecirc;tre
  calcul&eacute;e comme 1 sur les autres calculatrices, alors que FoxCalc
  retournera un r&eacute;sultat de "-2". Les deux r&eacute;sultats sont corrects.
  <a href="../other/cpidos.htm">PAGE DE CODE</a> &amp; TRADUCTIONS :
  Comme il existe des touches qui sont d&eacute;crites avec des caract&egrave;res
  ASCII sup&eacute;rieurs &agrave; ASCII #127, FoxCalc d&eacute;tecte la page de code du
  syst&egrave;me et modifie la description des touches si la page de code ne
  peut les afficher correctement. Par exemple, la touche carr&eacute; est
  "&sup1;" sur CP437 et "SQR" sur CP850. Les s&eacute;parateurs (s&eacute;parateur d&eacute;cimal
  et s&eacute;parateur de milliers) sont copi&eacute;s des r&eacute;glages du syst&egrave;me. Si
  vous souhaitez les modifier, modifiez simplement les r&eacute;glages de votre
  syst&egrave;me (g&eacute;n&eacute;ralement en utilisant <a href="../base/cntrysys.htm">COUNTRY.SYS</a>).
</pre>
<h2>Exemples :</h2>
<pre>
  foxcalc
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../other/cpidos.htm">page de code</a>
  <a href="../base/cntrysys.htm">country.sys</a>
  <a href="../util/fdrc.htm">fdrc</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2007 Mateusz Viste "Fox".</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
