<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : del</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : del</h1>
<pre>
  DEL efface un ou plusieurs fichiers.
</pre>
<h2>Syntaxe :</h2>
<pre>
  DEL [lecteur][chemin]nomfichier [/P] [/V] [/?]
      lecteur    Sp&eacute;cifie la lettre du lecteur o&ugrave; se trouve le fichier,
                 par exemple C:
      chemin     Sp&eacute;cifie le chemin vers l'emplacement o&ugrave; se trouve
                 le fichier, par exemple \exemple\
      nomfichier Sp&eacute;cifie les fichiers &agrave; effacer. Sp&eacute;cifiez de multiples
                 fichiers au moyen des jokers (*,?).
                 Un point peut &ecirc;tre utilis&eacute; pour sp&eacute;cifier tous les
                 fichiers dans le dossier actuel, et est identique &agrave; *.*
</pre>
<h2>Options :</h2>
<pre>
  /P  Demande une confirmation avant d'effacer chaque fichier.
  /V  Affiche tous les fichiers effac&eacute;s.
  /?  Affiche l'aide.
</pre>
<h2>Commentaires :</h2>
<pre>
  Pour des raisons de performance, DEL &eacute;crase la premi&egrave;re lettre du
  nom de fichier par un '?'. Il n'efface pas le fichier lui-m&ecirc;me mais
  d&eacute;salloue l'espace o&ugrave; le contenu du fichier se trouve. FreeDOS, comme
  d'autres DOS, reconna&icirc;t le fichier renomm&eacute; (monfichier.txt devient
  ?onfichier.txt) comme &eacute;tant effac&eacute;, ne l'affiche plus et n'y offre
  plus l'acc&egrave;s. Les programmes comme <a href="../base/debug.htm">DEBUG</a> qui ont un acc&egrave;s aux
  secteurs sont capables de lire le contenu du fichier. Tant que vous
  n'&eacute;crasez pas le fichier &eacute;crit sur le disque, vous avez une chance de
  le restaurer avec <a href="../base/undelete.htm">UNDELETE</a>, seul le premier caract&egrave;re du fichier
  sera perdu (_onfichier.txt). La seule fa&ccedil;on d'effacer LES CONTENUS DE
  MANI&Egrave;RE ABSOLUMENT S&Ucirc;RE est de remplir le disque enti&egrave;rement en
  utilisant un outil d'effacement. La seule fa&ccedil;on d'effacer le NOM DE
  MANI&Egrave;RE ABSOLUMENT S&Ucirc;RE est de <a href="../command/rename.htm">RENOMMER</a> <a href="../command/ren.htm">(REN)</a> d'abord le fichier
 (par exemple "a.") et de l'effacer ensuite (seulement vrai pour 8.3,
  pas pour les noms de fichiers longs !)
  Vous pouvez aussi utiliser <a href="../command/erase.htm">ERASE</a> au lieu de DEL.
  DEL est une commande interne &agrave; command.com et ne n&eacute;cessite aucun
  autre fichier pour fonctionner.
</pre>
<h2>Exemples :</h2>
<pre>
  del C:\PROGRAM\test.txt
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../base/debug.htm">debug</a>
  <a href="../base/deltree.htm">deltree</a>
  <a href="../command/erase.htm">erase</a>
  <a href="../command/rd.htm">rd</a>
  <a href="../command/ren.htm">ren</a>
  <a href="../command/rename.htm">rename</a>
  <a href="../command/rmdir.htm">rmdir</a>
  <a href="../base/undelete.htm">undelete</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 1998 Jim Hall, mis &agrave; jour en 2007 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
