<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : chkdsk</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : chkdsk</h1>
<pre>
  CHKDSK v&eacute;rifie un lecteur &agrave; la recherche d'erreur et tente
  optionnellement de les corriger. Il d&eacute;taille aussi la taille du
  disque et sa structure.
</pre>
<h2>Syntaxe :</h2>
<pre>
  Chkdsk [volume] [/f] [/d fichiers] [/r] [/s] [/v] [/?]
</pre>
<h2>Options :</h2>
<pre>
  /f  tenter de corriger les erreurs trouv&eacute;es.
  /d  afficher les fichiers indiqu&eacute;s et montrer le facteur de
      fragmentation.
  /r  analyser l'espace de donn&eacute;es et tenter de r&eacute;cup&eacute;rer les donn&eacute;es
      illisibles
  /s  afficher seulement le r&eacute;sum&eacute; du lecteur.
  /v  afficher le nom du fichier lors de sa v&eacute;rification.
  /?  affiche l'aide.
</pre>
<h2>Commentaires :</h2>
<pre>
   volume    Le disque, le lecteur ou la partition que vous souhaitez
             v&eacute;rifier, par ex. : chkdsk a: v&eacute;rifie le lecteur A. Si
             aucun volume n'est indiqu&eacute;, le lecteur actuel est suppos&eacute;.
   /f        Dit &agrave;  chkdsk de tenter de corriger les erreurs.
   /d fichie Cela  listera le niveau de fragmentation pour chaque
             fichier Si de nombreux fichiers sont tr&egrave;s fragment&eacute;s,
             alors les op&eacute;rations de disque peuvent &ecirc;tre ralenties. Vous
             pouvez d&eacute;fragmenter votre lecteur de disque avec defrag.
             Cette option liste &eacute;galement les attributs de fichier pour
             chaque fichier, voyez attrib pour plus d'informations sur
             les attributs de fichier.
   /r        Analyse et tente de r&eacute;cup&eacute;rer les donn&eacute;es. Cela peut prendre
             longtemps !
   /s        Indique &agrave; chkdsk de ne pas v&eacute;rifier le lecteur, mais
             seulement d'afficher son l'analyse.
   /v        Cela liste les fichiers lors de leur v&eacute;rification.
             Notez que cela peut ralentir les choses, particuli&egrave;rement
             s'il existe de nombreux fichiers.
  CHKDSK a les <a href="../batch/if.htm#comment">CODES DE SORTIE (ERRORLEVEL)</a> suivants :
    0    lecteur en bon &eacute;tat
</pre>
<h2>Exemples :</h2>
<pre>
  chkdsk c: /f
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../util/bootfix.htm">bootfix</a>
  <a href="../util/dosfsck.htm">dosfsck</a>
 (<a href="../base/scandisk.htm">scandisk</a>)
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2003-2004 Robert Platt, mis &agrave; jour en 2011 par by W. Spiegl</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
