<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commandes FreeDOS: graphics-ps, graphpin, graph-hp</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commandes : graphics-ps, graphpin, graph-hp</h1>
<pre>
  L'outil graphique de FreeDOS.
</pre>
<h2>Syntaxe :</h2>
<pre>
  GRAPH-PS (options) - pour les imprimantes laser seulement (PostScript)
  GRAPHPIN (options) - pour les imprimantes matricielles et autres
                       ESC/P (Epson)
  GRAPH-HP (options) - pour les imprimantes HP PCL 3
    Je vous conseille de copier le fichier qui correspond
    &agrave; VOTRE imprimante sur GRAPHICS.COM pour un meilleur aper&ccedil;u.
</pre>
<h2>Options :</h2>
<pre>
  Options communes:
    /1  Utilise LPT1 (valeur par d&eacute;faut).
    /2  Utilise LPT2.
    /3  Utilise LPT3.
    /B  Active le traitement de la palette de couleur de fond 0 CGA.
    /I  Impression invers&eacute;e (utile s'il y a beaucoup de zones sombres
        sur l'&eacute;cran, pour &eacute;conomiser de l'encre / du toner : imprimera
        en noir l&agrave; o&ugrave; l'&eacute;cran est blanc, etc.).
    /E  Mode d'&eacute;conomie : seulement 50 % de la densit&eacute;. Effectu&eacute; en
        r&eacute;duisant la distance de chaque couleur par rapport au blanc
        &agrave; 50 % de la valeur normale.
    /?  Affiche l'aide au lieu d'&ecirc;tre r&eacute;sident - vous n'avez pas besoin
        d'entrer des options :-)
  Options qui diff&eacute;rent :
  HP (GRAPH-HP - PCL) autorise les options suppl&eacute;mentaires suivantes :
    /C  Pour 300 dpi au lieu de 600 dpi
    /R  Utilise le tramage al&eacute;atoire au lieu du tramage ordonn&eacute;
  PS (GRAPH-PS - Postscript) autorise les options suppl&eacute;mentaires
  suivantes :
    /C  Mode de compatibilit&eacute; (HP Laserjet)
  PIN (GRAPHPIN - EPSON) autorise les options suppl&eacute;mentaires
  suivantes :
    /9  Mode &agrave; 9 aiguilles (120x72, 60x72 avec /C)
    /C  Mode de compatibilit&eacute; (120 x 60 dpi)
    /R  Utilise le tramage al&eacute;atoire au lieu du tramage ordonn&eacute;
    /X  Envoie des donn&eacute;es d'impression pour les lignes enti&egrave;res
        au lieu de les envoyer sous forme de blocs
  Apr&egrave;s avoir charg&eacute; le pilote vous pouvez imprimer les captures d'&eacute;cran
  en utilisant 'Maj - Impr &Eacute;cran' m&ecirc;me en mode graphique.
</pre>
<h2>Commentaires :</h2>
<pre>
  Ex&eacute;cutez le fichier GRAPH*.COM qui est adapt&eacute; &agrave; votre imprimante -
  il restera r&eacute;sident en arri&egrave;re plan jusqu'au red&eacute;marrage. Vous pouvez
  utiliser la touche 'Maj Impr &Eacute;cran' alors que GRAPH... est r&eacute;sident
  pour imprimer des captures d'&eacute;cran du contenu de vos &eacute;crans graphiques
  dans tous les modes standards CGA, EGA et VGA. Pas de prise en charge
  des modes haute r&eacute;solution / VESA / Hercules pour le moment.
  L'impression devrait convenir &agrave; la fois au format A4 et au format
  Letter. L'&eacute;cran est imprim&eacute; en mode paysage : le bas de l'&eacute;cran se
  trouvera &agrave; la gauche du papier.
</pre>
<h2>Exemples :</h2>
<pre>
  graph-ps /1 /e
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../base/graphics.htm">graphics</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2003 Eric Auer, mis &agrave; jour en 2008 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
