<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : keyman</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : keyman</h1>
<pre>
  KEYMAN est un enregistreur de macros simple qui est install&eacute; en tant
  que programme r&eacute;sident dans la m&eacute;moire et qui permet de simples
  (re)d&eacute;finitions des touches.
</pre>
<h2>Syntaxe :</h2>
<pre>
 [loadhigh] keyman
</pre>
<h2>Options :</h2>
<pre>  - aucune -</pre>
<h2>Commentaires :</h2>
<pre>
  KEYMAN ne peut &ecirc;tre charg&eacute; que si <a href="../base/xkeyb.htm">XKEYB</a> est d&eacute;j&agrave; r&eacute;sident en m&eacute;moire.
  Il est activ&eacute; par un raccourci clavier (F11 par d&eacute;faut). Apr&egrave;s
  activation KEYMAN affichera une fen&ecirc;tre sur l'&eacute;cran. Vous pouvez
  maintenant soit appuyer sur une touche &agrave; laquelle vous voulez attribuer
  une nouvelle macro, ou bien appuyer sur le raccourci clavier &agrave; nouveau
  pour le red&eacute;finir.
  Si vous avez appuy&eacute; sur une touche qui avait d&eacute;j&agrave; une macro qui lui
  &eacute;tait attribu&eacute;e, la macro actuelle sera affich&eacute;e sur la fen&ecirc;tre. Cette
  macro peut &ecirc;tre &eacute;dit&eacute;e en utilisant la touche RETOUR ARRI&Egrave;RE pour
  effacer les appuis de touches affich&eacute;s (pour inclure un appui sur
  RETOUR ARRI&Egrave;RE en tant que partie int&eacute;grante de la macro, appuyez sur
  Alt et sur "8" sur le pav&eacute; num&eacute;rique).
  Apr&egrave;s un autre appui sur le raccourci clavier, la macro sera attribu&eacute;e
  et la fen&ecirc;tre dispara&icirc;tra.
  Note :
  Si la touche sur laquelle vous avez appuy&eacute; n'avait PAS d&eacute;j&agrave; une macro
  qui lui &eacute;tait attribu&eacute;e, cette touche sera consid&eacute;r&eacute;e comme le premier
  appui de la macro (c'est-&agrave;-dire que si vous avez appuy&eacute; sur CTRL-D,
  la macro consistera initialement de l'appui sur "CTRL-D").
  Si la nouvelle macro comportait plus d'un caract&egrave;re, un XString sera
  cr&eacute;&eacute; automatiquement et sera attribu&eacute; &agrave; la touche (si assez d'espace
  Xstring avait &eacute;t&eacute; allou&eacute; avec le commutateur /Xnn lors de
  l'installation de <a href="../base/xkeyb.htm">XKEYB</a>).
  Si vous avez appuy&eacute; sur le raccourci clavier apr&egrave;s l'activation de
  KEYMAN, ce dernier vous demandera d'appuyer sur le nouveau raccourci
  clavier. Apr&egrave;s avoir appuy&eacute; sur une touche, la fen&ecirc;tre dispara&icirc;tra et
  la touche choisie deviendra le nouveau raccourci clavier.
  Si vous souhaitez enregistrer une attribution de touches cr&eacute;&eacute;e
  interactivement, vous pouvez le faire avec la commande <a href="../base/listxdef.htm">LISTXDEF</a>
  &gt; xyz.KEY
  KEYMAN est fourni avec le paquet XKEYB.
</pre>
<h2>Exemples :</h2>
<pre>  - aucun -</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../base/cpidos.htm">cpidos</a>
  <a href="../base/display.htm">display</a>
  <a href="../base/keyb-kc.htm">kc</a>
  <a href="../base/keyb.htm">keyb</a>
  <a href="../base/keycode.htm">keycode</a>
  <a href="../base/klib.htm">klib</a>
  <a href="../base/kpdos.htm">kpdos</a>
  <a href="../base/listxdef.htm">listxdef</a>
  <a href="../base/mkeyb.htm">mkeyb</a>
  <a href="../base/mode.htm">mode</a>
  <a href="../base/xkeyb.htm">xkeyb</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2002-2003 Aitor SANTAMARIA MERINO, mis &agrave; jour en 2008
  par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; du FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
