<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : swsubst</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : swsubst</h1>
<pre>
  SWSUBST combine subst avec join avec des options am&eacute;lior&eacute;es.
  SWSUBST remplace un chemin par une lettre de lecteur pour que vous
  ayez acc&egrave;s &agrave; un chemin par une lettre de lecteur.
</pre>
<h2>Syntaxe :</h2>
<pre>
  swsubst [option] [commande]
  Si swsubst est utilis&eacute;e sans sp&eacute;cifier une commande, alors la table
  CDS est affich&eacute;e.
</pre>
<h2>Options :</h2>
<pre>
  /#     Affiche les statistiques des lecteurs JOINts dans le tableau
         CDS.
  /!     Comme /#; initialise l'indicateur JOIN, s'il est diff&eacute;rent.
  /f     Affiche les caract&egrave;res non imprimables en hexad&eacute;cimal.
  /a     Affiche le tableau CDS apr&egrave;s la commande.
  /k     Cr&eacute;e les chemins mentionn&eacute;s dans la commande.
  /t     Comme /k, dans SUBST v&eacute;rifie seulement, si le chemin existe.
  /_     Vide tous les attributs de la table CDS.
  /o=#   Utilise l'offset de la barre oblique invers&eacute;e, ne le calcule
         pas.
  /x=??  Liste des lettres de lecteur &agrave; ignorer pendant une recherche
         ::label:
  Commandes :
  -                      Initialise tous les lecteurs JOINts et SUBST.
  --                     Initialise tous les lecteurs non mis en r&eacute;seau.
  dr [-]chemin           Similaire &agrave; %s dr [-]chemin.
  /u dr [-]chemin        Substitue dr pour pointer vers le chemin.
  /j dr [-]chemin        Rejoint dr au chemin.
  /d dr | dr /d | dr -   Initialise le lecteur dr (et casse SUBST/JOIN).
  /s dr1 dr2             &Eacute;change dr1 et dr2.
  /n [dr1 dr2]           &Eacute;change les num&eacute;ros d'unit&eacute; du m&ecirc;me pilote de
                         p&eacute;riph&eacute;rique (Std.: disquettes).
  /w dr                  D&eacute;finit ERRORLEVEL sur la lettre du lecteur.
  /m [-]chemin           Cr&eacute;e un chemin incluant tous les principaux
                         r&eacute;pertoires au-dessus.
  /c [-]chemin           Comme /m, ex&eacute;cute ensuite chdir pour le
                         r&eacute;pertoire.
  dr:[+-=]{off,on,phys,net,join,subst,hidden}  D&eacute;finit directement les
                                               indicateurs du lecteur.
  /q dr:[+-]{phys,net,join,subst,hidden}       Interroge les indicateurs
                                               du lecteur.
</pre>
<h2>Commentaires :</h2>
<pre>
  Les entit&eacute;s standards de DOS &eacute;mulant SWSUBST, SUBST and JOIN, ont la
  m&ecirc;me ligne de commande que les DOS. Mais elles diff&egrave;rent sur les
  points suivants :
    - Le chemin sp&eacute;cifi&eacute; sera cr&eacute;&eacute;, avec le chemin complet y menant,
      par exemple "SUBST c: d:/blah/humpf" cr&eacute;&eacute; le chemin
      "d:\blah\humpf", que d:\blah existe ou non.
    - Vous &ecirc;tes autoris&eacute; &agrave; rompre les relations &agrave; la vol&eacute;e, ce qui veut
      dire :
      quelque chose de d&eacute;j&agrave; sujet &agrave; SUBST peut &ecirc;tre &agrave; nouveau sujet &agrave;
      un autre SUBST ou JOIN sans notification ou avertissement
      suppl&eacute;mentaire.
    - Vous &ecirc;tes autoris&eacute; &agrave; traiter un lecteur avec lui-m&ecirc;me, par
      exemple : "JOIN a: a:\blah"
    - Le vidage du tableau est diff&eacute;rent, SWSUBST affiche
      "X: => Y:\CHEMIN" au lieu de "X: is joined to Y:\CHEMIN".
    - Vous ne pouvez pas renommer les ex&eacute;cutables SUBST and JOIN.
    - La version de DOS ne sera pas test&eacute;e, sauf si c'est n&eacute;cessaire
      pour ajuster les tailles des diff&eacute;rentes structures de donn&eacute;es.
  Si vous avez besoin de SUBST ou JOIN ex&eacute;cutez simplement :
  "copy SWSUBST.EXE JOIN.EXE ou SUBST.EXE".
  Un <a href="../batch/if.htm#comment">ERRORLEVEL</a> entre 65 (ASCII 'A') et 90 (ASCII 'Z') indique OK
  et la lettre du lecteur lui-m&ecirc;me ; alors qu'un <a href="../batch/if.htm#comment">ERRORLEVEL</a> de z&eacute;ro
  indique qu'il n'existe pas un tel lecteur ; et les autres <a href="../batch/if.htm#comment">ERRORLEVELS</a>
  indiquent une erreur.
</pre>
<h2>Exemples :</h2>
<pre>
  swsubst b: c:\blah\humpf
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../base/assign.htm">assign</a>
  <a href="../base/join.htm">join</a>
  <a href="../base/subst.htm">subst</a>
  <a href="../command/truename.htm">truename</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 1995 Steffen Kaiser, mis &agrave; jour en 2008 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
