<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : udma.sys / udmajr.sys</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : udma.sys / udmajr.sys</h1>
<pre>
  UDMA.SYS / UDMAJR.SYS sont des pilotes de mise en cache pour les
  disques durs UltraDMA. UDMA.SYS / UDMAJR.SYS doit &ecirc;tre charg&eacute; dans
  <a href="../cnfigsys/index.htm">CONFIG.SYS</a> / <a href="../cnfigsys/fdconfig.htm">FDCONFIG.SYS</a>.
  Lorsque FreeDOS fonctionne d&eacute;j&agrave;, vous pouvez les charger UDMA.SYS /
  UDMAJR.SYS par la suite avec <a href="../util/devload.htm">DEVLOAD</a>.
  <b>UDMA.SYS / UDMAJR.SYS sont p&eacute;rim&eacute;s. Ils ne sont PLUS pris en charge
  par leur auteur ! Vous devriez utiliser <a href="../base/uide.htm">UIDE.SYS</a> &agrave; la place</b>.
</pre>
<h2>Syntaxe :</h2>
<pre>
  DEVICE[HIGH] = [path]UDMA.SYS [/A] [/Q] [/R] [/Sn] [/U]
  DEVICE[HIGH] = [path]UDMAJR.SYS [/A] [/Q] [/R] [/Sn] [/U]
</pre>
<h2>Options :</h2>
<pre>
  UDMA.SYS / UDMAJR.SYS n'a normalement besoin d'aucun commutateur. Ses
  options se pr&eacute;sentent comme suit :
    /A   Sp&eacute;cifie l'utilisation des anciennes adresses de contr&ocirc;leur
         EIDE alternatives, 01E8h-01EFh sur le canal primaire et
         0168h-016Fh sur le canal secondaire. Si /A est omis, le pilote
         utilisera les adresses de contr&ocirc;leur normales de 01F0h-01F7h
         ou 0170h-0177h. /A existe seulement pour les BIOS SATA
         "bizarres" ou d'autres cas inhabituels.
    /Q   Active l'attente pour des "requ&ecirc;tes de donn&eacute;es" avant de
         d&eacute;marrer les transferts de donn&eacute;es UltraDMA. /Q doit &ecirc;tre
         OMIS avec les adaptateurs SATA-vers-IDE par Sabrent etc., car
         de telles cartes n'&eacute;mulent pas les requ&ecirc;tes de donn&eacute;es depuis
         les disques SATA ! /Q n'est pas n&eacute;cessaire avec de nouveaux
         contr&ocirc;leurs ou des disques IDE. Cette option est pour
         les anciens syst&egrave;mes et ne doit &ecirc;tre utilis&eacute; que si UDMA se
         charge correctement mais semble incapable de transf&eacute;rer des
         donn&eacute;es.
    /R   Restreint UDMA &agrave; la m&eacute;moire "r&eacute;guli&egrave;re" et &eacute;vite la m&eacute;moire
         haute pour sa table de recherche binaire. /R peut &ecirc;tre
         n&eacute;cessaire sur les syst&egrave;mes DOS qui n'attribueront pas de
         m&eacute;moire tant que CONFIG.SYS n'aura pas charg&eacute; les pilotes !
         /R n'est pas n&eacute;cessaire avec V7.10 MS-DOS, V6.22 MS-DOS,
         V7.1 PC-DOS, PTS-DOS, ou EDR-DOS. /R est N&Eacute;CESSAIRE pour
         travailler avec ROM-DOS ! Les autres variantes de DOS devraient
         d'abord &ecirc;tre test&eacute;s.
    /Sn  Sp&eacute;cifie la taille de cache d&eacute;sir&eacute;e, comme suit :
       /S0   cache de 5 Mo,     taille de table de 1280 octets,
                                blocs de 8 Ko.
       /S1   cache de 10 Mo,    taille de table de 2560 octets,
                                blocs de 8 Ko.
       /S2   cache de 20 Mo,    taille de table de 2560 octets,
                                blocs de 16 Ko.
       /S3   cache de 40 Mo,    taille de table de 2560 octets,
                                blocs de 32 Ko.
       /S4   cache de 80 Mo,    taille de table de 2560 octets,
                                blocs de 64 Ko.
       /S5   cache de 120 Mo,   taille de table de 3840 octets,
                                blocs de 64 Ko.
       /S6   cache de 160 Mo,   taille de table de 5120 octets,
                                blocs de 64 Ko.
       /S7   cache de 200 Mo,   taille de table de 6400 octets,
                                blocs de 64 Ko.
       /S8   cache de 250 Mo,   taille de table de 8000 octets,
                                blocs de 64 Ko.
       /S9   cache de 400 Mo,   taille de table de 12800 octets,
                                blocs de 64 Ko.
       /SL   cache de 750 Mo,   taille de table de 24000 octets,
                                blocs de 64 Ko.
         Si /S est omis, alors /S4 est utilis&eacute;. La logique du pilote et
         de la pile prennent 2544 octets fixes en plus des tailles des
         tables de recherche binaire ci-dessus. UDMA place sa table de
         recherche binaire et 1088 octets de logique dans la m&eacute;moire
         haute sauf si /R est entr&eacute;e ou si moins de 3648 octets de
         m&eacute;moire haute (HMA) est libre (2368 octets avec /S0), auquel
         cas la m&eacute;moire r&eacute;guli&egrave;re sera utilis&eacute;e. case Lorsqu'il n'y a
         pas assez de m&eacute;moire haute ou conventionnelle pour un /S, le
         cache le plus grand qui rentre dans la m&eacute;moire "libre" sera
         utilis&eacute;. UDMA se charge dans 4 Ko, donc un cache de 5 Mo dans
         la m&eacute;moire r&eacute;guli&egrave;re peut toujours &ecirc;tre d&eacute;fini. Les caches de
         400 Mo et de 750 Mo ne peuvent utiliser la m&eacute;moire haute et
         prennent toujours 15 Ko ou 26 Ko de m&eacute;moire r&eacute;guli&egrave;re. S'il
         n'y a pas de disque UltraDMA, UDMA annule sa logique UltraDMA
         pendant l'initialisation pour &eacute;conomiser 368 octets de m&eacute;moire
         haute. Pour un ancien gestionnaire XMS V2.0 (ROM-DOS etc.) le
         maximum est /S3 ou 40 Mo. /S0 est pour les syst&egrave;mes DOS anciens
         de 8 Mo et peut perdre de son efficacit&eacute; pour mettre en cache
         les fichiers volumineux de nos jours. Au moins /S1 est
         recommand&eacute;. Assez de m&eacute;moire XMS doit &ecirc;tre disponible pour que
         la taille du cache puisse &ecirc;tre d&eacute;fini, ou UDMA quittera !
    /U   Demande uniquement le UltraDMA "autonome" (pas de mise en
         cache), ce qui peut &ecirc;tre utile pour un programme de diagnostic
         de disque.
  Pour chaque commutateur, un tiret peut remplacer la barre oblique et
  des lettres minuscules peuvent &ecirc;tre utilis&eacute;es.
</pre>
<h2>Commentaires :</h2>
<pre>
  UDMA.SYS est distribu&eacute; pour ceux qui veulent rester "compatibles"
  avec les versions anciennes de ce pilote. Il utilise le m&ecirc;me "coeur"
  r&eacute;sident de 640 octetes que <a href="../base/udma2.htm">UDMA2.SYS</a> ou UDMAJR.SYS. Comme avec les
  versions pr&eacute;c&eacute;dentes, UDMA.SYS est le seul pilote dans ce jeu qui
  affiche les noms des contr&ocirc;leurs UltraDMA et le temps de chargement
  ainsi que les donn&eacute;es du bus PCI, pour ceux qui voudraient voir quelle
  puce sera utilis&eacute;e. UDMA.SYS fournit le jeu complet des tests de
  chargement, tout comme UDMA2.SYS.
  UDMAJR.SYS est distribu&eacute; pour les syst&egrave;mes de "disque RAM" ou
  "enfouis" qui n&eacute;cessite un pilote UltraDMA d'une taille aussi petite
  que possible. Il a le m&ecirc;me "coeur" r&eacute;sident de 640 octets que
  UDMA2S.SYS ou UDMA.SYS avec les m&ecirc;mes capacit&eacute;s d'ex&eacute;cution.
  UDMAJR.SYS omet un test 80386, des "tests de lecture" et les "noms"
  de contr&ocirc;leur et de disque au moment du chargement (l'adresse E/S du
  contr&ocirc;leur EST affich&eacute;e !) et atteint ainsi une taille de fichier
  objet de 2048 octets.
</pre>
<h2>Exemples :</h2>
<pre>
  Dans CONFIG.SYS / FDCONFIG.SYS:
    DEVICE=C:\FDOS\BIN\UDMA.SYS
    DEVICEHIGH=C:\FDOS\BIN\UDMA.SYS
    DEVICE=C:\FDOS\BIN\UDMAJR.SYS
    DEVICEHIGH=C:\FDOS\BIN\UDMAJR.SYS
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../batch/autoexec.htm">autoexec.bat</a>
  <a href="../cnfigsys/index.htm">config.sys</a>
  <a href="../util/devload.htm">devload</a>
  <a href="../cnfigsys/fdconfig.htm">fdconfig.sys</a>
 (<a href="../base/udma2.htm">udma2.sys</a>)
  <a href="../base/uide.htm">uide.sys</a>
 (<a href="../base/xdma.htm">xdma.sys</a>)
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2007 Jack Ellis, mis &agrave; jour en 2011 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
