<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Historique de l'aide HTML :</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1><a name="top"></a>Historique de l'aide HTML :</h1>
<pre>
  Aide FreeDOS (hhstndrd 1.0.8a en + hhstndrd 1.0.8a de
  + hhstndrd 1.0.8a fr + hhstndrd 1.0.8a es)
  xkeyb.htm, cdd.htm et bien d'autres fichiers htm ont
  &eacute;t&eacute; mis &agrave; jour (y compris les hyperliens dans la section
  r&eacute;seau).
  La licence de documentation libre GNU 1.2 est valide pour
  la section r&eacute;seau de l'aide. Cela a &eacute;t&eacute; corrig&eacute;.
  Le texte htm en anglais a &eacute;t&eacute; l&eacute;g&egrave;rement corrig&eacute; (merci
  &agrave; Berki Yenig&uuml;n). Les hyperliens ont &eacute;t&eacute; mis &agrave; jour vers
  des liens fonctionnels autant que possible (des notes de
  bas de page ont &eacute;t&eacute; cr&eacute;&eacute;es). Merci encore &agrave; Berki Yenig&uuml;n !
  La totalit&eacute; de l'aide a d&eacute;sormais une traduction en fran&ccedil;ais
  et en espagnol. Merci beaucoup &agrave; Berki Yenig&uuml;n et &agrave;
  Lorenzo del Toro Saravia !!! Je sais que cela repr&eacute;sente
  beaucoup de travail !
  Date de publication : 14 novembre 2020.

  Aide FreeDOS (hhstndrd 1.0.7a en + hhstndrd 1.0.7a de)
  Si une commande mentionn&eacute;e n'existe pas ou si la commande
  est p&eacute;rim&eacute;e, les hyperliens vers ces fichiers d'aide ont
  &eacute;t&eacute; mis entre parenth&egrave;ses "(commande)" afin de montrer que la
  commande n'existe pas ou qu'elle est p&eacute;rim&eacute;e. Les commandes
  suivantes ont &eacute;t&eacute; mises &agrave; jour : cpidos, kpdos, sys, uide.

  Aide de FreeDOS (hhstndrd 1.0.7 en + hhstndrd 1.0.7 de)
  De nombreux bugs ont &eacute;t&eacute; corrig&eacute;s et "le R&eacute;seau sous DOS" a
  &eacute;t&eacute; ajout&eacute;. Les lignes vides ont &eacute;t&eacute; enlev&eacute;es des fichiers htm.
  Certaines commandes ont &eacute;t&eacute; ajout&eacute;es (par ex. rdisk).
  L'aide a &eacute;t&eacute; divis&eacute;e en une version Internet (avec des liens sur
  un site htm) et une version FreeDOS (sans liens sur un site htm,
  sans images d'arri&egrave;re-plan etc. pour que moins d'espace soit
  n&eacute;cessaire sur une disquette !)
  Les fichiers LSM ont &eacute;t&eacute; actualis&eacute;s.

  Aide de FreeDOS (hhstndrd 1.0.6 en + hhstndrd 1.0.6 de)
  Un syst&egrave;me de fichier htm compl&egrave;tement nouveau a &eacute;t&eacute; cr&eacute;&eacute; :
  Le texte N'est PAS en htm pour que les erreurs soient tr&egrave;s
  simples &agrave; corriger. Vous devez simplement faire attention &agrave;
  ce que la ligne ne fasse pas plus de 74 (!!!) lettres.
  Nouveau "look" pour l'aide.
  Ajout de la prise en charge de l'allemand.
  Ajout de plusieurs commandes et de nombreux commentaires.
  Ajout de nombreux nouveaux bugs (bien entendu !)
&Eacute;  &Eacute;diteur : W. Spiegl; Date de publication : 30 mars 2009.

  Aide de FreeDOS (hhstndrd 1.0.5 en)
  Le support de la structure de dossiers a &eacute;t&eacute; encore am&eacute;lior&eacute; et
  simplifi&eacute;. Ajout du fichier d'aide pour append.
  Le lien vers "D'autres fa&ccedil;ons d'obtenir de l'aide" sur la page
  des contenus a &eacute;t&eacute; corrig&eacute;.
  Ajout d'un peu plus d'explications au fichier d'aide de la commande
  edit.

  Aide FreeDOS (hhstndrd 1.0.4 en)
  * Ajout de l'internationalisation. Le dossier a &eacute;t&eacute; restructur&eacute; pour
    rendre la t&acirc;che plus facile aux traducteurs et pour autoriser
    plusieurs langues sur un syst&egrave;me.
  D'o&ugrave; le renommage des fichiers d'aide en hhstndrd 1.0.4 en.
  * Grosse mise &agrave; jour de nombreux fichiers, plus addition de
    nouveaux fichiers pour LBAcache, CDRcache, Bootfix, Himem, etc.
  * Contributions d'Aitor et d'Henrique Peron :
    Mise &agrave; jour de display.htm, remplacement de cpi.htm par cpidos.htm
    Ajout de kpdos.htm et kc.htm.
  &Eacute;diteur: Robert Platt. Publication : 16 mai 2004

  Aide FreeDOS (hhstndrd 1.0.3)
  HTML Viewer 5.3.1 corrige de nombreux bugs de longue date dont aucun
  n'&eacute;tait majeur, accompagn&eacute; de la correction de certains probl&egrave;mes
  introduits avec le support de zip dans viewer 5.3.
  Aussi, une bo&icirc;te de recherche a &eacute;t&eacute; ajout&eacute;e au visionneur.
  Ajout de l'explication de la prise en charge de zip sur
  <a href="../authors/writing.htm">writing.htm</a>.

  Aide FreeDOS (hhstndrd 1.0.2)
  Ajout de HTML Viewer 5.3
  (Offre le support de l'aide compress&eacute;e dans des fichiers zip)
  Fichiers mis &agrave; jour pour les pays/claviers par Henrique and Aitor
  (CPI, XKeyb, Keyb, Display, (Modecon), Printer)
  Correction de liens dans batch/index.htm
  Correction de liens dans cnfigsys/index.htm
  &Eacute;diteur: Robert Platt. Publication : 04 mars 2004

  Aide FreeDOS (hhstndrd 1.0.1)
  Ajout de l'aide pour les commandes config.sys :
    - echo
    - menu
    - menudefault
    - screen
  Ajout de l'aide pour :
    - (atapicdd.sys)
    - callver
    - display
    - loadfix
    - (modecon)
    - graftabl
    - (setver)
    - scankbd, keyman, listxdef (utilitaires de xkeyb)
  obsolete.htm a &eacute;t&eacute; enlev&eacute;.
  Corrections apport&eacute;es &agrave; :
    - graphics
    - mirror
    - undelete
    - unformat
  Henrique et Aitor ont mis &agrave; jour xkeyb.htm
  Ajout de HTML Viewer 5.2.1
  &Eacute;diteur: Robert Platt. Publication : 17 juillet 2003

  Aide FreeDOS (hhstndrd 1.0)
  Premi&egrave;re publication de ce syst&egrave;me d'aide HTML.
  Ajout de HTML Help Viewer 5.2
  &Eacute;diteur: Robert Platt. Publication : 12 juin 2003
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2003 Robert Platt, mis &agrave; jour en 2020 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour
  les conditions de copie.

</pre></body></html>
