<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Visionneur d'aide HTML 5.3.2 - Balises prises en charge :</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Visionneur d'aide HTML 5.3.2 - Balises prises en charge :</h1>
<pre>
  Ce document d&eacute;crit le sous-ensemble du HTML pris en charge par l'aide.
  <b><A Name="Comment">&lt;!-- --&gt;</A></b>
  Commentaire. Toutes les balises et le texte sont ignor&eacute;s par l'aide
  HTML.
  <b><A Name="A">&lt;A&gt;</A></b>
    L'aide supporte compl&egrave;tement les attributs HREF et NAME, sauf que :
      * Les liens vers les autres fichiers ne peuvent &ecirc;tre que relatifs,
        pas absolus. Donc
        HREF="..\foo.htm" fonctionne mais pas HREF="C:\foo.htm"
      * Les guillemets anglais "" doivent toujours entourer les noms
        de fichier et les signets, par ex. HREF="foo.htm" mais pas
        HREF=foo.htm
      * les r&eacute;f&eacute;rences aux liens web et adresses e-mail sont ignor&eacute;es.
      * Des noms de fichiers de style DOS (8.3) devraient &ecirc;tre utilis&eacute;s.
  <b><A Name="B">&lt;B&gt;</A></b>
    Du texte en <b>gras</b> est affich&eacute; en blanc clair.
  <b><A Name="BODY">&lt;BODY&gt;</A></b>
    Indique le d&eacute;but du texte &agrave; afficher.
  <b><A Name="BR">&lt;BR&gt;</A></b>
    Retour &agrave; la ligne.
  <b><A Name="Code">&lt;CODE&gt;</A></b>
    Du code est affich&eacute; tout comme du texte en <b>gras</b> (en blanc clair).
  <b><A Name="EM">&lt;EM&gt;</A></b>
    Du texte <EM>soulign&eacute;</EM> comme du texte en <I>italique</I>, est affich&eacute;
    avec la couleur magenta (un ton du violet).
  <b><A Name="H1">&lt;H1&gt;</A></b>
    L'aide affichera cet ent&ecirc;te 1 en <b>gras</b> et mettra une ligne &eacute;paisse
    en dessous.
  <b><A Name="H2">&lt;H2&gt;</A>, <A Name="H3">&lt;H3&gt;</A></b>
    Les ent&ecirc;tes 2 et 3 sont affich&eacute;s en <b>gras</b> et un nouveau paragraphe
    est d&eacute;marr&eacute;.
  <b><A Name="Head">&lt;HEAD&gt;</A></b>
    Ent&ecirc;te HTML.
  <b><A Name="HR">&lt;HR&gt;</A></b>
    Cr&eacute;&eacute; une r&egrave;gle horizontale le long de l'&eacute;cran. Seule une r&egrave;gle
    horizontale sans aucun attribut est pris en charge &agrave; l'heure
    actuelle.
  <b><A Name="HTML">&lt;HTML&gt;</A></b>
    D&eacute;note un fichier HTML.
  <b><A Name="I">&lt;I&gt;</A></b>
    Du texte en <I>italique</I> est affich&eacute; avec la couleur magenta (un ton
    du violet).
  <b><A Name="LI">&lt;LI&gt;</A></b>
    Un objet de liste.
  <b><A Name="OL">&lt;OL&gt;</A></b>
    &Agrave; l'heure actuelle, les listes ordonn&eacute;es sont affich&eacute;es comme des
    listes non ordonn&eacute;es. Les listes incorpor&eacute;es ne sont pas prises
    en charge.
  <b><A Name="P">&lt;P&gt;</A></b>
    Nouveau paragraphe.
  <b><A Name="PRE">&lt;PRE&gt;</A></b>
    Du texte pr&eacute;format&eacute;
  <b><A Name="STRONG">&lt;STRONG&gt;</A></b>
    Du texte <STRONG>Strong</STRONG>, tout comme du texte en <b>gras</b> est
     affich&eacute; en blanc clair.
  <b><A Name="TITLE">&lt;TITLE&gt;</A></b>
    Ne fait rien - pour le moment.
  <b><A Name="TT">&lt;TT&gt;</A></b>
    Du <TT>texte TT</TT>, tout comme du texte en <I>italique</I>, est affich&eacute;
    avec la couleur magenta (un ton du violet).
  <b><A Name="UL">&lt;UL&gt;</A></b>
    Les listes incorpor&eacute;es ne sont actuellement pas prises en charge.
</pre>
<H2><A Name="ENTITIES">Les caract&egrave;res support&eacute;s par l'aide HTML :</A></H2>
<pre>
  Plus de 250 caract&egrave;res sont support&eacute;s, y compris tous les caract&egrave;res
  Latin-1.
  Les NCR (r&eacute;f&eacute;rences num&eacute;riques de caract&egrave;res) et l'UTF-8 sont &eacute;galement
  pris en charge. Cependant, l'aide ne peut qu'afficher les caract&egrave;res
  qui sont disponibles dans la page de code DOS active. Pour une liste
  des pages de code dont l'aide est 'au courant', tapez "HELP /C" sur
  la ligne de commande.
</pre>
<H2><A Name="NOTES">Notes g&eacute;n&eacute;rales sur l'aide HTML :</A></H2>
<pre>
   1. Le texte passe sur la ligne suivante si elle ne tient pas sur
      une ligne.
   2. Les balises sont  insensibles &agrave; la casse, donc <b><A Name="x">&lt;A HREF="FOO.HTM"&gt;</A></b>
      est &eacute;quivalent &agrave; <b><A Name="y">&lt;a href="foo.htm"&gt;</A></b>.
   3. La taille maximale pour un fichier est de 64 Ko.
   4. Seuls les noms de fichier courts (8.3) sont pris en charge.
   5. L'aide distingue les types de fichier selon l'extension du nom
      de fichier.
      L'extension <b>.htm</b> est donc recommand&eacute;e pour les fichiers HTML.
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2002-2004 Robert Platt, mis &agrave; jour en 2008 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b><

  L'autorisation de copier, distribuer et / ou modifier ce document est
  accord&eacute;e selon les termes de la licence de documentation libre GNU,
  version 1.1 ou toute version ult&eacute;rieure publi&eacute;e par la Free Software
  Foundation ; sans sections invariantes ni de texte de couverture.
  Une copie de la licence est incluse dans la section intitul&eacute;e
  <a href="../other/fdl11.htm">"Licence de documentation libre GNU 1.1"</a>.

</pre></body></html>
