<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Comando de FreeDOS: lbacache</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Comando: lbacache</h1>
<pre>
  LBACACHE es un programa de cach&eacute; de disco duro. Mejora el rendimiento
  de la unidad. Requiere memoria <a href="../base/himemx.htm">XMS</a> y al menos una computadora 386.
</pre>
<h2>Sintaxis:</h2>
<pre>
  Para cargar:          LBACACHE  [Tama&ntilde;o] [DRV ListaControlador] [FLOP]
                                  [TUNA] [TUNW] [TUNS]
  Cuando est&aacute; cargado:  LBACACHE  [INFO] [SYNC] [STOP] [STAT] [ZERO]
  Para obtener ayuda:   LBACACHE  HELP|/HELP|/?
</pre>
<h2>Opciones:</h2>
<pre>
  size      Especifica el tama&ntilde;o del b&uacute;fer. Predeterminado: 2048k. Si 
            1-2 d&iacute;gitos, la unidad es 256k (en XMS), por lo que el valor
            predeterminado es usar 2MB XMS. Si &gt; 2 d&iacute;gitos, la unidad es
            simplemente 1 kilobyte. Ejemplo: 'LBACACHE 8192'. Otra 
            sintaxis posible: "tama&ntilde;o BUF" en lugar de "tama&ntilde;o".
  FLOP      Habilite el cach&eacute; de disquete (A: y B:, autodetectado) Para
            acelerar el uso del disquete, &iexcl;cargue TICKLE tambi&eacute;n! Por
            favor, informe si FLOP tiene errores. Un error puede p. ej.
            significa que el cach&eacute; hace suposiciones err&oacute;neas sobre la
            geometr&iacute;a del disquete que puede conducir a la corrupci&oacute;n de
            datos en el disco o en los archivos copiados desde el disco.
            Si solo usa discos de 1,44 MB en una unidad de 1,44 MB, los
            errores son extremadamente improbables, aunque ...
  lista DRV Selecciona qu&eacute; discos duros se almacenan en cach&eacute;. No se
            almacenan en cach&eacute; discos utilizando la palabra clave NULL.
            &iexcl;Se recomienda encarecidamente dejar que LBAcache detecte
            autom&aacute;ticamente todos los discos duros almacenables en cach&eacute;
            en lugar de utilizar esta opci&oacute;n! La lista consta de d&iacute;gitos
            en 0..7, para unidades BIOS 80h + x. Por ejemplo: 
            023   almacena en cach&eacute; unidades de BIOS 80h, 82h, 83h - 
                  primer, tercer y cuarto disco duro (hda, hdc, hdd en
                  terminolog&iacute;a de Linux).
            Importante: El primer disco duro del BIOS significa TODAS las
            letras de unidad que est&aacute;n en el primer disco duro f&iacute;sico.
  TUNA      Cach&eacute; totalmente asociativo: busque en todo el cach&eacute; un 
            sector o espacio libre en el peor de los casos. M&aacute;s lento
            para grandes cach&eacute;s, pero puede dar m&aacute;s visitas al cach&eacute; que
            el nuevo valor predeterminado (6/2004) de buscar solo hasta
            N (configuraci&oacute;n actual: 16) elementos de cach&eacute; (tama&ntilde;o
            actual de un elemento: 8KB). Las primeras pruebas sugieren:
            &iexcl;un poco m&aacute;s de cach&eacute; pero menor velocidad!
  TUNW      Asignar al escribir: cuando los datos se escriben en el
            disco, almacene una copia en la memoria cach&eacute;, INCLUSO si eso
            significa asignar un nuevo espacio en la memoria cach&eacute;, en
            previsi&oacute;n de leer los datos m&aacute;s tarde. Era el valor
            predeterminados hasta el 7/2004. Hace que las escrituras
            "consuman" m&aacute;s cach&eacute;, pero es &uacute;til para tareas que funcionan
            mucho con archivos temporales. Si los datos se almacenaron en
            cach&eacute; de todos modos, la copia en cach&eacute; se actualiza
            independientemente de esta opci&oacute;n.
  TUNS      Asigne 320 bytes de RAM de DOS baja para pilas (nuevo 
            7/2004). Use esta opci&oacute;n si desea cargar LBAcache en el UMB
            de JEMM386 o "UMB no muy amigable con DMA" y tener un sistema
            SCSI. &iexcl;Las BIOS SCSI parecen usar DMA para apilar llamadas de
            verificaci&oacute;n de geometr&iacute;a! Tenga en cuenta que LBAcache STOP
            libera *esta* memoria, ya que el protocolo de descarga 
            tendr&iacute;a que modificarse demasiado para eso.
Opciones sin carga:
  INFO      Muestra estad&iacute;sticas de cach&eacute; y detalles sobre LBAcache
            residentes. Util para fines de depuraci&oacute;n, pero de alguna
            manera dif&iacute;cil de entender.
  STAT      Muestra estad&iacute;sticas de cach&eacute; m&aacute;s f&aacute;ciles de entender
            solamente.
  ZERO      Restablezca los contadores de estad&iacute;sticas de cach&eacute; a cero.
  SYNC      Sincroniza todos los b&uacute;feres LBAcache en ejecuci&oacute;n para
            todas las unidades. Como LBAcache nunca retrasa las 
            escrituras, SYNC solo olvida los datos en cach&eacute;. Esto se
            realiza llamando a int 13.46 (disco BIOS: expulsar) para
            todas las unidades almacenables en cach&eacute; (0, 1, 0x80 .. 
            0x87). Se recomienda hacer LBACACHE ZERO despu&eacute;s de LBACACHE
            SYNC, para que las estad&iacute;sticas sean m&aacute;s intuitivas de leer.
  STOP      Apaga todas las instancias de LBAcache en ejecuci&oacute;n y libera
            la RAM XMS y DOS que hab&iacute;an asignado (las elimina de la RAM).
            Si la cadena de interrupci&oacute;n no se puede restaurar, las 
            instancias de LBAcache se dejan en la RAM de DOS, pero a un
            tama&ntilde;o reducidode <500 bytes. La memoria XMS siempre se
            libera. Cuando se carga un &uacute;nico LBAcache como &uacute;ltimo
            programa residente relacionado con el disco, la descarga
            completa deber&iacute;a funcionar la mayor parte del tiempo. Al
            cargar varias instancias de LBAcache, a menudo solo la &uacute;ltima
            instancia se puede descargar completamente.
  COOL      Pone el cach&eacute; en modo "cool": los sectores a los que se
            accede se congelan en el cach&eacute; (tanto como sea posible; use
            TUNA para mejorar el efecto). Consulte las explicaciones de
            BINSEL para averiguar si este modo experimental (9/2004) es
            &uacute;til para usted.
  WARM      Pone el cach&eacute; en modo "derretir": los sectores a los que se
            accede est&aacute;n descongelados (&iquest;descongelados?:-)) del cach&eacute;.
            V&eacute;ase m&aacute;s arriba. (9/2004) Nota: WARM, COOL y TEMP muestran
            un valor de estado de diagn&oacute;stico para la depuraci&oacute;n, p. ej.
            el "conteo de elementos bloqueados" actual. Despu&eacute;s de eso,
            se muestra la salida STAT normal.
  TEMP      Restaura el cach&eacute; al modo de "temperatura normal": el estado
            de congelaci&oacute;n del contenido actual se conserva en la media
            de lo posible (si el cach&eacute; se llena realmente, las cosas se
            derretir&aacute;n). Ahora ha reservado parte del cach&eacute; para datos
            congelados / bloqueados y el resto del espacio del cach&eacute; en
            modo cl&aacute;sico. (9/2004)
</pre>
<h2>Comentarios:</h2>
<pre>
  Para m&aacute;s informaci&oacute;n ver lbacache.txt.
</pre>
<h2>Ejemplos:</h2>
<pre>
  En CONFIG.SYS / FDCONFIG.SYS:
    INSTALL=LBACACHE.COM [argumentos]
  o
    INSTALLHIGH=LBACACHE.COM [argumentos]
  o desde la l&iacute;nea de comando o AUTOEXEC.BAT:
    LBACACHE [argumentos]
  o
    LOADHIGH LBACACHE.COM [argumentos]

    LBACACHE              Simplemente ejecutando elcomando sin opciones
                          leer&aacute; en cach&eacute; todos sus discos duros (si
                          est&aacute;n disponibles a trav&eacute;s del BIOS) con el
                          tama&ntilde;o predeterminado del b&uacute;fer de cach&eacute;.
    LBACACHE buf 20 flop  Esto leer&aacute; en cach&eacute; todos los discos duros y
                          disquetes, con 5 MB de memoria para el b&uacute;fer
                          de cach&eacute;.
    Info LBACACHE         Muestra informaci&oacute;n sobre sus cach&eacute;s.
</pre>
<h2>Ver tambi&eacute;n:</h2>
<pre>
  <a href="../base/cdrcache.htm">cdrcache.sys</a>
 (<a href="../base/fdxms.htm">fdxms</a>)
 (<a href="../base/fdxms286.htm">fdxms286</a>)
 (<a href="../base/himem.htm">himem</a>)
  <a href="../base/himemx.htm">himemx</a>
  <a href="../base/jemmex.htm">jemmex</a>
  <a href="../base/tickle.htm">tickle</a>
  <a href="../base/xmgr.htm">xmgr</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2004 Robert Platt, modificado en 2011 por W. Spiegl.</b>
  Traducido en 2020 por <b>Lorenzo del Toro Saravia</b>.

  Este archivo se deriva del comando de especificaciones HOWTO de FreeDOS.
  Consulte el archivo <a href="../other/h2cpying.htm">H2Cpying</a> para ver las condiciones de copia.

</pre></body></html>
