<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Comando de FreeDOS: sys / sys config</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Comando: sys / sys config</h1>
<pre>
  SYS hace que un disquete o disco duro u otro medio grabable sea de
  arranque. SYS CONFIG configura el <a href="../base/kernel.htm">N&uacute;CLEO</a> de FreeDOS.
</pre>
<h2>Sintaxis:</h2>
<pre>
  SYS [fuente] unidad: [bootsect] [{opci&oacute;n}]
  SYS [/?]
      fuente    = A:,B:,C:\KERNEL\BIN\,etc., La ubicaci&oacute;n (opcional) de
                los archivos de sistema. Si no se proporciona, se supone
                el directorio actual.
      unidad    = A,B,C etc. La unidad para hacer arrancable.
      bootsect  El nombre de la imagen del archivo del sector de arranque
                de 512 bytes para la unidad: para escribir en *lugar de*
                del sector de arranque real.

  SYS CONFIG [unidad][ruta]kernel.sys [opci&oacute;n=valor...]
  SYS CONFIG [/help][/?]

  SYS CONFIG
    Esto simplemente mostrar&aacute; la configuraci&oacute;n actual del archivo
    KERNEL.SYS en el directorio actual. Es &uacute;til ver en qu&eacute; est&aacute;n
    configuradas actualmente las opciones, qu&eacute; opciones son compatibles
    y deber&iacute;an mostrar valores v&aacute;lidos junto con los valores
    predeterminados (los valores predeterminados son los valores v&aacute;lidos
    con un '*' al lado de ellos).

  SYS CONFIG [unidad][ruta]KERNEL.SYS
    Este formulario se comporta como anteriormente, excepto que mostrar&aacute;
    la configuraci&oacute;n del archivo del n&uacute;cleo que especifique. La unidad y
    laruta son opcionales, y generalmente solo se usar&aacute; una '\' para
    indicar el directorio ra&iacute;z de la unidad actual. KERNEL.SYS especifica
    el nombre del archivo del kernel, que puede no ser "KERNEL.SYS", por
    ejemplo, al probar que desea modificar KERNTEST.SYS y luego copia (o
    cambiar el nombre) a KERNEL.SYS para el arranque.
</pre>
<h2>Opciones:</h2>
<pre>
  SYS OPTIONS:
  /BOTH          El nuevo sector de arranque se escribir&aacute; en el archivo
                 de imagen y en el sector de arranque de la unidad real.
  /BOOTONLY      El sector de arranque (o imagen) se actualizar&aacute;, pero
                 <a href="../base/kernel.htm">KERNEL</a> y <a href="../base/command.htm">COMMAND.COM</a> no se copiar&aacute;n en el destino.
  /UPDATE        Copie <a href="../base/kernel.htm">KERNEL</a> y actualice el sector de arranque (*no*
                 copie la l&iacute;nea de comandos).
  /OEM[:AUTO]    Indica sector de arranque, nombres de archivo y segmento
                 de carga para usar.
  /OEM:DE        Use la configuraci&oacute;n del N&uacute;cleo en modo real de DEll.
  /OEM:DR        Use la configuraci&oacute;n compatible con DR DOS 7+.
  /OEM:EDR       Utilice la configuraci&oacute;n mejorada compatible con 
                 DR DOS 7+.
  /OEM:FD        Use configuraciones compatibles con FreeDOS.
  /OEM:MS        Use configuraciones compatibles con MS-DOS.
  /OEM:PC        Use configuraciones compatibles con PC-DOS.
  /OEM:Rx        Use configuraciones compatibles con RxDOS.
  /OEM:W9x       Use la configuraci&oacute;n compatible con MS Win9x DOS.
                 El valor predeterminado es /OEM[:AUTO], seleccione DOS
                 seg&uacute;n los archivos existentes.
  /K nombre      Da el nombre de archivo del archivo del n&uacute;cleo que se
                 copiar&aacute;. Esta opci&oacute;n solo es necesaria cuando el n&uacute;cleo
                 no se llama "KERNEL.SYS".
  /L segmento    El segmento de carga, en hexadecimal, para usar. El
                 valor predeterminado es 60.
  /B btdrv :     N&uacute;mero de BIOS hexagonal de la unidad de arranque
                 establecida en bs, 0=A:, 80=1st hd,...
  /FORCE         Anular la selecci&oacute;n autom&aacute;tica de configuraciones
                 relacionadas con la BIOS.
  /FORCE:AUTO    Seleccione LBA o CHS seg&uacute;n la disponibilidad de la BIOS.
  /FORCE:BIOSDRV Utilice el n&uacute;mero de unidad de arranque proporcionado por
                 la BIOS.
  /FORCE:BSDRV   Use la unidad de arranque # establecida en el sector de
                 arranque.
  /FORCE:LBA     Siempre use LBA.
  /FORCE:CHS     Siempre use CHS.
  /NOBAKBS       Omite la copia del sector de arranque en la copia de
                 seguridad bs, FAT32 solo se ignora.
  /SKFN nombre_archivo            Copiar el nombre del archivo a 
                                  KERNEL.SYS; ajustes iguales que 
                                  /OEM: FD.
  /SCFN nombre_archivo            Copie el nombre del archivo a
                                  COMMAND.COM.
  /BACKUPBS [ruta]nombre_archivo  Guardar bs actual antes de sobrescribir.
  /DUMPBS   [ruta]nombre_archivo  Guardar bs actual y salir.
  /RESTORBS [ruta]nombre_archivo  Sobrescriba bs y salga.
  /VERBOSE                        Mostrar salida adicional (depuraci&oacute;n).
  /help          Muestra la ayuda.
  /?             Muestra la ayuda.
  
  SYS CONFIG OPCIONES:
  /help          Muestra la ayuda.
  /?             Muestra la ayuda.
  Las opciones actuales son:
  DLASORT=0|1
    Esta opci&oacute;n es para especificar si la asignaci&oacute;n de letras de unidad
    debe seguir la forma MSDOS normal de todas las particiones primarias
    en las unidades y luego las particiones extendidas, o las particiones
    m&aacute;s l&oacute;gicas (primarias y extendidas) en la primera unidad, luego
    repita para todasd las unidades siguientes (todas primario y
    extendido, luego intente la siguiente unidad). 0 corresponde al modo
    MS y 1 corresponde al primer disco completamente, luego al 
    siguiente ...
  SHOWDRIVEASSIGNMENT=0|1
    Si es 1, la informaci&oacute;n de adignaci&oacute;n de unidad normal se muestra al
    arrancar. Si es 0, esta informaci&oacute;n se suprime (no se muestra).
  SKIPCONFIGSECONDS=# (maybe -128 to 127)
    Un valor negativo ( &lt; 0 ) indica que se omitir&aacute; el procesamiento
    F5/F8 (el n&uacute;cleo no comprobar&aacute; si presion&oacute; estas teclas, por lo que
    no puede omitir el procesamiento del archivo de configuraci&oacute;n 
    (CONFIG.SYS). Un 0 significa que debe haber presionado la tecla
    precisamente para cuando el n&uacute;cleo lo comprueba, esencialmente
    omitiendo, aunque un dedo bien sincronizado a&uacute;n podr&aacute; usarla. Y
    cualquier valor mayor que 0 es el n&uacute;mero de segundos que el n&uacute;cleo
    mostrar&aacute; el mensaje y esperar&aacute; a que presione la tecla antes de
    asumir que no lo hizo.
  FORCELBA=0|1
    Si es 1, el n&uacute;cleo usar&aacute; t&eacute;cnicas LBA (INT13 extendida) para abordar
    todas las particiones si es posible, incluso si tienen un tipo de
    partici&oacute;n no LBA y est&aacute;n completamente por debajo del cilindro 1023
    (generalmente el l&iacute;mite de 8 GB). Esto es 0 por defecto, por razones
    de compatibilidad. Establecer esto en 1 puede omitir algunas BIOS
    defectuosas y ofrece un rendimiento ligeramente mejor.
  GLOBALENABLELBASUPPORT=0|1
    Si 0, entonces LBA estar&aacute; completamente deshabilitado, 
    independientemente de la configuraci&oacute;n de FORCELBA. Necesita esto si
    FreeDOS cree que tiene LBA disponible, pero en realidad no lo tiene.
    Esta configuraci&oacute;n est&aacute; establecida en 1 de forma predeterminada.

    Para obtener m&aacute;s informaci&oacute;n sobre SYS CONFIG, consulte:
    <b>http://www.fdos.org/kernel/</b>.
</pre>
<h2>Comentarios:</h2>
<pre>
  SYS:
  El comando SYS crea un sector de arranque en el sector 0 del disquete
  o disco duro. Luego copia <a href="../base/kernel.htm">KERNEL.SYS</a> y <a href="../base/command.htm">COMMAND.COM</a> al medio. Despu&eacute;s de
  esto, la computadora puede iniciar FreeDOS desde este medio.
  SYS CONFIG:
  Si no se dan opciones, se muestran los valores actuales. /help o /?
  muestra la informaci&oacute;n de uso. [unidad][ruta]kernel.sys especifica el
  archivo del kernel que se va a modificar, si no se le da valores
  predeterminados a <a href="../base/kernel.htm">KERNEL.SYS</a>. Opci&oacute;n=valor ... especifica una o m&aacute;s
  opciones y los valores para establecer cada una. Si se da una opci&oacute;n
  varias veces, el valor establecido ser&aacute; el m&aacute;s a la derecha.
</pre>
<h2>Ejemplos:</h2>
<pre>
  sys c: (desde un disquete; el comando sys y <a href="../base/command.htm">COMMAND.COM</a> y <a href="../base/kernel.htm">KERNEL.SYS</a>
         deben estar en el disquete, desp&uacute;es de la ejecuci&oacute;n, el HD se
         iniciar&aacute;)
  sys a: (desde un HD o CD; el comando sys y <a href="../base/command.htm">COMMAND.COM</a> y <a href="../base/kernel.htm">KERNEL.SYS</a>
         debe estar en la unidad fuente, despu&eacute;s de la ejecuci&oacute;n, el
         disquete se iniciar&aacute;)
</pre>
<h2>Ver tambi&eacute;n:</h2>
<pre>
  <a href="../base/command.htm">command.com</a>
  <a href="../base/format.htm">format</a>
  <a href="../base/fdisk.htm">fdisk</a>
  <a href="../base/kernel.htm">kernel</a>
  <a href="../base/krnl-dvl.htm">kernel-devel</a>
  <a href="../base/label.htm">label</a>
  <a href="../command/vol.htm">vol</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 1998 Jim Hall, modificado en 2011 por W. Spiegl.</b>
  Traducido en 2020 por <b>Lorenzo del Toro Saravia</b>.

  Este archivo se deriva del comando de especificaciones HOWTO de FreeDOS.
  Consulte el archivo <a href="../other/h2cpying.htm">H2Cpying</a> para ver las condiciones de copia.

</pre></body></html>
