<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Historia de la documentaci&oacute;n de ayuda HTML:</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1><a name="top"></a>Historia de la documentaci&oacute;n de ayuda HTML:</h1>
<pre>
  Ayuda de FreeDOS (hhstndrd 1.0.8a en + hhstndrd 1.0.8a de
  + hhstndrd 1.0.8a es + hhstndrd 1.0.8a es)
  xkeyb.htm, cdd.htm y muchos otros archivos htm se actualizaron
  (incluidos los hiperv&iacute;nculos en la red secci&oacute;n).
  La licencia de documentaci&oacute;n libre GNU 1.2 es v&aacute;lida para la secci&oacute;n
  de red de la ayuda. Esto fue corregido. El texto htm en ingl&eacute;s se
  corrigi&oacute; ligeramente (gracias a Berki Yenig&uuml;n). Los hiperv&iacute;nculos se
  actualizaron a los v&iacute;nculos de trabajo (se crearon notas a pie de
  p&aacute;gina) hasta posible. &iexcl;Gracias a Berki Yenig&uuml;n tambi&eacute;n!
  Toda la ayuda ahora tambi&eacute;n tiene un franc&eacute;s y un espa&ntilde;ol Traducci&oacute;n.
  Muchas gracias a Berki Yenig&uuml;n y Lorenzo del Toro Saravia !!! S&eacute; que
  esto es un &iexcl;mucho trabajo! 
  Editor: Lorenzo del Toro Saravia.
  Fecha de lanzamiento: 14 Noviembre de 2020.

  Ayuda de FreeDOS (hhstndrd 1.0.7a es)
  Creado el archivo hhstndrd en espa&ntilde;ol y modificados algunos
  archivos para su funcionamiento, con el proposito de dar soporte
  para este idioma.
  Editor: Lorenzo del Toro Saravia.

  Ayuda de FreeDOS (hhstndrd 1.0.7a en + hhstndrd 1.0.7a de)
  Si un comando mencionado no existe en FreeDOS o si el comando
  est&aacute; desactualizado, los hiperv&iacute;nculos a estos archivos de ayuda
  se pusieron entre par&eacute;ntesis "(comando)" para mostrar que el
  comando no existe o est&aacute; desactualizado. Se actualizaron los 
  siguientes comandos: cpidos, kpdos, sys, uide.

  Ayuda de FreeDOS (hhstndrd 1.0.7 en + hhstndrd 1.0.7 de)
  Se eliminaron muchos errores y se agreg&oacute; "Redes en DOS". Se
  eliminaron las l&iacute;neas vac&iacute;as de los archivos htm por razones
  de espacio. Se agregaron algunos comandos (por ejemplo, rdisk).
  Dividi&oacute; la ayuda en una versi&oacute;n de internet (con enlaces dentro
  de un sitio htm) y una versi&oacute;n de FreeDOS (sin enlaces dentro de
  un sitio htm, sin im&aacute;genes de fondo y as&iacute; sucesivamente para que
  se necesite menos espacio en un disquete). Actualiz&oacute; los archivos
  LSM.

  Ayuda de FreeDOS (hhstndrd 1.0.6 en + hhstndrd 1.0.6 de)
  Cre&oacute; un sistema de archivos htm completamente nuevo:
  El texto NO est&aacute; en htm, por lo que es muy sencillo corregir
  fallos. Solo tiene que mirar que la l&iacute;nea no tenga m&aacute;s de 74 (!!!)
  letras. Actualizado a un "aspecto &uacute;nico". Se agreg&oacute; soporte para
  el idioma alem&aacute;n. Se agregaron varios comandos y muchos comentarios.
  Construido en muchos errores nuevos (&iexcl;por supuesto!)
  Editor: W. Spiegl; Fecha de lanzamiento: 30 de marzo de 2009.

  Ayuda de FreeDOS (hhstndrd 1.0.5 en)
  El soporte de la estructura del directorio mejor&oacute; y simplific&oacute; a&uacute;n
  m&aacute;s. Se agreg&oacute; un archivo de ayuda para append. Enlace fijo a 
  "Otras formas de obtener ayuda" en la p&aacute;gina de contenido. Se agreg&oacute;
  un poco m&aacute;s de explicaci&oacute;n al archivo de ayuda del comando de
  edici&oacute;n.

  Ayuda de FreeDOS (hhstndrd 1.0.4 en)
  * Apoyo internacional proporcionado. Directorio reestructurado para
    facilitar a los traductores y permitir m&uacute;ltiples idiomas en un solo
    sistema.
  De ah&iacute; los archivos de ayuda renombrados a hhstndrd 1.0.4 en.
  * Actualizaci&oacute;n dram&aacute;tica de muchos archivos, adem&aacute;s de la adici&oacute;n de
    nuevos para LBAcache, CDRcache, Bootfix, Himem, etc.
  * Contribuciones de Aitor y Henrique Peron: pantalla actualizada.htm,
    reemplazada cpi.htm con cpidos.htm
    Se agregaron kpdos.htm y kc.htm.
  Editor: Robert Platt. Fecha de lanzamiento: 16 de mayo de 2004.

  Ayuda de FreeDOS (hhstndrd 1.0.3)
  Visor HTML 5.3.1 corrige muchos errores de datos largos, ninguno de
  ellos importantes, y tambi&eacute;n soluciona algunos problemas introducidos
  con el soporte zip en el visor 5.3. Adem&aacute;s, se ha agregado un cuadro
  de b&uacute;squeda al espectador. Se agreg&oacute; una explicaci&oacute;n de soporte de
  zip a <a href="../authors/writing.htm">writing.htm</a>.

  Ayuda de FreeDOS (hhstndrd 1.0.2)
  Visor HTML 5.3 incluido.
  (Proporciona soporte para ayuda comprimida en archivos zip)
  Archivos actualizados para pa&iacute;s/teclado por Henrique y Aitor
  (CPI, XKeyb, Keyb, Display, (Modecon), Printer)
  Enlaces fijos en batch/index.htm
  Enlaces figos en cnfigsys/index.htm
  Editor: Robert Platt. Fecha de lanzamiento: 04 de marzo de 2004

  Ayuda de FreeDOS (hhstndrd 1.0.1)
  Ayuda agregada para los comandos config.sys:
    - echo
    - menu
    - menudefault
    - screen
  Ayuda adicional para:
    - (atapicdd.sys)
    - callver
    - display
    - loadfix
    - (modecon)
    - graftabl
    - (setver)
    - scankbd, keyman, listxdef (utilidades de xkeyb)
  Eliminado obsoletos.htm.
  Se hicieron correcciones a:
    - graphics
    - mirror
    - undelete
    - unformat
  Henrique y Aitor actualizaron xkeyb.htm
  Incluido el visor HTML 5.2.1
  Editor: Robert Platt. Fecha de lanzamiento: 17 de julio de 2003

  Ayuda de FreeDOS (hhstndrd 1.0)
  Primera versi&oacute;n de este sistema de ayuda HTML.
  Incluido el visor de ayuda HTML 5.2
  Editor: Robert Platt. Fecha de lanzamiento: 12 de junio de 2003
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2003 Robert Platt, Modificado en 2007 por W. Spiegl.</b>
  Traducido en 2020 por <b>Lorenzo del Toro Saravia</b>.

  Este archivo se deriva del comando de especificaciones HOWTO de
  FreeDOS.
  Consulte el archivo <a href="../other/h2cpying.htm">H2Cpying</a> para ver las condiciones de copia.

</pre></body></html>
