<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>LICENCIA P&Uacute;BLICA GENERAL GNU Ver. 1.1</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>LICENCIA P&Uacute;BLICA GENERAL GNU Ver. 1.1</h1>
<pre>
        GNU Documentaci&oacute;n de licencia libre
                  Versi&oacute;n 1.1, Marzo 2000

 Copyright (C) 2000 Free Software Foundation, Inc.
 59 Temple Place, Suite 330, Boston, MA  02111-1307 USA
 Se permite la copia y distribuci&oacute;n de copias literal de
 este documento de licencia, pero los cambios no estan
 permitidos.
 

0. PRE&Aacute;MBULO

El prop&oacute;sito de esta licencia es hacer un manual, libro de texto, u otro
documento "libre" escrito en el sentido de la libertad: asegurar a todo
el mundo la libertad efectiva de copiarlo y redistribuirlo, con o sin
modificaciones, de manera comercial o no. En segundo lugar, esta licencia
proporciona al autor y al editor una manera de optener reconocimiento por
su trabajo, aunque no se considera responsable de las modificaciones
realizadas por otros.

Esta licencia es una especie de "copyleft", lo que significa que los
trabajos derivados de el documento deben a su vez ser libres en el mismo
sentido. Lo completa la licencia p&uacute;blica general de GNU, que es una
copyleft licencia dise&ntilde;ada para el software libre.

Hemos dise&ntilde;ado esta Licencia para usarla en manuales de software libre, ya
que el software libre necesita documentaci&oacute;n libre: un programa libre debe
venir con manuales que ofrezcan las mismas libertades que el software
hace. pero esta licencia no se limita a manuales de sofware; puede ser
utilizado para cualquier texto, sin tener en cuenta de la materia o si se
publica como libro impreso. Recomendamos esta licencia principalmente para
trabajos cuyo fin sea instructivo o de referencia.


1. APLICABILIDAD Y DEFINICIONES

Esta Licencia se aplica a cualquier manual u otro trabajo que contenga una
nota colocada por el tenedor del copyright diciendo que puede ser
distribuido en los t&eacute;rminos de esta licencia. El "Documento", en adelante,
se refiere a cualquier de esos manuales o trabajos. Cualquier miembro del
p&uacute;blico es un licenciatario, y es denominado "usted".

Una "Versi&oacute;n Modificada" del Documento significa cualquier trabajo que
contenga el documento o una porci&oacute;n del mismo, ya sea una copia literal o
con modificaciones y/o traducido a otro idioma.

Una "Secci&oacute;n Secundaria" es una seci&oacute;n preliminar del ap&eacute;ndice o
denominaci&oacute;n del Documento que trata exclusivamente de la relaci&oacute;n de los
editores o autores del Documento con el tema general del Documento (O
temas relacionados) y no contiene nada que entre directamente en dicho
tema general (Por ejemplo, si el Documento es en parte un texto de
matem&aacute;ticas, una secci&oacute;n secundaria puede no explicar nada de las
matem&aacute;ticas) La realci&oacute;n puede ser un saunto de historia relacionado con
el tema o temas, o una opini&oacute;n legal, pocisi&oacute;n comercial, filos&oacute;fica,
&eacute;tica o pol&iacute;tica acerca de ellos.

Las "Secciones Invariantes" son ciertas Secciones Secundarias cuyos t&iacute;tulos
son denominados como los de las Secciones Invariantes en el aviso que dice
que el documento es liberado bajo esta Licencia.

Los "Textos de Cubierta" son ciertos pasajes cortos de texto que se listan,
como Textos de Cubierta Delantera o Textos de Cubierta Trasera en la nota
que indica que el documento es liberado bajo esta Licencia.

Una copia "Transparente" del Documento, significa una copia legible por
m&aacute;quina, representada en un formato cuya especificaci&oacute;n est&aacute; disponible al
p&uacute;blico en general, cuyos contenidos pueden ser vistos y editados
directamente con editores de texto gen&eacute;ricos o (para im&aacute;genes compuestas
por puntos) con programas gen&eacute;ricos o (para dibujos) con algunos
ampliamente disponibles editores de dibujo, y que sea adecuado como entrada
para formateadores de texto o para la traducci&oacute;n autom&aacute;tica a una variedad
de formatos adecuados para la entrada para formateadores de texto. Una
copia hecha en un archivo que no sea Transparente formato cuya marcado
ha sido dise&ntilde;ado para impedir o dificultar modificaci&oacute;n posterior de los
lectores no es Transparente. Se realiza una copia no es "Transparente" es
llamada "Opaca".

Como ejemplos de formatos adecuados para copias Transparentes est&aacute;n ASCII
puro sin marcaje, formato de entrada de Texinfo, formato de LaTeX entrada,
SGML o XML usando una DTD disponible p&uacute;blicamente, y que sigan los
est&aacute;ndares HTML simple dise&ntilde;ado para modificaciones humanas. Los formatos
Opacos incluyen PostScript, PDF, formatos propietarios que pueden ser
le&iacute;dos y editados &uacute;nicamente en procesadores de palabras propietarios,
SGML o XML para los cu&aacute;les las DTD y/o herramientas de procesamiento no
est&aacute;n disponibles generalmente, y el HTML generado por m&aacute;quinas producidas
por algunos procesadores de palabras s&oacute;lo como salida.

La " Portada" significa, en un libro impreso, la p&aacute;gina de t&iacute;tulo, m&aacute;s las
p&aacute;ginas siguientes que sean necesarias para mantener legiblemente el
material que esta Licencia requiere en la portada. Para trabajos en
formatos que no tienen p&aacute;gina de portada como tal, "Portada" significa el
texto cercano a la aparici&oacute;n m&aacute;s prominente del t&iacute;tulo del trabajo,
precediendo el comienzo del cuerpo del texto.


2. Copia literal

Puede copiar y distribuir el Documento en cualquier medio, ya sea
comercial o no, siempre y cuando esta Licencia, las notas de copyright y
la nota de licencia indica que esta Licencia se aplica al Documento se
reproduzcan en todas las copias y que usted no a&ntilde;ada alguna otra condici&oacute;n
a los de esta Licencia. Usted no puede usar medidas t&eacute;cnicas para obstruir
o controlar la lectura o copia posterior de las copias que usted haga o
distribuya. Sin embargo, usted puede aceptar compensaci&oacute;n a cambio de las
copias. Si distribuye un n&uacute;mero suficientemente grande de copias tambi&eacute;n
deber&aacute; seguir las condiciones de la secci&oacute;n 3.

Usted tambi&eacute;n puede prestar copias, bajo las mismas condiciones
establecidas anteriormente, y puede exhibir copias p&uacute;blicamente.


3. COPIADO EN CANTIDAD

Si publica copias impresas del Documento que sobrepasen las 100, y la
nota de Licencia del Documento exige Textos de Cubierta, debe encerrar
las copias con cubiertas que lleven en forma clara y legible todos esos
Textos de Cubierta: Textos de Cubierta Delantera en la parte delantera
cubrir y Textos de Cubierta Trasera en la cubierta trasera. Ambas
cubiertas deben clara y legible que identificar&aacute; como editor de tales
copias. La cubierta debe mostrar el t&iacute;tulo completo con todas las
palabras del t&iacute;tulo igualmente prominentes y visibles. Usted puede a&ntilde;adir
otro material en las cubiertas. Las copias con cambios limitados a las
cubiertas, siempre que conserven el t&iacute;tulo del Documento y satisfagan
estas condiciones, pueden considerarse como copias literales en otros
aspectos.

Si los textos requeridos para la cubierta son muy voluminosos para que
ajusten legiblemente, debe colocar los primeros mencionados (tantos como
sea razonable colocar) en la verdadera cubierta y situar el resto en
p&aacute;ginas adyacentes.

Si publica o distribuye copias Opacas del Documento cuya cantidad exceda
las 100, debe incluir una copia legible por m&aacute;quina transparente junto con
cada copia Opaca, o bien mostrar, en cada copia Opaca un lugar accesible
al p&uacute;blico por computadora de la red que contiene una completa copia
Transparente del Documento, sin material adicional, que el p&uacute;blico en
general en la red utilizando tiene acceso a la descarga an&oacute;nimamente sin
cargo usando protocolos p&uacute;blicos y est&aacute;ndar. Si utiliza esta &uacute;ltima
opci&oacute;n, deber&aacute; tomar las medidas necesarias, cuando comience la
distribuci&oacute;n de las copias Opacas en cantidad, para asegurar que esta
copia Transparente permanecer&aacute; accesible en el sitio establecido por lo
menos un a&ntilde;o despu&eacute;s de la &uacute;ltima vez que distribuya una copia Opaca
(directamente oa trav&eacute;s de sus agentes o distribuidores) de esa edici&oacute;n
al p&uacute;blico.

Se solicita, aunque no es obligatorio, que se contacte con los autores
del Documento antes de redistribuir gran n&uacute;mero de copias, para darles
la oportunidad de que le proporcionen una versi&oacute;n actualizada del
Documento.


4. MODIFICACIONES

Puede copiar y distribuir una Versi&oacute;n Modificada del Documento bajo las
condiciones de las secciones 2 y 3 anteriores, siempre que usted libere
la Versi&oacute;n Modificada bajo esta misma Licencia, con la Versi&oacute;n
Modificada haciendo el rol del Documento, por lo tanto la distribuci&oacute;n
de licencias y modificaci&oacute;n de la Versi&oacute;n Modificada a quienquiera posea
una copia de la misma. Adem&aacute;s, debe hacer lo siguiente en la Versi&oacute;n
Modificada:

A. Usar en el t&iacute;tulo de la p&aacute;gina (y en las cubiertas, si hay alguna)
   un t&iacute;tulo distinto al del Documento y de sus versiones anteriores
   (que deber&iacute;an, si hay alguna, estar listadas en la secci&oacute;n de
   Historia del Documento). Puede usar el mismo t&iacute;tulo que una versi&oacute;n
   anterior si el editor original de dicha versi&oacute;n da permiso.
B. Listar en la Portada, como autores, una o m&aacute;s personas o entidades
   responsables de la autor&iacute;a de las modificaciones de la Versi&oacute;n
   Modificada, junto con por lo menos cinco de los autores principales
   del Documento (todos sus autores principales, si tiene menos de cinco).
C. Mostrar en la Portada como editor el nombre del editor de la Versi&oacute;n
   Modificada, como quien publica.
D. Conservar todas las notas de copyright del Documento .
E. A&ntilde;adir una nota de copyright apropiada a sus modificaciones, adyacente
   a las otras notas de copyright.
F. Incluir, inmediatamente despu&eacute;s de las notas de copyright, una nota de
   licencia dando el permiso para usar la Versi&oacute;n Modificada bajo los
   t&eacute;rminos de esta Licencia, de la forma que se muestra en la Adenda a
   continuaci&oacute;n.
G. Conservar en esa nota de licencia el listado completo de las Secciones
   Invariantes y de los Textos de Cubierta que sean requeridos en la nota
   de Licencia del Documento original.
H. Incluir una copia sin modificaci&oacute;n de esta Licencia.
I. Conservar la secci&oacute;n titulada "Historia", y su t&iacute;tulo, y a&ntilde;adirle un
   elemento que declare al menos el t&iacute;tulo, el a&ntilde;o, los nuevos autores y
   el editor de la Versi&oacute;n Modificada como reza en la Portada. Si no hay
   una secci&oacute;n titulada "Historia" en el Documento, crear una
   estableciendo el t&iacute;tulo, el a&ntilde;o, los autores y el editor del Documento,
   tal como figuran en su Portada, a&ntilde;adiendo adem&aacute;s un elemento
   describiendo la Versi&oacute;n Modificada, como se estableci&oacute; en la oraci&oacute;n
   anterior.
J. Conservar la direcci&oacute;n en red, si la hay, dada en el Documento para el
   acceso p&uacute;blico a una copia Transparente del mismo, as&iacute; como las otras
   direcciones de red dadas en el Documento para versiones anteriores se
   basa. Pueden ubicarse en la secci&oacute;n "Historia". Se puede omitir la
   ubicaci&oacute;n en red de un trabajo que haya sido publicado por lo menos
   cuatro a&ntilde;os antes que el Documento mismo, o si el editor original de
   dicha versi&oacute;n da permiso.
K. En cualquier secci&oacute;n titulada "Agradecimientos" o "Dedicatorias",
   preservar el t&iacute;tulo de la secci&oacute;n, y preservar en la secci&oacute;n toda la
   sustancia y el tono de cada uno de los reconocimientos a los
   contribuyentes y/o dedicatorias incluidas.
L. Conservar todas las Secciones Invariantes del Documento, sin alterar
   su texto ni sus t&iacute;tulos. N&uacute;meros de secci&oacute;n o el equivalente no son
   considerados parte de los t&iacute;tulos de la secci&oacute;n.
M. Borrar cualquier secci&oacute;n titulada "Aprobaciones". Tales secciones no
   pueden estar incluidas en las Versiones Modificadas.
N. No cambiar el t&iacute;tulo de ninguna secci&oacute;n existente como "Aprobaciones"
   o que entre en conflicto con el de alguna Secci&oacute;n Invariante.

Si la Versi&oacute;n Modificada incluye secciones frontal o ap&eacute;ndices que
califiquen como Secciones Secundarias y contienen material no copiado
del Documento nuevo, usted puede opcionalmente designar algunas o todas
esas secciones como invariantes. Para hacerlo, a&ntilde;ada sus t&iacute;tulos a la
lista de Secciones Invariantes en la nota de licencia de la Versi&oacute;n
Modificada. Tales t&iacute;tulos deben ser distintos de cualquier otro t&iacute;tulo
de secci&oacute;n.

Puede a&ntilde;adir una secci&oacute;n titulada "Aprobaciones", siempre que contenga
&uacute;nicamente aprobaciones de su Versi&oacute;n Modificada por varias fuentes - por
ejemplo, observaciones de peritos o que el texto ha sido aprobado por una
organizaci&oacute;n como la definici&oacute;n oficial de un est&aacute;ndar.

Puede a&ntilde;adir un pasaje de hasta cinco palabras como un Texto de Cubierta
Delantera y un pasaje de hasta 25 palabras como Texto de Cubierta
Posterior, al final de la lista de Textos de Cubierta en la Versi&oacute;n
Modificada. Solamente un pasaje de Texto de Cubierta Delantera y uno de
Texto de Cubierta Trasera puede ser a&ntilde;adido por (oa manera de arreglos
hechos por) una entidad. Si el Documento ya incluye un texto de cubierta
para la misma cubierta, previamente adicionado por usted o por arreglo
hecho por la misma entidad que usted est&aacute; actuando en su nombre, usted no
puede a&ntilde;adir otro; pero puede reemplazar el anterior, con permiso
expl&iacute;cito del el editor anterior, que a&ntilde;adi&oacute; a la antigua.

El autor (es) y editor (es) del documento no con esta Licencia permiso
para usar sus nombres para publicidad ni para asegurar o implicar
aprobaci&oacute;n de cualquier Versi&oacute;n Modificada.


5. COMBINACI&Oacute;N DE DOCUMENTOS

Usted puede combinar el Documento con otros documentos liberados bajo
esta Licencia, bajo los t&eacute;rminos definidos en la secci&oacute;n 4 anterior para
versiones modificadas, siempre que incluya en la combinaci&oacute;n todas las
Secciones Invariantes de todos los documentos originales, sin modificar,
listadas todas como Secciones Invariantes del trabajo combinado en su
nota de licencia.

El trabajo combinado necesita contener solamente una copia de esta
Licencia, y m&uacute;ltiples Secciones Invariantes id&eacute;nticas pueden ser
reemplazadas por una sola copia. Si hay varias Secciones Invariantes con
el mismo nombre pero con contenidos diferentes, haga el t&iacute;tulo de cada
una de estas secciones &uacute;nico a&ntilde;adi&eacute;ndole al final del mismo, entre
par&eacute;ntesis, el nombre del autor o editor original de esa secci&oacute;n, si
es conocido, o bien una n&uacute;mero &uacute;nico. Haga el mismo ajuste a los t&iacute;tulos
de secci&oacute;n en la lista de Secciones Invariantes en la nota de licencia
del trabajo combinado.

En la combinaci&oacute;n, debe combinar cualquier secci&oacute;n titulada "Historia" de
los varios documentos originales, formando una secci&oacute;n titulada "Historia";
asimismo combinar cualquier secci&oacute;n titulada "Agradecimientos", y cualquier
secci&oacute;n titulada "Dedicatorias". Debe borrar todas las secciones tituladas
"Aprobaciones".


6. COLECCIONES DE DOCUMENTOS

Puede hacer una colecci&oacute;n consistente del Documento y otros documentos
liberados bajo esta Licencia, y reemplazar las copias individuales de
esta Licencia en todos los documentos por una sola copia que est&eacute; incluida
en la colecci&oacute;n, siempre que siga las reglas de esta Licencia para copia
literal de cada uno de los documentos al otros aspectos.

Puede extraer un solo documento de una de tales colecciones y distribuirlo
individualmente bajo esta Licencia, siempre que inserte una copia de esta
Licencia en el documento extra&iacute;do, y siga esta Licencia en todos los dem&aacute;s
aspectos relativos a la copia literal de dicho documento.


7. AGREGACI&Oacute;N CON TRABAJOS INDEPENDIENTES

Una recopilaci&oacute;n del Documento o de sus derivados con otros documentos
o trabajos separados e independientes, en o sobre un volumen de
almacenamiento o medio de distribuci&oacute;n, no se cuenta como un todo como
una Versi&oacute;n Modificada del Documento, siempre que no copyright de la
compilaci&oacute;n se pretenda que la compilaci&oacute;n. Tal recopilaci&oacute;n es llamada
un "agregado", y esta Licencia no se aplica a los otros trabajos
auto-contenidos y por lo tanto compilados con el Documento, oa cuenta de
haber sido compilados, si no son ellos mismos trabajos derivados del
Documento.

Si el requisito de Texto de Cubierta de la secci&oacute;n 3 es aplicable a estas
copias del Documento y el Documento es menor que un cuarto del agregado
entero, los Textos de Cubierta del Documento pueden colocarse en
cubiertas que enmarquen solamente el Documento dentro del agregado. En
caso contrario deben aparecer en cubiertas enmarcando todo el agregado.


8. TRADUCCI&Oacute;N

La traducci&oacute;n se considera un tipo de modificaci&oacute;n, por lo que puede
distribuir traducciones del Documento bajo los t&eacute;rminos de la secci&oacute;n 4.
El reemplazo las Secciones Invariantes con traducciones requiere permiso
especial de los due&ntilde;os de derechos de autor, pero usted puede a&ntilde;adir
traducciones de algunas o todas las Secciones Invariantes adem&aacute;s de las
versiones originales de las Secciones Invariantes. Puede incluir una
traducci&oacute;n de esta Licencia siempre que incluya tambi&eacute;n la versi&oacute;n en
Ingl&eacute;s de esta Licencia. En caso de desacuerdo entre la traducci&oacute;n y la
versi&oacute;n original en Ingl&eacute;s de esta Licencia, la versi&oacute;n original en
Ingl&eacute;s prevalecer&aacute;.


9. TERMINACI&Oacute;N

Usted no puede copiar, modificar, sublicenciar o distribuir el Documento
salvo lo dispuesto expresamente en esta Licencia. Cualquier otro intento
de copiar, modificar, sublicenciar o distribuir el Documento es nulo, y
dar&aacute; por terminados autom&aacute;ticamente sus derechos bajo esta Licencia. Sin
embargo, las partes que hayan recibido copias o derechos de usted bajo
esta Licencia no ver&aacute;n terminadas sus licencias, siempre que permanezcan
en total conformidad.


10. REVISIONES FUTURAS DE ESTA LICENCIA

La Free Software Foundation puede publicar versiones nuevas y revisadas
de la Licencia de Documentaci&oacute;n Libre de vez en cuando. Dichas nuevas
versiones ser&aacute;n similares en esp&iacute;ritu a la presente versi&oacute;n, pero pueden
diferir en detalles para considerar nuevos problemas o situaciones. (Ver:
http://www.gnu.org/copyleft/).

Cada versi&oacute;n de la Licencia tiene un n&uacute;mero de versi&oacute;n que la distingue.
Si el Documento especifica que una versi&oacute;n numerada en particular de esta
licencia o "cualquier versi&oacute;n posterior" se aplica a &eacute;l, usted tiene la
opci&oacute;n de seguir los t&eacute;rminos y condiciones, bien de esa versi&oacute;n
especificada o cualquiera posterior que haya sido publicada (no como un
borrador) por la Free Software Foundation. Si el Documento no especifica
un n&uacute;mero de versi&oacute;n de esta Licencia, puede escoger cualquier versi&oacute;n
que haya sido publicada (no como un borrador) por la Free Software
Foundation.


ADENDA: C&oacute;mo usar esta Licencia para sus documentos

Para usar esta licencia en un documento que usted haya escrito, incluya
una copia de la Licencia en el documento y ponga el siguiente copyright
y nota de licencia justo despu&eacute;s de la p&aacute;gina de t&iacute;tulo:

      Copyright (c) A&Ntilde;O SU NOMBRE.
      Se concede permiso para copiar, distribuir y/o modificar
      este documento bajo los t&eacute;rminos de la Licencia de
      Documentaci&oacute;n Libre de GNU, Versi&oacute;n 1.1 o cualquier
      versi&oacute;n posterior publicada por la Free Software Foundation;
      siendo las Secciones Invariantes LISTE SUS T&Iacute;TULOS, con el
      Frente-Cover textos LIST, y con los Textos de Cubierta
      Trasera LISTAR.
      Una copia de la licencia est&aacute; incluida en la secci&oacute;n titulada
      "GNU Free Documentation License".

Si no tiene Secciones Invariantes, escriba "sin Secciones Invariantes"
en vez de decir cu&aacute;les son invariantes. Si usted no tiene Textos de
Cubierta Delantera, escriba "sin Textos de Cubierta Delantera" en lugar
de "Textos de Cubierta Delantera LISTA", del mismo modo para los Textos
de Cubierta Trasera.

Si su documento contiene ejemplos de c&oacute;digo de programa no triviales,
recomendamos liberar estos ejemplos en paralelo bajo su elecci&oacute;n de
licencia de software libre, como la Licencia P&uacute;blica General GNU, para
permitir su uso en software libre.



</pre></body></html>
