<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>LICENCIA P&Uacute;BLICA GENERAL GNU Ver. 2</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>LICENCIA P&Uacute;BLICA GENERAL GNU Ver. 2</h1>
<pre>
    *  LICINCIA P&Uacute;BLICA GENERAL GNU
    *
          o Pre&aacute;mbulo
          o LOS T&Eacute;RMINOS Y CONDICIONES PARA LA COPIA, DISTRIBUCI&Oacute;N Y
            MOCIFICACI&Oacute;N
          o Como aplicar estos t&eacute;rminos a sus nuevos programas

LICENCIA P&Uacute;BLICA GENERAL GNU

Versi&oacute;n 2, Junio del 1991

Copyright (C) 1989, 1991 Free Software Foundation, Inc.
51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA

Se permite la copia y distribuci&oacute;n de copias literales de este documento
de licencia, pero el cambio no est&aacute; permitido.


Pre&aacute;mbulo

Las licencias para la mayor&iacute;a del software est&aacute;n dise&ntilde;adas para quitarle
a usted la libertad de compartirlo y modificarlo. Por el contrario, la
Licencia P&uacute;blica General de GNU pretende garantizarle la libertad de
compartir y modificar software libre - para asegurarse de que el software
es libre para todos sus usuarios. Esta Licencia P&uacute;blica General se aplica
a la mayor parte del software del la Free Software Foundation ya cualquier
otro programa si sus autores se comprometen a utilizarla. (Algunas
aplicaciones de Free Software Foundation que est&aacute; cubierto por la
Licencia P&uacute;blica General de GNU) Usted tambi&eacute;n puede aplicarla a sus
propios programas.

Cuando hablamos de software libre, estamos refiri&eacute;ndonos a libertad, no
de precio. Nuestras Licencias P&uacute;blicas Generales est&aacute;n dise&ntilde;adas para
asegurarnos de que tenga la libertad de distribuir copias de software
libre (y cobrar por ese servicio si quiere), de que reciba el c&oacute;digo
fuente o que pueda conseguirlo si lo quiere, de que se puede cambiar el
software o usar fragmentos de &eacute;l en nuevos programas libres, y de que
sepa que puede hacer todas estas cosas.

Para proteger sus derechos necesitamos algunas restricciones que prohiban
a cualquiera negarle a usted estos derechos o pedirle que renuncie a
los derechos. Estas restricciones se traducen en ciertas obligaciones
que le afectan si distribuye copias del software, o si lo modifica.

Por ejemplo, si distribuye copias de uno de estos programas, sea
gratuitamente, oa cambio de una contraprestaci&oacute;n, debe dar a los
receptores todos los derechos que usted tiene. Debe asegurarse de que
ellos tambi&eacute;n reciben, o pueden conseguir, el c&oacute;digo fuente. Y debe
mostrarles estas condiciones de forma que conozcan sus derechos.

Nosotros protegemos sus derechos con dos pasos:
 (1) el software bajo copyright y
 (2) le ofrecemos esta licencia, que le da permiso legal para
     copiar, distribuir y / o modificar el software.

Tambi&eacute;n, para la protecci&oacute;n de cada autor y la nuestra propia, queremos
asegurarnos de que todo el mundo comprende que no se proporciona ninguna
garant&iacute;a para este software libre.
Si el software es modificado por alguien y lo distribuye, queremos que
sus receptores sepan que lo que tienen no es el original, de forma que
cualquier problema introducido por otros no afecte a la reputaci&oacute;n de
los autores originales.

Por &uacute;ltimo, cualquier programa libre est&aacute; constantemente amenazado por
las patentes de software. Queremos evitar el peligro de que los
redistribuidores de un programa libre obtengan patentes por su cuenta,
convirtiendo de facto el programa en propietario. Para evitar esto,
hemos dejado claro que cualquier patente debe ser pedida para el uso
libre de cualquiera, o no ser pedida.

Los t&eacute;rminos y las condiciones exactas para la copia, distribuci&oacute;n y
modificaci&oacute;n. T&Eacute;RMINOS Y CONDICIONES PARA LA COPIA , DISTRIBUCI&Oacute;N Y
MODIFICACI&Oacute;N

0. Esta Licencia se aplica a cualquier programa u otro trabajo que
contenga una nota colocada por el tenedor del copyright diciendo que
puede ser distribuido bajo los t&eacute;rminos de esta Licencia P&uacute;blica General.
El "Programa" se referir&aacute; a cualquier programa o trabajo , y un "trabajo
basado en el Programa" se referir&aacute; bien al Programa oa cualquier trabajo
derivado de &eacute;l seg&uacute;n la ley de copyright: es decir, un trabajo que
contenga el programa o una porci&oacute;n de &eacute;l, bien en forma literal o con
modificaciones y/o traducido en otro lenguaje. (En adelante, la
traducci&oacute;n est&aacute; incluida sin limitaciones en el t&eacute;rmino "modificaci&oacute;n")
Cada concesionario se dirige como "usted".

Cualquier otra actividad que no sea la copia, distribuci&oacute;n o
modificaci&oacute;n no est&aacute; cubierta por esta Licencia, est&aacute; fuera de su
alcance. El acto de ejecutar el Programa no est&aacute; restringido, y los
resultados del Programa est&aacute;n cubiertos &uacute;nicamente si sus contenidos
constituyen un trabajo basado en el Programa (independientemente de
haberlo producido mediante la ejecuci&oacute;n del Programa). El que esto se
cumpla, depende de lo que haga el programa.

1. Usted puede copiar y distribuir copias exactas del c&oacute;digo fuente del
Programa, seg&uacute;n lo has recibido, en cualquier medio, siempre que la
adecuada y bien visible publique en cada copia un anuncio de copyright
adecuado y un repudio de garant&iacute;a, mantenga intactos todos los avisos
que se refieran a esta Licencia ya la ausencia de garant&iacute;a, y proporcione
a cualquier otro receptor del programa una copia de esta Licencia junto
con el Programa.

Puede cobrar un precio por el acto f&iacute;sico de transferir una copia, y
puede, seg&uacute;n su libre albedr&iacute;o, ofrecer garant&iacute;a a cambio de una cuota.

2. Usted puede modificar su copia o copias del programa o de cualquier
   porci&oacute;n del mismo, formando de esta manera un trabajo basado en el
   programa, y copiar y distribuir esa modificaci&oacute;n o trabajo bajo los
   terminos del apartado 1 anterior, supuesto que adem&aacute;s cumpla las
   siguientes condiciones:

    a) Usted debe hacer que los ficheros modificados lleven anuncios
       prominentes declarando que usted cambi&oacute; los archivos y la fecha
       de cualquier cambio.
    b) Usted debe hacer que cualquier trabajo que distribuya o publique
       y que en todo o en parte contiene o se deriva del programa o de
       cualquier parte del mismo, sea licenciada como un todo, sin carga
       alguna, partes bajo los t&eacute;rminos de la licencia.
    c) Si el programa modificado lee normalmente &oacute;rdenes interactivamente
       cuando se ejecuta, debe hacer que, cuando comience su ejecuci&oacute;n
       para ese uso interactivo de la forma m&aacute;s habitual, muestre o
       escriba un mensaje que incluya un anuncio de copyright y una
       noticia de que no hay ninguna garant&iacute;a (o por el contrario que
       ofrece garant&iacute;a) y que los usuarios pueden redistribuir el
       programa bajo estas condiciones, e indicando al usuario c&oacute;mo
       ver una copia de esta Licencia. (Excepci&oacute;n: si el propio programa
       es interactivo, pero normalmente no muestra ese anuncio, el trabajo
       basado en el Programa no est&aacute; obligado a imprimir el anuncio).

Estos requisitos se aplican al trabajo modificado como un todo. Si identi-
secciones de declaraci&oacute;n obligatoria de ese trabajo no son derivadas del
Programa, y ??pueden razonablemente, ser consideradas trabajos
independientes y separados por ellos mismos, entonces esta Licencia y sus
t&eacute;rminos no se aplican a esas partes cuando sean distribuidas como
trabajos separados. Pero cuando distribuya esas mismas secciones como
partes de un todo que es un trabajo basado en el Programa, la
distribuci&oacute;n del todo debe ser seg&uacute;n los t&eacute;rminos de esta licencia, cuyos
permisos para otros licenciatarios se extienden al todo completo, y por
lo tanto todas y cada una independientemente de qui&eacute;n la escribi&oacute;.

Por lo tanto, no es la intenci&oacute;n de este apartado reclamar derechos o
desafiar sus derechos sobre trabajos escritos totalmente por usted, sino
que la intenci&oacute;n es ejercer el derecho a controlar la distri-
Obras colectivas basadas en el Programa.

Adem&aacute;s, el simple hecho de reunir un trabajo no basado en el Programa
con el Programa (o con un trabajo basado en el Programa) en un volumen de
un medio de almacenamiento o distribuci&oacute;n no hace que dicho trabajo entre
dentro el alcance de esta licencia.

3. Puede copiar y distribuir el Programa (o un trabajo basado en &eacute;l,
   bajo la Secci&oacute;n 2) en c&oacute;digo objeto o en formato ejecutable seg&uacute;n los
   t&eacute;rminos de las Secciones 1 y 2, supuesto que adem&aacute;s cumpla una de las
   siguiendo:

    a) Acompa&ntilde;arlo con la completa correspondiente legible por m&aacute;quina
       c&oacute;digo fuente, que debe ser distribuido bajo los t&eacute;rminos de
       Secciones 1 y 2 anteriores en un medio utilizado habitualmente
       para el software intercambio, o bien,
    b) Acompa&ntilde;arlo con una oferta por escrito, v&aacute;lida durante al menos
       tres a&ntilde;os, para dar a cualquier tercero, por un precio no superior
       al coste de realizar f&iacute;sicamente la distribuci&oacute;n del c&oacute;digo
       fuente, una m&aacute;quina-completo copia legible del c&oacute;digo fuente
       correspondiente, a distribuir en los t&eacute;rminos de las Secciones
       1 y 2 anteriores, en un medio habitualmente utilizado para el
       intercambio de programas, o
    c) Acompa&ntilde;arlo con la informaci&oacute;n que recibi&oacute; sobre la oferta de
       distribuir el c&oacute;digo fuente correspondiente. (Esta opci&oacute;n se
       permite s&oacute;lo para distribuci&oacute;n no comercial y s&oacute;lo si usted
       recibi&oacute; el programa como c&oacute;digo objeto o en formato ejecutable
       con tal oferta, de acuerdo con el apartado b anterior).

El c&oacute;digo fuente de un trabajo se entiende la forma preferida del trabajo
para hacer modificaciones a la misma. Para un trabajo ejecutable,
complete fuente c&oacute;digo significa todo el c&oacute;digo fuente para todos los
m&oacute;dulos que contiene, m&aacute;s cualquier archivos de definici&oacute;n de interfaz
asociados, m&aacute;s los guiones utilizados para controlar la la compilaci&oacute;n
e instalaci&oacute;n del ejecutable. Sin embargo, como un especial 
excepci&oacute;n, el c&oacute;digo fuente distribuido no necesita incluir nada que
es distribuido normalmente (ya sea fuente o binario) con el
componentes principales (compilador, kernel y similares) del sistema
operativo en la que el ejecutable, a no ser que el propio componente
acompa&ntilde;e el ejecutable.

Si la distribuci&oacute;n del ejecutable o del c&oacute;digo objeto se realiza
ofreciendo acceso copiar desde un lugar designado, entonces el ofrecer
acceso equivalente para copiar el c&oacute;digo fuente del mismo lugar como
distribuci&oacute;n del c&oacute;digo c&oacute;digo, incluso aunque terceras partes no est&eacute;n
forzadas a copiar el fuente junto con el c&oacute;digo objeto.

4. Usted no puede copiar, modificar, sublicenciar o distribuir el
   Programa excepto como prev&eacute; expresamente esta Licencia. Cualquier
   intento de copiar, modificar, sublicenciar o distribuir el programa
   es nulo, y terminar&aacute; autom&aacute;ticamente sus derechos bajo esa Licencia.
   Sin embargo, las partes que hayan recibido copias o derechos de
   usted bajo esta Licencia no ver&aacute;n terminadas sus licencias, siempre
   que tales partes contin&uacute;en cumpli&eacute;ndola.

5. Usted no est&aacute; obligado a aceptar esta licencia, ya que no tiene
   firmado. Sin embargo, no hay nada m&aacute;s que le proporcione permiso para
   modificar o distribuir el Programa o sus trabajos derivados. Estas
   acciones son prohibidas por la ley si no acepta esta Licencia. Por
   lo tanto, por modifica o distribuye el Programa (o cualquier trabajo
   basado en el Programa), est&aacute; indicando que acepta esta Licencia para
   poder hacerlo, y todos sus t&eacute;rminos y condiciones para copiar,
   distribuir o modificar el Programa o trabajos basados ??en &eacute;l.

6. Cada vez que redistribuya el Programa (o cualquier trabajo basado en
   el Programa), el receptor recibe autom&aacute;ticamente una licencia del
   licenciatario original para copiar, distribuir o modificar el Programa
   sujeto a estos t&eacute;rminos y condiciones. Usted no puede imponer ninguna
   otra restricciones al ejercicio de los derechos de los beneficiarios
   otorgan el presente documento.
   Usted no es responsable de asegurar el cumplimiento por parte de
   terceros esta Licencia.

7. Si, como consecuencia de una resoluci&oacute;n judicial o de una alegaci&oacute;n de
   la patente infracci&oacute;n o por cualquier otra raz&oacute;n (no limitada a
   asuntos relacionados con patentes), se le imponen condiciones (ya sea
   por orden judicial, acuerdo o de otro modo) que contradigan las
   condiciones de esta Licencia, que hacen No le exime de cumplir las
   condiciones de esta Licencia. Si usted no puede distribuciones de
   forma que se satisfagan simult&aacute;neamente sus obligaciones bajo esta
   Licencia y cualquier otra obligaci&oacute;n pertinente entonces, como un
   consecuencia, no puede distribuir el Programa de ninguna forma. Por
   ejemplo, si una licencia de patente no permite la redistribuci&oacute;n
   libre de derechos de del Programa por todos aquellos que reciban
   copias directa o indirectamente a trav&eacute;s de usted, entonces la
   &uacute;nica forma en que podr&iacute;a satisfacer tanto esa condici&oacute;n como esta

Licencia ser&iacute;a evitar completamente la distribuci&oacute;n del Programa.

Si cualquier porci&oacute;n de este apartado se considera inv&aacute;lida o imposible
de cumplir bajo cualquier circunstancia particular, el resto de la
secci&oacute;n se pretende aplicar y la secci&oacute;n por entero ha de cumplirse en
otras circunstancias.

No es el prop&oacute;sito de este apartado inducirle a infringir ninguna
patentes u otros derechos de propiedad o impugnar la validez de cualquier
dichas reivindicaciones Este apartado tiene el &uacute;nico prop&oacute;sito de
proteger la integridad del sistema de distribuci&oacute;n de software libre,
que se realiza por parte del p&uacute;blico pr&aacute;cticas de licencia. Mucha gente
ha hecho contribuciones generosas a la gran variedad de software
distribuido mediante ese sistema con la confianza constante aplicaci&oacute;n
de este sistema, es decisi&oacute;n del autor / donante decidir si &eacute;l o ella
est&aacute; dispuesto a distribuir software mediante cualquier otro
sistema y una licencia no puede imponer esa elecci&oacute;n.

Este apartado pretende dejar completamente claro lo que se cree que es
una consecuencia del resto de esta Licencia.

8. Si la distribuci&oacute;n y / o uso de el Programa est&aacute; restringida en ciertos
   pa&iacute;ses, bien por patentes o por interfaces bajo copyright, el original
   titular del copyright que coloca este Programa bajo esta Licencia
   puede a&ntilde;adir una limitaci&oacute;n expl&iacute;cita de distribuci&oacute;n geogr&aacute;fica
   excluyendo esos pa&iacute;ses, por lo que la distribuci&oacute;n se permita s&oacute;lo en
   o entre los pa&iacute;ses no excluidos. En tal caso, esta Licencia incorporar
   &aacute; la limitaci&oacute;n como si estuviese escrita en el cuerpo de esta Licencia.

9. La Free Software Foundation puede publicar versiones revisadas y / o
   nuevas versiones de la Licencia P&uacute;blica General de tiempo en tiempo.
   Estas nuevas versiones ser&aacute;n similares en esp&iacute;ritu a la presente
   versi&oacute;n, pero pueden diferir en detalles para considerar nuevos
   problemas o situaciones.

Cada versi&oacute;n recibe un n&uacute;mero de versi&oacute;n que la distingue. Si el
Programa especifica un n&uacute;mero de versi&oacute;n de esta Licencia que se refiere
a ella ya "cualquier versi&oacute;n posterior", usted tiene la opci&oacute;n de seguir
los t&eacute;rminos y condiciones, bien de esa versi&oacute;n, bien de cualquier
versi&oacute;n posterior publicada por la Free Software Foundation. Si el
Programa no especifica un n&uacute;mero de versi&oacute;n de esta Licencia, puedes
escoger cualquier versi&oacute;n publicada por la Free Software Foundation.

10. Si usted desea incorporar partes del Programa en otros gratuita
    programas cuya distribuci&oacute;n condiciones son diferentes, escriba al
    autor para pedirle permiso. Si el software tiene copyright de la
    Free Software Foundation, escriba a la Free Software Foundation, que
    a veces hacemos excepciones. Nuestra decisi&oacute;n estar&aacute; guiada por el
    doble objetivo de preservar la libertad de todos los derivados de
    nuestro libre software y promover el que se comparta y reutilice el
    software en general.

NO GARANT&Iacute;A

11. DEBIDO A QUE EL PROGRAMA SE LICENCIA LIBRE DE CARGAS, NO HAY GARANT&Iacute;A
    PARA EL PROGRAMA, EN LA MEDIDA PERMITIDA POR LA LEY APLICABLE.
    EXCEPTO CUANDO SE INDIQUE LO CONTRARIO POR ESCRITO, LOS TITULARES DEL
    COPYRIGHT Y / U OTRAS PARTES PROPORCIONAN EL PROGRAMA "TAL CUAL" SIN
    GARANT&Iacute;A DE NING&Uacute;N TIPO, EXPRESA O IMPL&Iacute;CITA, INCLUYENDO, PERO NO
    LIMITADO A, LAS GARANT&Iacute;AS IMPL&Iacute;CITAS DE COMERCIALIZACI&Oacute;N Y APTITUD
    PARA UN DETERMINADO FINALIDAD. EL RIESGO EN CUANTO A LA CALIDAD Y
    RENDIMIENTO DEL PROGRAMA EST&Aacute; CON USTED. SI EL PROGRAMA ES
    DEFECTUOSO, USTED ASUME EL COSTE DE CUALQUIER SERVICIO, REPARACI&Oacute;N
    O CORRECCI&Oacute;N.

12. EN NING&Uacute;N CASO, A MENOS QUE LO EXIJA LA LEY APLICABLE O ACUERDO POR
    ESCRITO EL AUTOR O CUALQUIER OTRA PARTE QUE PUEDA MODIFICAR Y / O
    REDISTRIBUIR EL PROGRAMA COMO SE PERMITE ARRIBA, SER&Aacute; RESPONSABLE
    ANTE USTED POR DA&Ntilde;OS, INCLUIDO CUALQUIER DA&Ntilde;O GENERAL, ESPECIAL,
    INCIDENTAL O CONSECUENTE DA&Ntilde;OS DERIVADOS DEL USO O IMPOSIBILIDAD
    DE USO DEL PROGRAMA (INCLUYENDO PERO NO LIMITADO A LA P&Eacute;RDIDA DE
    DATOS O LA GENERACI&Oacute;N DE DATOS INCORRECTOS, LAS P&Eacute;RDIDAS SUFRIDAS
    POR USTED O POR TERCERAS PARTES, O LOS FALLOS DEL PROGRAMA PARA
    OPERAR CON OTROS PROGRAMAS), INCLUSO SI TITULAR U OTRA PARTE HA
    SIDO ADVERTIDO DE LA POSIBILIDAD DE TALES DA&Ntilde;OS.

FIN DE T&Eacute;RMINOS Y CONDICIONES

C&oacute;mo aplicar estos t&eacute;rminos a sus nuevos programas

Si usted desarrolla un nuevo Programa, y ??quiere que sea del mayor
posible uso para el p&uacute;blico, la mejor manera de lograr esto es hacer que
sea software libre que cualquiera pueda redistribuir y cambiar bajo estos
t&eacute;rminos.

Para hacerlo, a&ntilde;ada los siguientes anuncios al programa. Lo m&aacute;s seguro es
que se adjuntar&aacute;n al principio de cada fichero fuente para transmitir lo
m&aacute;s efectivamente la ausencia de garant&iacute;a, y cada fichero deber&iacute;a tener
al menos la L&iacute;nea de &copy; "copyright" y un indicador a d&oacute;nde puede encontrarse
el anuncio completo.

una l&iacute;nea para indicar el nombre del programa y una idea de lo que hace.
Copyright (C) aaaa nombre del autor

Este programa es software libre, puede redistribuirlo y / o
modificarlo bajo los t&eacute;rminos de la Licencia P&uacute;blica General de GNU
publicada por la Free Software Foundation, bien de la versi&oacute;n 2
de la Licencia, o (a su elecci&oacute;n) cualquier versi&oacute;n posterior.

Este programa se distribuye con la esperanza de que sea &uacute;til,
pero SIN NINGUNA GARANT&Iacute;A, incluso sin la garant&iacute;a impl&iacute;cita de
COMERCIALIZACI&Oacute;N o IDONEIDAD PARA UN PROP&Oacute;SITO PARTICULAR. Consulte la
GNU General Public License para m&aacute;s detalles.

Deber&iacute;a haber recibido una copia de la Licencia P&uacute;blica General de GNU
junto con este programa, y ??si no, escriba a la Free Software
Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston,
MA 02110-1301, EE.UU..

A&ntilde;ada tambi&eacute;n informaci&oacute;n sobre c&oacute;mo contactar con usted mediante correo
electr&oacute;nico y postal.

Si el programa es interactivo, haga que muestre un peque&ntilde;o anuncio como
el siguiente cuando comienza a funcionar en modo interactivo:

Gnomovision versi&oacute;n 69, Copyright (C) a&ntilde;o nombre del autor
Gnomovision no ofrece ABSOLUTAMENTE NINGUNA GARANT&Iacute;A; para obtener m&aacute;s
informaci&oacute;n escriba 'show w'. Esto es software libre, y usted es
bienvenido a redistribuirlo bajo ciertas condiciones; escriba 'show c'
para m&aacute;s detalles.

Los comandos hipot&eacute;ticos 'show w' y 'show c' deber&iacute;an mostrar la
partes adecuadas de la Licencia P&uacute;blica General. Por supuesto, los
comandos que use pueden llamarse de cualquier otra 'show w' y 'show c',
sino que podr&iacute;a incluso ser pulsaciones del rat&oacute;n o elementos de men&uacute;
- lo que se adapte a su programa.

Tambi&eacute;n deber&iacute;as conseguir que su empleador (si trabaja como programador)
o su la escuela, en su caso, a firmar una "renuncia de copyright" para
el programa, si necesario. Aqu&iacute; est&aacute; un ejemplo, altere los nombres:

Yoyodyne, Inc. mediante este documento renuncia a cualquier derecho de
autor inter&eacute;s en el programa 'Gnomovision'
(Que hace pasadas a compiladores) escrito
por James Hacker.

firma de Pepito Grillo, 01 de abril 1989
Ty Coon, Presidente de Vice

Esta Licencia P&uacute;blica General no permite que incluya sus programas
en programas propietarios. Si su programa es una biblioteca de subrutinas,
puede considerar m&aacute;s &uacute;til el permitir el enlazado de aplicaciones
propietarias con la biblioteca. Si esto es lo que quiere hacer, utilice
la menor GNU Lesser Licencia P&uacute;blica General en lugar de esta Licencia.

</pre></body></html>
