<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>LICENCIA P&Uacute;BLICA GENERAL GNU Ver. 3</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>LICENCIA P&Uacute;BLICA GENERAL GNU Ver. 3</h1>
<pre>
Versi&oacute;n 3, 29 de junio 2007

Copyright (C) 2007 Free Software Foundation, Inc. http://www.fsf.org

Se permite la copia y distribuci&oacute;n de copias literales de este documento
de licencia, pero no se le permite.

Pre&aacute;mbulo

La Licencia P&uacute;blica General de GNU es una licencia libre, sin derechos
para software y otro tipo de obras.

Las licencias para la mayor&iacute;a del software y otros trabajos pr&aacute;cticos
est&aacute;n destinadas a suprimir la libertad de compartir y modificar esos
trabajos. Por el contrario, la Licencia P&uacute;blica General de GNU pretende
garantizarle la libertad de compartir y modificar todas las versiones de
un programa para asegurarse de que sigue siendo software libre para todos
sus usuarios. Nosotros, la Fundaci&oacute;n de Software Libre, usamos la
Licencia P&uacute;blica General de GNU para la mayor&iacute;a de nuestro software,
sino que tambi&eacute;n se aplica a cualquier trabajo realizado de esta forma
por sus autores. Usted tambi&eacute;n puede aplicarla a sus propios programas.

Cuando hablamos de software libre, estamos refiri&eacute;ndonos a libertad, no
de precio. Nuestras Licencias P&uacute;blicas Generales est&aacute;n dise&ntilde;adas para
asegurarnos de que tenga la libertad de distribuir copias de software
libre (y cobrar por ello si lo desea), que reciba el c&oacute;digo fuente o que
pueda conseguirlo si lo quiere, de que se puede cambiar el software o
usar fragmentos de &eacute;l en nuevos programas libres, y de que sepa que puede
hacer todas estas cosas.

Para proteger sus derechos, necesitamos evitar que otros le nieguen estos
derechos o pedirle que renuncie a ellos. Por lo tanto, usted tiene ciertas
responsabilidades si distribuye copias del software, o si lo modifica:
responsabilidades de respetar la libertad de los dem&aacute;s.

Por ejemplo, si distribuye copias de uno de estos programas, sea
gratuitamente, oa cambio de una contraprestaci&oacute;n, debe transmitir a los
destinatarios los mismos derechos que usted recibi&oacute;. Debe asegurarse de
que ellos tambi&eacute;n reciben, o pueden conseguir, el c&oacute;digo fuente. Y debe
mostrarles estas condiciones de forma que conozcan sus derechos.

Los desarrolladores que usen la GPL GNU protegen sus derechos de dos
formas:
(1) imponen derechos al software, y
(2) le ofrecemos esta licencia que le da permiso legal para copiar,
    distribuir y/o modificar.

Para proteger a desarrolladores y autores, la GPL expone claramente que
no hay ninguna garant&iacute;a para este software libre. Por el bien de ambos,
usuarios y autores, la GPL establece que las versiones modificadas ser&aacute;n
marcados como cambiados, por lo que cualquier problema no sea atribuido
por error a los autores de versiones anteriores.

Algunos dispositivos est&aacute;n dise&ntilde;ados para negar al usuario para instalar
o ejecutar versiones modificadas del software que usan internamente,
aunque el fabricante s&iacute; pueda hacerlo. Esto es completamente incompatible
con el objetivo de proteger la libertad de los usuarios a cambiar el
software. El patr&oacute;n sistem&aacute;tico de tal abuso se produce en el &aacute;mbito de
los productos de uso personal, que es precisamente donde es menos
aceptable. Por lo tanto, hemos dise&ntilde;ado esta versi&oacute;n de la GPL para
prohibir estas pr&aacute;cticas en esos productos. Si apareciesen problemas
similares en otros &aacute;mbitos, estaremos preparados para extender estas
prestaciones a las futuras versiones de la GPL, seg&uacute;n sea necesario para
proteger la libertad de los usuarios.

Por &uacute;ltimo, todo programa est&aacute; constantemente amenazado por las patentes
de software. Los Estados no deber&iacute;an permitir que las patentes restrinjan
el desarrollo y uso de software en ordenadores de uso general, pero en
aquellos que lo hagan, esperamos evitar el especial peligro que suponen
las patentes aplicadas a un programa libre puedan hacerlo propietario.
Para evitar esto, la GPL establece que las patentes no se puede utilizar
para hacer que el programa no libre.

Los t&eacute;rminos y las condiciones exactas para la copia, distribuci&oacute;n y
modificaci&oacute;n.

T&Eacute;RMINOS Y CONDICIONES

0. Definiciones.

"Esta Licencia" se refiere a la versi&oacute;n 3 de la Licencia P&uacute;blica General
GNU.

"Derechos de autor" tambi&eacute;n significa el derecho de autor como las leyes
que se aplican a otros tipos de obras, tales como las m&aacute;scaras de
semiconductores.

"El Programa" se refiere a cualquier trabajo con copyright con licencia
bajo esta Licencia. Cada concesionario se dirige como "usted".
"Licenciatarios" y "destinatarios" pueden ser personas u organizaciones.

Para "modificar" un trabajo significa copiar o adaptar todo o parte de la
obra de un modo que requiera permiso de copyright, que no sea la
realizaci&oacute;n de una copia exacta. El trabajo resultante se denomina
"versi&oacute;n modificada" de un trabajo anterior o trabajo "basado en" el
trabajo anterior.

Un "trabajo amparado" puede ser tanto el Programa no modificado como un
trabajo basado en el Programa.

Para "propagar" un trabajo significa hacer cualquier cosa con &eacute;l, sin
permiso, que le haga directa o indirectamente responsable de infringir
leyes cubiertas por copyright, excepto la ejecuci&oacute;n en un ordenador o la
modificaci&oacute;n de una copia privada. Propagaci&oacute;n incluye la copia,
distribuci&oacute;n (con o sin modificaciones), a disposici&oacute;n del p&uacute;blico y, en
algunos pa&iacute;ses, otras actividades tambi&eacute;n.

Para "transmitir" un trabajo implica cualquier tipo de difusi&oacute;n que
permite a la otra parte hacer o recibir copias. La mera interacci&oacute;n con
un usuario a trav&eacute;s de una red de ordenadores, sin transferir copia
alguna, no se est&aacute; transmitiendo.

Una interfaz de usuario interactiva muestra "Avisos Legales Apropiados"
en la medida en que incluye una herramienta de gran utilidad y destacadas
que (1) muestren un aviso de copyright apropiado, y (2) le dice al usuario
que no existe garant&iacute;a para el trabajo (excepto para la medida en que se
proporcionan garant&iacute;as), que los licenciatarios pueden transmitir el
trabajo bajo esta Licencia, y c&oacute;mo ver una copia de esta Licencia. Si la
interfaz presenta una lista de opciones o comandos, tales como men&uacute;s, un
elemento destacado en dicha lista cumple estos criterios.

1. C&oacute;digo fuente.

El "c&oacute;digo fuente" de un trabajo se entiende la forma preferida del
trabajo cuando se le hacen modificaciones a la misma. "C&oacute;digo objeto" se
entiende cualquier forma no fuente de un trabajo.

Una "Interfaz Est&aacute;ndar" se refiere a una interfaz que sea o bien un
est&aacute;ndar oficial definido por un organismo de normalizaci&oacute;n reconocido,
o, en el caso de interfaces espec&iacute;ficos para un lenguaje de programaci&oacute;n
en particular, uno que es ampliamente utilizado entre los desarrolladores
de trabajo en ese idioma.

Las "Bibliotecas de Sistema" de un trabajo ejecutable incluyen a
cualquier elemento, aparte de la obra en su conjunto, que (a) se incluye
en la forma normal de un componente principal, pero que no forma parte
de ese componente principal, y (b) s&oacute;lo sirve para permitir el uso de la
obra con ese componente principal, o para implementar un Interfaz
Est&aacute;ndar para el cual es una implementaci&oacute;n disponible para el p&uacute;blico
en c&oacute;digo fuente. Un "componente principal", en este contexto, significa
un importante componente esencial (n&uacute;cleo, sistema de ventanas, y as&iacute;
sucesivamente) del sistema operativo espec&iacute;fico (si los hay) en la que
se ejecuta el trabajo ejecutable, o un compilador utilizado para generar
el trabajo, o un int&eacute;rprete del c&oacute;digo objeto utilizado para ejecutarlo.

La "Fuente Correspondiente" de un trabajo en c&oacute;digo objeto se refiere a
todo el c&oacute;digo fuente necesario para generar, instalar, y (en el caso de
trabajos ejecutables) ejecutar el c&oacute;digo objeto y modificar el trabajo,
incluyendo guiones que controlen esas actividades. Sin embargo, no
incluye las bibliotecas de la obra del sistema o herramientas de
prop&oacute;sito general o programas gratuitos disponibles en general que se
utilizan sin modificaciones en la realizaci&oacute;n de estas actividades pero
que no forman parte de la obra. Por ejemplo, la Fuente Correspondiente
incluye los archivos de definici&oacute;n de interfaz asociados con archivos
fuente del trabajo, y el c&oacute;digo fuente de las bibliotecas compartidas o
subprogramas enlazados din&aacute;micamente que el programa est&aacute; dise&ntilde;ado
espec&iacute;ficamente para exigir, como por la comunicaci&oacute;n de datos
intr&iacute;nseca o el control de flujo entre esos subprogramas y otras partes
de la obra.

La Fuente Correspondiente no incluye necesariamente aquello que los
usuarios pueden regenerar autom&aacute;ticamente de otras partes de la Fuente
Correspondiente.

La Fuente Correspondiente de un trabajo en c&oacute;digo fuente es ese mismo
trabajo.

2. Permisos b&aacute;sicos.

Todos los derechos garantizados por esta Licencia se otorgan como
copyright del Programa, y son irrevocables siempre que se cumplan las
condiciones establecidas. Esta Licencia afirma expl&iacute;citamente su permiso
ilimitado para ejecutar el Programa sin modificaciones. El resultado de
la ejecuci&oacute;n de un programa amparado est&aacute; cubierto por esta licencia
s&oacute;lo si la salida, por su contenido, constituya un trabajo amparado. Esta
Licencia reconoce sus derechos de uso razonable u otro equivalente, seg&uacute;n
lo establecido por la ley de derechos de autor.

Usted podr&aacute; realizar, ejecutar y difundir trabajos amparados que no
distribuya, sin condici&oacute;n alguna, siempre y cuando no tenga otra
licencia en vigor. Podr&aacute; distribuir trabajos amparados a terceros con
el mero objetivo de que ellos hagan modificaciones exclusivamente para
usted, o le proporcionan ayuda para ejecutar esos trabajos, siempre que
cumpla con los t&eacute;rminos de esta Licencia distribuyendo todo el material
para el que no se controla los derechos de autor. Aquellos con lo que o
ejecuten los trabajos amparados para usted deben hacerlo exclusivamente
en su nombre, bajo su direcci&oacute;n y control, en los t&eacute;rminos que les
proh&iacute;ban realizar copias de su material con derechos de autor fuera de
su relaci&oacute;n con usted.

La distribuci&oacute;n bajo otras circunstancias se permite &uacute;nicamente bajo las
condiciones que se establecen a continuaci&oacute;n. No est&aacute; permitido
sublicenciar; art&iacute;culo 10 lo hace innecesario.

3. Proteger a los usuarios de Derechos Legales de la Ley contra la elusi&oacute;n.

Ning&uacute;n trabajo amparado debe considerarse parte de una medida tecnol&oacute;gica
efectiva bajo cualquier ley aplicable que cumpla las obligaciones en
virtud del art&iacute;culo 11 del tratado de copyright WIPO adoptado el 20 de
diciembre de 1996, o leyes similares que proh&iacute;ben o restringen la burla
de tales medidas.

Cuando distribuya un trabajo amparado, renuncia a cualquier poder legal
para prohibir la burla de medidas tecnol&oacute;gicas en la medida de tales
burlas se realicen en ejercicio de derechos amparados por esta Licencia
respecto al trabajo amparado, y usted negar&aacute; cualquier intenci&oacute;n de
limitar el uso o modificaci&oacute;n del funciona como un medio de hacer valer,
contra los usuarios de la obra, sus derechos legales o de terceros para
prohibir la burla de medidas tecnol&oacute;gicas.

4. Transmitir copias literales.

Usted podr&aacute; distribuir copias literales del c&oacute;digo fuente del Programa,
seg&uacute;n lo has recibido, en cualquier medio, siempre que la adecuada y
bien visible publique en cada copia un anuncio de copyright, mantenga
intactos todos los avisos que establezcan que esta Licencia y cualquier
t&eacute;rmino no-permisivo a&ntilde;adido en acuerdo con el art&iacute;culo 7 se aplica al
c&oacute;digo, mantenga intactos todos los avisos de la ausencia de garant&iacute;a, y
dar a todos los destinatarios una copia de esta Licencia junto con el
Programa.

Puede cobrar cualquier importe o no para cada copia que distribuya, y
podr&aacute; ofrecer soporte o protecci&oacute;n de garant&iacute;a por una cuota.

5. Transporte versiones modificadas Fuente.

Usted podr&aacute; distribuir un trabajo basado en el Programa, o las
modificaciones que lo producen a partir del Programa, en forma de c&oacute;digo
fuente bajo los t&eacute;rminos de la secci&oacute;n 4, supuesto que adem&aacute;s cumpla las
siguientes condiciones:

    * A) El trabajo debe incluir avisos destacados indicando que usted lo
         ha modificado y dando una fecha pertinente .
    * B) El trabajo debe incluir avisos destacados indicando que es
         liberado bajo esta licencia y cualquier otra condici&oacute;n a&ntilde;adida
         en virtud del art&iacute;culo 7. Este requisito modifica el requisito
         de la secci&oacute;n 4 de "mantener intactos todos los avisos".
    * C) Usted debe obtener la licencia al trabajo completo, como un
         todo, bajo esta licencia a cualquier persona que est&eacute; en
         posesi&oacute;n de una copia. Por tanto, esta Licencia se aplicar&aacute;
         junto con cualquier secci&oacute;n 7 t&eacute;rminos adicionales aplicables
         a la totalidad de la obra, y todas sus partes, con
         independencia de la forma en que se empaquetan. Esta Licencia
         no permite ser aplicada la licencia de la obra de otra manera,
         pero no se anula dicho permiso si usted ha recibido por separado.
    * D) Si el trabajo tiene interfaces de usuario interactivos, cada
         uno debe mostrar Avisos Legales Apropiados, sin embargo, si el
         Programa tiene interfaces interactivos que no muestran Avisos
         Legales Apropiados, su trabajo no tiene por qu&eacute; hacen lo que
         hacen.

Una recopilaci&oacute;n de un trabajo amparado y otros trabajos distintos e
independientes, que no son por su extensi&oacute;n la naturaleza del trabajo
amparado, y que no se combinan con &eacute;l, como para formar un programa m&aacute;s
amplio, en o sobre un volumen de almacenamiento o distribuci&oacute;n medio,
se llama un "agregado" si la recopilaci&oacute;n y su copyright al completo no
son usados para limitar el acceso o los derechos legales de los usuarios
de la compilaci&oacute;n m&aacute;s all&aacute; de lo que permita el trabajo individual. La
inclusi&oacute;n de un trabajo amparado en un paquete no hace aplicable esta
Licencia al resto de elementos del paquete.

6. Distribuci&oacute;n de c&oacute;digo Nom-Source.

Usted podr&aacute; distribuir un trabajo amparado en forma de c&oacute;digo objeto bajo
los t&eacute;rminos de los apartados 4 y 5, siempre que tambi&eacute;n distribuya las
de lectura mec&aacute;nica Fuentes Correspondientes en los t&eacute;rminos de esta
Licencia, de alguna de estas formas:

    * A) Distribuir el c&oacute;digo objeto en, o embebido en, un producto
         f&iacute;sico (incluyendo medios de distribuci&oacute;n f&iacute;sicos), acompa&ntilde;ado
         de las Fuentes Correspondientes en un medio f&iacute;sico duradero
         habitual para el intercambio de software.
    * B) Distribuir el c&oacute;digo objeto en, o embebido en, un producto
         f&iacute;sico (incluyendo medios de distribuci&oacute;n f&iacute;sicos), acompa&ntilde;ado
         de una oferta por escrito, v&aacute;lida durante al menos tres a&ntilde;os y
         v&aacute;lida durante el tiempo que usted ofrezca recambios o soporte
         para ese modelo de producto, para ofrecer al poseedor del c&oacute;digo
         objeto
          (1) una copia de las Fuentes Correspondientes a todo el
              software del producto que est&eacute; cubierto por esta Licencia,
              en un medio f&iacute;sico duradero habitual para el intercambio de
              software, por un precio no mayor que su coste razonable por
              distribuir f&iacute;sicamente las fuentes, o
          (2) acceso para copiar las fuentes correspondientes desde un
              servidor de red sin coste.
    * C) Distribuir copias individuales del c&oacute;digo objeto junto con una
         copia de la oferta por escrito para proporcionar las Fuentes
         Correspondientes. Esta opci&oacute;n se permite s&oacute;lo ocasionalmente y
         no comercial y s&oacute;lo si usted recibi&oacute; el c&oacute;digo objeto junto con
         una oferta, de acuerdo con la subsecci&oacute;n 6b.
    * D) Distribuir el c&oacute;digo objeto ofreciendo acceso desde un lugar
         determinado (gratis o de pago), y ofrecer acceso equivalente a
         las Fuentes Correspondientes de la misma manera por el mismo
         lugar sin cargo adicional alguno. Es necesario no requieren los
         destinatarios que copien las Fuentes Correspondientes junto con
         el c&oacute;digo objeto. Si el lugar para copiar el c&oacute;digo objeto es un
         servidor de red, las Fuentes Correspondientes pueden estar en un
         servidor diferente (gestionado por usted o un tercero) que
         ofrezca facilidades de copia equivalentes, siempre que mantenga
         instrucciones claras junto al c&oacute;digo objeto especificando d&oacute;nde
         encontrar las Fuentes Correspondientes. Independientemente de
         qu&eacute; servidores alberguen las Fuentes Correspondientes, usted
         seguir&aacute; obligado a asegurar que est&eacute; disponible durante el tiempo
         que sea necesario para satisfacer estos requisitos.
    * E) Distribuir el c&oacute;digo mediante la transmisi&oacute;n de igual a igual,
         que ya ha proporcionado informar a otros usuarios d&oacute;nde se
         ofrecen el c&oacute;digo objeto y las Fuentes Correspondientes de la
         obra al p&uacute;blico en general sin costo alguno en la subsecci&oacute;n 6d.

Una parte separable del c&oacute;digo objeto, cuyo c&oacute;digo fuente est&aacute; excluido
de las Fuentes Correspondientes como Biblioteca de Sistema, no necesita
ser incluido en la transmisi&oacute;n del c&oacute;digo objeto del trabajo.

Un "Producto de Usuario" es tanto (1) un "producto de consumo", lo que
significa que cualquier propiedad personal tangible habitualmente
utilizada para fines personales, familiares o dom&eacute;sticos, o (2) cualquier
cosa dise&ntilde;ada o vendida para su incorporaci&oacute;n a una vivienda. Para
determinar si un producto es un producto de consumo, los casos dudosos
se resolver&aacute;n favoreciendo el amparo. Para que un producto concreto
recibido por un usuario en particular, "que se utiliza normalmente" se
refiere a un uso t&iacute;pico o corriente de ese tipo de producto,
independientemente de la situaci&oacute;n del usuario particular o de la forma
en que el usuario concreto utilice, o espera o se espera que el uso, el
producto. Un producto es un producto de consumo independientemente de si
el producto tiene usos comerciales, industriales o distintos del consumo,
a menos que tales usos representen el &uacute;nico modo significativo de uso del
producto.

"Informaci&oacute;n de instalaci&oacute;n" para un producto de usuario significa
cualquier m&eacute;todo, procedimiento, clave de autorizaci&oacute;n, u otra
informaci&oacute;n necesaria para instalar y ejecutar una versi&oacute;n modificada de
un trabajo amparado en ese Producto de Usuario a partir de una versi&oacute;n
modificada de las Fuentes Correspondientes. La informaci&oacute;n debe ser
suficiente para garantizar que el funcionamiento continuo del c&oacute;digo
objeto modificado sin ning&uacute;n tipo de condicionamiento o intromisi&oacute;n por
el simple hecho de haber sido modificado.

Si usted transmite una obra objeto de c&oacute;digo en esta secci&oacute;n, o con, o
espec&iacute;ficamente para su uso en un producto de usuario, y el transporte
se produce como parte de una transacci&oacute;n en la que el derecho de
posesi&oacute;n y uso del Producto de Usuario se transfieren al destinatario
a perpetuidad o por un per&iacute;odo determinado (independientemente de c&oacute;mo
se caracteriza la transacci&oacute;n), las Fuentes Correspondientes distribuidas
bajo estos supuestos debe ir acompa&ntilde;ada de la informaci&oacute;n de instalaci&oacute;n.
Sin embargo, este requisito no se aplica si ni usted ni terceros tienen
posibilidad de instalar el c&oacute;digo objeto modificado en el Producto de
Usuario (por ejemplo, el trabajo se ha instalado en la ROM).

El requerimiento de proporcionar Informaci&oacute;n de Instalaci&oacute;n no incluye el
hecho de continuar proporcionando servicio de soporte, garant&iacute;a, o
actualizaciones para un trabajo que haya sido modificado o instalado por
el destinatario, o para el Producto de Usuario en el que ha sido
modificado o instalado. Acceso a la red puede ser denegado cuando la
propia modificaci&oacute;n afecte materialmente y de forma adversa el
funcionamiento de la red o viole las reglas y protocolos para la
comunicaci&oacute;n a trav&eacute;s de la red.

Fuentes Correspondientes distribuidas, y Instrucciones de Instalaci&oacute;n
proporcionadas de acuerdo con esta secci&oacute;n debe estar en un formato
documentado p&uacute;blicamente (y con una implementaci&oacute;n disponible para el
p&uacute;blico en c&oacute;digo fuente), y no debe requerir claves de acceso especiales
para la descompresi&oacute;n, lectura o copia.

7. Condiciones adicionales.

"Permisos Adicionales" son condicionantes que ampl&iacute;an los t&eacute;rminos de
esta Licencia permitiendo excepciones a una o m&aacute;s de sus condiciones.
Permisos Adicionales que son aplicables al Programa completo deber&aacute;n ser
tratados como si estuviesen incluidos en esta Licencia, en la medida en
que sean v&aacute;lidos seg&uacute;n la ley aplicable. Si los permisos adicionales se
aplicasen s&oacute;lo a una parte del Programa, esa parte se puede usar por
separado bajo los permisos, pero el Programa completo seguir&iacute;a estando
afectado por esta Licencia con independencia de los permisos adicionales.

Cuando distribuya una copia de un trabajo amparado, usted puede
opcionalmente eliminar cualquier permiso adicional de esa copia, o de
alguna parte del mismo. (Los permisos adicionales pueden escribirse
requerida su eliminaci&oacute;n en ciertos supuestos si usted modifica el
trabajo). Usted puede establecer permisos adicionales en material a&ntilde;adido
por usted a un trabajo amparado, sobre el cual tiene o puede dar permisos
de copyright correspondientes.

No obstante cualquier otra disposici&oacute;n de esta licencia, por el material
que a&ntilde;ada a un trabajo amparado, (si est&aacute; autorizado por los titulares
del copyright de ese material) a&ntilde;adir condiciones a esta Licencia con
los t&eacute;rminos:

    * A) Ausencia de garant&iacute;a o limitaci&oacute;n de responsabilidad diferente
         de los t&eacute;rminos de los art&iacute;culos 15 y 16 de esta Licencia, o
    * B) Obligaci&oacute;n de mantener determinados avisos legales razonables
         o atribuciones de autor&iacute;a en el material o en los Avisos
         Legales Correspondientes mostrados por los trabajos que lo
         contengan, o
    * C) Prohibir la tergiversaci&oacute;n del origen del material, o requerir
         que las versiones modificadas del material se marcar&aacute;n de forma
         apropiada en diferentes de la versi&oacute;n original, o
    * D) Limitar el uso con fines publicitarios de los nombres de los
         autores o beneficiarios del material, o
    * E) Negarse a ofrecer derechos afectados por leyes de registro para
         el uso de marcas comerciales, marcas registradas o marcas de
         servicio, o
    * F) Exigir la indemnizaci&oacute;n de los licenciantes y autores de ese
         material por cualquier persona que distribuya el material (o
         versiones modificadas del mismo), estableciendo obligaciones
         contractuales de responsabilidad sobre el destinatario, para
         cualquier responsabilidad que estas obligaciones contractuales
         impongan directamente sobre los licenciantes y autores.

Cualesquiera otras condiciones adicionales no permisivas son consideradas
"otras restricciones" en el sentido del art&iacute;culo 10. Si el Programa tal
como lo recibi&oacute;, o cualquier parte del mismo, contiene un aviso indicando
que est&aacute; amparado por esta Licencia junto con un t&eacute;rmino que es una
restricci&oacute;n adicional, usted podr&aacute; suprimir esa cl&aacute;usula. Si un documento
de licencia contiene una restricci&oacute;n de este tipo pero permite modificar
la licencia o distribuci&oacute;n en virtud de esta Licencia, usted podr&aacute;
a&ntilde;adirla al material de un trabajo amparado por los t&eacute;rminos de ese
documento de licencia, siempre que la restricci&oacute;n no se mantenga tras la
licencia o la distribuci&oacute;n.

Si a&ntilde;ade condiciones para un trabajo amparado, a tenor con esta secci&oacute;n,
deber&aacute; ubicar, en los archivos de origen pertinentes, una declaraci&oacute;n de
los t&eacute;rminos adicionales que se aplican a esos archivos, o un aviso
indicando d&oacute;nde localizar los t&eacute;rminos aplicables.

Los t&eacute;rminos adicionales, permisivas o no permisivas, pueden expresarse
en forma de escrito como licencias separadas, o figurar como excepciones,
los requisitos anteriores siempre son aplicables.

8. Terminaci&oacute;n.

Usted no podr&aacute; distribuir o modificar un trabajo amparado salvo lo
dispuesto expresamente en esta Licencia. Cualquier intento de propagar
o modificaci&oacute;n ser&aacute; considerado nulo, y dar&aacute; por terminados
autom&aacute;ticamente sus derechos bajo esta Licencia (incluyendo las licencias
de patentes concedidas con arreglo al p&aacute;rrafo tercero del art&iacute;culo 11).

Sin embargo, si deja de violaci&oacute;n de esta Licencia, entonces su licencia
desde el poseedor del copyright correspondiente ser&aacute; restituida (a)
provisionalmente, a menos que y hasta que el titular de los derechos de
autor de forma expl&iacute;cita y, finalmente, termina su licencia, y (b)
permanentemente, si el poseedor del copyright no para notificarle de la
violaci&oacute;n por alg&uacute;n cauce antes de 60 d&iacute;as despu&eacute;s de la cesaci&oacute;n.

Adem&aacute;s, su licencia desde el poseedor del copyright correspondiente ser&aacute;
restituida permanentemente si el poseedor del copyright le notifica de la
violaci&oacute;n por alg&uacute;n medio razonable, esta es la primera vez que recibe la
notificaci&oacute;n de violaci&oacute;n de esta Licencia (para cualquier trabajo) de
ese poseedor de copyright, y usted subsana la violaci&oacute;n antes de 30 d&iacute;as
desde la recepci&oacute;n de la notificaci&oacute;n.

La cancelaci&oacute;n de sus derechos seg&uacute;n esta cl&aacute;usula no da por canceladas
las licencias de terceros que hayan recibido copias o derechos de usted
bajo esta Licencia. Si sus derechos han finalizado y no reintegrados de
forma permanente, usted no califica para recibir nuevas licencias para
el mismo material en virtud del art&iacute;culo 10.

9. La aceptaci&oacute;n no se requiere para tener copias.

Usted no est&aacute; obligado a aceptar esta Licencia por recibir o ejecutar una
copia del Programa. La distribuci&oacute;n de un trabajo amparado surgida
simplemente como consecuencia del uso de transmisi&oacute;n de igual a igual
para recibir una copia tampoco requiere aceptaci&oacute;n. Sin embargo, nada m&aacute;s
que esta Licencia le otorga permiso para distribuir o modificar cualquier
trabajo amparado. Estas acciones infringen el copyright si usted no
acepta esta Licencia. Por lo tanto, al modificar o distribuir un trabajo
amparado, usted indica que acepta esta Licencia para poder hacerlo.

10. Herencia autom&aacute;tica de licencia para destinatarios.

Cada vez que distribuya un trabajo amparado, el destinatario recibe
autom&aacute;ticamente una licencia desde los poseedores originales, para
ejecutar, modificar y distribuir ese trabajo, sujeto a esta licencia.
Usted no es responsable de asegurar el cumplimiento por terceros de esta
Licencia.

Una "transacci&oacute;n de entidad" es una transacci&oacute;n que transfiere el control
de una organizaci&oacute;n, o sustancialmente todos los activos de una, o
subdivide una organizaci&oacute;n, o fusiona organizaciones. Si la propagaci&oacute;n
de un trabajo amparado surge de una transacci&oacute;n de entidad, cada parte
en esa transacci&oacute;n que reciba una copia del trabajo, tambi&eacute;n recibe todas
las licencias existentes del trabajo que la parte interesada tuviese o
pudiese ofrecer seg&uacute;n el p&aacute;rrafo anterior, adem&aacute;s de un derecho de
posesi&oacute;n de la Fuente correspondiente de la obra de su predecesor en
el inter&eacute;s, si el predecesor tiene o puede conseguir con un esfuerzo
razonable.

Usted no puede imponer ninguna restricci&oacute;n m&aacute;s sobre el ejercicio de
los derechos otorgados o concedidos en virtud de esta Licencia. Por
ejemplo, usted no puede imponer un canon de licencia, derechos u otros
cargos por el ejercicio de los derechos garantizados por esta Licencia,
y no podr&aacute; iniciar litigios (incluyendo una reconvenci&oacute;n o contrademanda
en un juicio), alegando que todo se infringen patentes al hacer, usar,
vender, ofrecer en venta o importar el Programa, o cualquier parte de ella.

11. Patentes.

Un "colaborador" es un poseedor de copyright que autoriza el uso bajo
esta Licencia del Programa o un trabajo en el que se basa el Programa. El
trabajo con esta licencia se denomina "versi&oacute;n en colaboraci&oacute;n" con el
colaborador.

"Demandas de patente" de un contribuyente son las reivindicaciones de
patentes de propiedad o controlada por el contribuyente, ya sea ya o
adquiridas con posterioridad, que hayan sido infringidas de alguna forma
permitida por esta Licencia, de hacer, usar o vender la versi&oacute;n en
colaboraci&oacute;n, pero sin incluir demandas que s&oacute;lo sean infracciones como
consecuencia de modificaciones posteriores de la versi&oacute;n en colaboraci&oacute;n.
Para efectos de esta definici&oacute;n, "control" incluye el derecho de conceder
sublicencias de patente de forma compatible con los requisitos de esta
Licencia.

Cada colaborador que una licencia de patente no exclusiva, mundial,
libre de regal&iacute;as otorga bajo las reivindicaciones de patente de origen
del colaborador, para hacer, usar, vender, ofrecer en venta, importaci&oacute;n
y ejecutar lo contrario, modificar y distribuir el contenido de la
versi&oacute;n en colaboraci&oacute;n.

En los siguientes tres p&aacute;rrafos, una "licencia de patente" es cualquier
acuerdo expreso o el compromiso, sin embargo denominaci&oacute;n, que no imponga
una patente (como un permiso expreso para ejecutar una patente o acuerdos
para no imponer demandas por infracci&oacute;n de patentes). "Conceder" estas
licencias de patente a un tercero significa llegar a tal acuerdo o
compromiso que no imponga una patente al tercero.

Si usted distribuye un trabajo amparado, conociendo que est&aacute; en una
licencia de patente, y la Fuente Correspondiente de la obra no est&aacute;
disponible para que cualquiera pueda copiar de forma gratuita y bajo los
t&eacute;rminos de esta Licencia, a trav&eacute;s de un servidor de red a disposici&oacute;n
del p&uacute;blico o de otro tipo de f&aacute;cil acceso significa, entonces debe o
bien (1) hacen que el Fuente Correspondiente a ser tan disponible, o (2)
hacer que privarse de los beneficios de la licencia de patente para este
trabajo en particular, o (3) organizar, de manera consistente con la
requisitos de esta Licencia, para extender la licencia de patente a
terceros. "Conocer que est&aacute; afectado" significa que usted tiene
conocimiento efectivo de que, aunque la licencia de patente, la
distribuci&oacute;n del trabajo amparado en un pa&iacute;s, o el uso de su receptor
del trabajo amparado en un pa&iacute;s, infringir&iacute;a una o m&aacute;s patentes
existentes en ese pa&iacute;s que tengan motivos para pensar son v&aacute;lidas.

Si en virtud de o en relaci&oacute;n con una transacci&oacute;n o arreglo, usted
distribuye o distribuye con fines de distribuci&oacute;n, un trabajo amparado,
concediendo una licencia de patente para alg&uacute;n tercero que reciba el
trabajo amparado, y autoriz&aacute;ndole a usar, distribuir, modificar o
distribuir una copia espec&iacute;fica del trabajo amparado, entonces la
licencia de patente que usted otorgue se extiende autom&aacute;ticamente a todos
los receptores del trabajo amparado y cualquier trabajo basado en &eacute;l.

Una licencia de patente es "discriminatoria" si no incluye dentro de su
&aacute;mbito de cobertura, proh&iacute;be el ejercicio de, o est&aacute; condicionada a no
ejercitar uno o m&aacute;s de los derechos que est&aacute;n espec&iacute;ficamente otorgados
por esta Licencia. Usted no puede distribuir un trabajo amparado si usted
es parte de un acuerdo con un tercero que est&aacute; en el negocio de
distribuci&oacute;n de software, bajo el cual se hace el pago de la tercera
parte sobre la base de la extensi&oacute;n de la actividad de distribuci&oacute;n del
trabajo, y en virtud del cual las subvenciones tercera parte, a
cualquiera de las partes que recibir&iacute;an el trabajo amparado, una licencia
de patente discriminatoria

(a) en relaci&oacute;n con las copias del trabajo amparado distribuido por usted
    (o copias hechas a partir de las copias), o
(b) principalmente para y en relaci&oacute;n con productos espec&iacute;ficos o
    compilaciones que la contengan el trabajo amparado, a menos que
    forme parte del acuerdo, o que se concedi&oacute; licencia de patente,
    antes del 28 de marzo de 2007.

Ninguna disposici&oacute;n de la presente Licencia se interpretar&aacute; en el sentido
de excluir o limitar cualquier otra licencia o defensas de las
infracciones que puedan estar a su disposici&oacute;n en virtud del derecho de
patentes aplicable.

12. No condicionamiento de la libertad de terceros.

Si se imponen condiciones sobre usted (ya sea por mandato judicial,
por acuerdo o de otro modo) que contradigan las condiciones de esta
Licencia, ello no le exime de cumplir las condiciones de esta Licencia.
Si usted no puede distribuir un trabajo amparado cumpliendo
simult&aacute;neamente sus obligaciones bajo esta licencia y cualquier otra
obligaci&oacute;n pertinente entonces, como consecuencia, no puede transmitir en
absoluto. Por ejemplo, si usted est&aacute; de acuerdo con los t&eacute;rminos que le
obligan a obtener derechos para transmitir m&aacute;s lejos de aquellos a los
que usted transmite el programa, la &uacute;nica forma de satisfacer ambos
condicionantes y esta Licencia ser&iacute;a abstenerse completamente de
distribuir el Programa.

13. Usar con la GNU Affero General Public License.

No obstante cualquier otra disposici&oacute;n de esta Licencia, usted tiene
permiso para enlazar o combinar cualquier trabajo amparado con otro
trabajo amparado por la versi&oacute;n 3 de la Licencia P&uacute;blica General Affero
GNU y formar un solo trabajo combinado, y para distribuir el trabajo
resultante. Los t&eacute;rminos de esta Licencia seguir&aacute;n siendo aplicables a la
parte formada por el trabajo amparado, pero los condicionantes especiales
de la Licencia P&uacute;blica General Affero GNU, el art&iacute;culo 13, en relaci&oacute;n
con la interacci&oacute;n a trav&eacute;s de una red se aplicar&aacute;n a la combinaci&oacute;n
como tal.

14. Versiones Revisadas de esta Licencia.

La Free Software Foundation puede publicar versiones revisadas y/o nuevas
de la Licencia P&uacute;blica General GNU de vez en cuando. Dichas nuevas
versiones ser&aacute;n similares en esp&iacute;ritu a la presente versi&oacute;n, pero pueden
diferir en detalles para considerar nuevos problemas o situaciones.

Cada versi&oacute;n recibe un n&uacute;mero de versi&oacute;n que la distingue. Si el Programa
especifica que un cierto n&uacute;mero de versi&oacute;n de la Licencia P&uacute;blica General
de GNU "o cualquier versi&oacute;n posterior" se aplica a &eacute;l, usted tiene la
opci&oacute;n de seguir los t&eacute;rminos y condiciones de la versi&oacute;n indicada o de
cualquier versi&oacute;n posterior publicada por la Free Software Fundaci&oacute;n. Si
el Programa no especifica un n&uacute;mero de versi&oacute;n de la Licencia P&uacute;blica
General de GNU, puedes escoger cualquier versi&oacute;n publicada por la Free
Software Foundation.

Si el Programa especifica que un apoderado puede decidir qu&eacute; versiones de
la Licencia P&uacute;blica General de GNU se pueden utilizar, la declaraci&oacute;n
p&uacute;blica de que la representaci&oacute;n de la aceptaci&oacute;n de una versi&oacute;n le
autoriza permanente a elegir esa versi&oacute;n para el Programa.

Las versiones posteriores licencia podr&aacute;n otorgarle permisos adicionales
o diferentes. Sin embargo, no podr&aacute;n imponerse obligaciones adicionales
a cualquier autor o poseedor de copyright como consecuencia de que usted
adopte una versi&oacute;n posterior.

15. Renuncia de garant&iacute;a.

NO HAY GARANT&Iacute;A PARA EL PROGRAMA, EN LA MEDIDA PERMITIDA POR LA LEY
APLICABLE. EXCEPTO CUANDO SE INDIQUE LO CONTRARIO POR ESCRITO, LOS
TITULARES DEL COPYRIGHT Y/U OTRAS PARTES PROPORCIONAN EL PROGRAMA "TAL
CUAL" SIN GARANT&Iacute;A DE NING&Uacute;N TIPO, YA SEA EXPRESA O IMPL&Iacute;CITA,
INCLUYENDO, PERO NO LIMITADO A, LAS GARANT&Iacute;AS DE COMERCIALIZACI&Oacute;N Y
APTITUD PARA UN PROP&Oacute;SITO PARTICULAR. EL RIESGO EN CUANTO A LA CALIDAD Y
DESEMPE&Ntilde;O DEL PROGRAMA ES CON USTED. SI EL PROGRAMA ES DEFECTUOSO, USTED
ASUME EL COSTE DE CUALQUIER SERVICIO, REPARACI&Oacute;N O CORRECCI&Oacute;N.

16. Limitaci&oacute;n de la responsabilidad.

EN NING&Uacute;N CASO, A MENOS QUE LO EXIJA LA LEGISLACI&Oacute;N VIGENTE O SE ACUERDE
POR ESCRITO, NING&Uacute;N TITULAR DE DERECHOS DE AUTOR O CUALQUIER OTRA PARTE
QUE MODIFIQUE Y/O TRANSPORTA EL PROGRAMA COMO SE PERMITE ARRIBA, SER&Aacute;
RESPONSABLE ANTE USTED POR DA&Ntilde;OS, INCLUIDO CUALQUIER DA&Ntilde;O GENERAL,
ESPECIAL, INCIDENTAL O CONSECUENTE DA&Ntilde;OS DERIVADOS DEL USO O
IMPOSIBILIDAD DE USO DEL PROGRAMA (INCLUYENDO PERO NO LIMITADO A LA
P&Eacute;RDIDA DE DATOS O DE DATOS INCORRECTOS, LAS P&Eacute;RDIDAS SUFRIDAS POR USTED
O POR TERCERAS PARTES, O LOS FALLOS DEL PROGRAMA PARA OPERAR CON OTROS
PROGRAMAS), INCLUSO SI DICHO TITULAR U OTRA PARTE HA SIDO ADVERTIDO DE LA
POSIBILIDAD DE TALES DA&Ntilde;OS.

17. Interpretaci&oacute;n de las cl&aacute;usulas 15 y 16.

Si la ausencia de garant&iacute;a y limitaci&oacute;n de responsabilidad descrita
anteriormente no tuviesen efecto legal local en todos sus t&eacute;rminos, los
juzgados aplicar&aacute;n las leyes locales que m&aacute;s se aproxime a la exenci&oacute;n de
toda responsabilidad civil en relaci&oacute;n con el Programa, a menos que una
garant&iacute;a o compromiso de la responsabilidad que acompa&ntilde;a una copia del
programa a cambio de una tarifa.

FIN DE T&Eacute;RMINOS Y CONDICIONES

C&oacute;mo aplicar estos t&eacute;rminos a sus nuevos programas

Si usted desarrolla un nuevo Programa, y quiere que sea del mayor uso
posible para el p&uacute;blico, la mejor forma de conseguirlo es convirti&eacute;ndolo
en software libre que cualquiera pueda redistribuir y cambiar bajo estos
t&eacute;rminos.

Para hacerlo, a&ntilde;ada los siguientes anuncios al programa. Lo m&aacute;s seguro es
a&ntilde;adirlos al principio de cada fichero fuente para hacer m&aacute;s expl&iacute;cita la
ausencia de garant&iacute;a, y cada fichero deber&iacute;a tener al menos la l&iacute;nea de
"copyright" y un indicador a d&oacute;nde puede encontrarse el anuncio completo.

  [una l&iacute;nea para indicar el nombre del programa y una r&aacute;pida idea de qu&eacute;
  hace].
  Copyright (C) [a&ntilde;o] [nombre del autor]
  
  Este programa es software libre: usted puede redistribuirlo y/o
  modificarlo bajo los t&eacute;rminos de la Licencia P&uacute;blica General GNU
  publicada por
  la Fundaci&oacute;n para el Software Libre, ya sea la versi&oacute;n 3 de la
  Licencia, o (a su elecci&oacute;n) cualquier versi&oacute;n posterior.

  Este programa se distribuye con la esperanza de que sea &uacute;til, pero
  SIN NINGUNA GARANT&Iacute;A, incluso sin la garant&iacute;a impl&iacute;cita de
  COMERCIALIZACI&Oacute;N o IDONEIDAD PARA UN PROP&Oacute;SITO PARTICULAR. Vea la
  Licencia P&uacute;blica General de GNU para m&aacute;s detalles.

  Deber&iacute;a haber recibido una copia de la Licencia P&uacute;blica General de GNU
  junto con este programa. Si no es as&iacute;, consulte
  <b>http://www.gnu.org/licenses/</b>.

A&ntilde;ada tambi&eacute;n informaci&oacute;n sobre c&oacute;mo contactar con usted mediante correo
electr&oacute;nico y postal.

Si el programa es interactivo, haga que muestre un peque&ntilde;o anuncio como
el siguiente, cuando comienza a funcionar en modo interactivo:

  [programa] Copyright (C) [a&ntilde;o] [nombre del autor]
  Este programa viene con ABSOLUTAMENTE NINGUNA GARANT&Iacute;A Para m&aacute;s
  detalles escriba 'show w'.
  Este software es libre, y usted es bienvenido a redistribuirlo bajo
  ciertas condiciones; escriba 'show c' para m&aacute;s detalles.

Los comandos hipot&eacute;ticos 'show w' y 'show c' deber&iacute;an mostrar las partes
adecuadas de la Licencia P&uacute;blica General. Por supuesto, los comandos en
su programa podr&iacute;an ser diferentes, para una interfaz gr&aacute;fica de usuario,
se utiliza un "Acerca de".

Tambi&eacute;n deber&iacute;as conseguir que su empleador (si trabaja como programador)
o en la escuela, en su caso, firme una "renuncia de copyright" para el
programa, si es necesario. Para m&aacute;s informaci&oacute;n sobre esto, y c&oacute;mo
aplicar y seguir la GNU GPL, ver <b>http://www.gnu.org/licenses/</b>.

La Licencia P&uacute;blica General GNU no permite que incluya sus programas en
programas propietarios. Si su programa es una biblioteca de subrutinas,
puede considerar m&aacute;s &uacute;til el permitir el enlazado de aplicaciones
propietarias con la biblioteca. Si esto es lo que quiere hacer, use la
Licencia P&uacute;blica General de GNU en lugar de esta Licencia. Pero antes,
por favor, lea <b>http://www.gnu.org/licenses/why-not-lgpl.html</b>.


</pre></body></html>
