<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>R&eacute;daction pour le syst&egrave;me d'aide HTML :</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>R&eacute;daction pour le syst&egrave;me d'aide HTML :</h1>
<pre>
  Les contributions sont plus que bienvenues. Si vous souhaitez faire une
  contribution au syst&egrave;me d'aide HTML, veuillez contacter le mainteneur :
    fritzdotmuelleratmaildotcom
</pre>
<h2>La structure du r&eacute;pertoire \help :</h2>
<pre>
  <b>\help\index.htm</b>
    Liste les langues d'aide install&eacute;es sur le syst&egrave;me.
    Charg&eacute; automatiquement si LANG n'est pas d&eacute;fini en une langue
    disponible et si l'anglais (EN) n'est pas install&eacute;.
  <b>\help\%LANG%\index.htm</b>
    HELP chargera ceci par d&eacute;faut. %LANG% est la langue s&eacute;lectionn&eacute;e
    en d&eacute;finissant la variable d'environnement LANG. Si LANG n'est pas
    d&eacute;fini, EN est suppos&eacute;.
  <b>\help\%LANG%\help.htm</b>
    HELP chargera ceci lorsque l'utilisateur appuie sur F1 ou clique
    sur "Aide sur l'aide".
  <b>\help\docinfo\bi\nls\%LANG%.bi</b>
    Stocke les fichiers de rayons de biblioth&egrave;que, pour &ecirc;tre utilis&eacute;s
    avec l'outil bookshlf d'Aitor afin de cr&eacute;er l'indexe de la langue
    (\help\index.htm).
</pre>
<h2>Cr&eacute;ation de fichiers d'aide compress&eacute;s :</h2>
<pre>
  Pour votre jeu de fichiers compress&eacute;s, vous devriez utiliser un nom
  comme :
    <b>\help\...\[nom]\[nom].zip</b>
  Si vous voulez compresser vos fichiers d'aide, ils devraient &ecirc;tre au
  format zip. Ils devraient avoir le m&ecirc;me nom de fichier que le
  r&eacute;pertoire dans lequel ils sont stock&eacute;s, et l'extension zip.
  Par exemple :
    <b>\help\en\monaide\monaide.zip</b>
  Le fichier index.htm peut &ecirc;tre dans le fichier zip, mais l'aide et
  le bookshlf fonctionneront tous deux mieux s'il ne l'est pas.
  Les structures de r&eacute;pertoire sont autoris&eacute;es dans le fichier zip.
  Cependant le cryptage et certaines des anciennes m&eacute;thodes de
  compression ne sont pas prises en charge.
</pre>
<h2>Cr&eacute;ation des versions modifi&eacute;es des fichiers d'aide :</h2>
<pre>
  Utilisez un titre diff&eacute;rent sur la page de titre (souvent index.htm)
  dans les versions modifi&eacute;es. Le but est d'&eacute;viter les confusions ou
  conflits, et plus important encore, cela est n&eacute;cessaire selon la
  partie 4A de <a href="../other/fdl11.htm">la licence de documentation libre GNU 1.1<a>.
  En plus de changer le titre, veuillez mettre &agrave; jour l'historique,
  la liste des auteurs etc., conform&eacute;ment &agrave; la section 4 de
  <a href="../other/fdl11.htm">la licence de documentation libre GNU 1.1</a>.
  Si le jeu de fichiers a pour but de d&eacute;crire un paquet modifi&eacute; ou
  nouveau, ou si le jeu de fichiers subit des modifications fondamentales
  (par ex. traduction), alors il vaut mieux ajouter un nom de
  sous-dossier diff&eacute;rent comme expliqu&eacute; dans "la structure du dossier
  \help " ci-dessus. Il s'agit de faire une recherche et un remplacement
  du nom de sous-dossier dans index.htm et cela en vaut bien la peine.
  Par exemple, une version simplifi&eacute;e du jeu de fichiers "hhstndrd"
  pourrait &ecirc;tre appel&eacute; "hhmicro". Cela serait le nom du sous-dossier
  et le titre dans index.htm pourrait &ecirc;tre :
    FreeDOS Hilfe (hhmicro 1.0)
  Il est raisonnable de modifier seulement le num&eacute;ro de version (plut&ocirc;t
  que le nom et le dossier "hhmicro") lors des publications de mises
  &agrave; jour.
</pre>
<h2>Cr&eacute;ation ou ajout de nouveaux fichiers :</h2>
<pre>
  Il est conseill&eacute; de mettre le message de licence suivant &agrave; la fin de
  tout nouveau fichier d'aide (sauf s'il sera un fichier seul, non
  inclus dans le jeu de fichiers d'aide) :

    ...
    &lt;hr&gt;
    &lt;address&gt;

    &lt;b&gt;Copyright &amp;copy; 2008
    &lt;a href="mailto:<b>monemail@adresse.com</b>"&gt;<b>Mon nom</b>&lt;/a&gt;&lt;/b&gt;&lt;br&gt;
    Ce fichier fait partie de la documentation d'aide HTML de FreeDOS,
    et est sujet &agrave; ses conditions de licence, cf. :
    &lt;a href="../index.htm"&gt;index.htm&lt;/a&gt;

    &lt;/address&gt;
    &lt;/body&gt;
    &lt;/html&gt;

  Fournir un e-mail est totalement optionnel, si vous mettez vos
  fichiers d'aide sur un site web alors les adresses e-mails pourraient
  &ecirc;tre spamm&eacute;s. La licence est <a href="../other/fdl11.htm">la licence de documentation libre GNU 1.1</a>.
</pre>
<h2>&Eacute;dition d'un fichier stock&eacute; dans un zip :</h2>
<pre>
  Vous pourriez vouloir d&eacute;zipper les fichiers html pour qu'ils soient
  lisibles avec un autre navigateur ou pour les &eacute;diter. Les fichiers
  Zip ont d'habitude la priorit&eacute; sur les fichiers non compress&eacute;s ;
  si vous voulez &ecirc;tre s&ucirc;r que l'aide lira une version &eacute;dit&eacute;e et non
  compress&eacute;e d'un fichier, vous devriez remplacer ou effacer la version
  originale dans ce zip.
</pre>
<h2>Test des fichiers d'aide :</h2>

<pre>
  Les navigateurs de r&eacute;f&eacute;rence pour tester les fichiers d'aide sont :
    * Le visionneur d'aide HTML de FreeDOS (help.exe)
    * Navigateur d&eacute;riv&eacute; de Chromium.
</pre>
<h2>Cr&eacute;ation de tableaux :</h2>
<pre>
  Malheureusement, l'aide ne prend pas en charge les balises table.
  Utilisez les balises de pr&eacute;formatage &lt;pre&gt; &lt;/pre&gt; pour
  les tableaux d'info.
</pre>
<h2>Conseils g&eacute;n&eacute;raux :</h2>
<pre>
  Appuyez sur F5 ou Ctrl+R pour rafra&icirc;chir le fichier affich&eacute; par l'aide.
  Les modifications de l'aide seront visibles imm&eacute;diatement. C'est
  utile lors de l'&eacute;dition des fichiers d'aide dans un environnement
  Windows. Pour l'utilisation du visionneur d'aide HTML afin de
  visualiser des fichiers qui ne sont pas encore int&eacute;gr&eacute;s au jeu de
  fichiers, le commutateur de d&eacute;rogation du chemin d'aide peut &ecirc;tre
  utilis&eacute; :
  help /O[lecteur:][chemin]nomdefichier[.htm]
  ou si relatif au dossier /HELP :
    help /L[sousdossiers]nomdefichier[.htm]
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="tags.htm">Balises prises en charge par l'aide HTML</a>
  <a href="index.htm">Ressources de cr&eacute;ation</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2003-4 Robert Platt, mis &agrave; jour en 2008 par W. Spiegl</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier fait partie de la documentation d'aide HTML de FreeDOS et
  est sujet &agrave; ses conditions de licence : cf. <a href="../../index.htm">index.htm</a>

</pre></body></html>
