<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>FreeDOS Befehl: fileshigh</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Befehl: fileshigh</h1>
<pre>
  FILESHIGH sagt FreeDOS, wieviele Dateien es gleichzeitig ge&ouml;ffnet
  haben kann.
  FILESHIGH ist ein <a href="../cnfigsys/index.htm">CONFIG.SYS</a> / <a href="../cnfigsys/fdconfig.htm">FDCONFIG.SYS</a>-Befehl.
</pre>
<h2>Syntax:</h2>
<pre>
  fileshigh=n
    Wobei die Anzahl der Dateien sich im Bereich 8-255 bewegt.
    Die Standardeinstellung ist 8, aber f&uuml;r die meisten modernen
    Systeme ist 20 - 40 ein guter Wert. Manche Programme brauchen 
    sogar einen noch h&ouml;heren Wert um korrekt zu arbeiten; diese
    Programme sollten in ihrer Dokumentation aber Angaben &uuml;ber
    den ben&ouml;tigten Wert enthalten.
</pre>
<h2>Optionen:</h2>
<pre>
  - keine -
</pre>
<h2>Kommentar:</h2>
<pre>
  FILESHIGH gibt an, wieviele Dateien gleichzeitig ge&ouml;ffnet werden
  d&uuml;rfen (reserviert den erforderlichen Speicher um diese vielen Dateien
  &ouml;ffnen zu k&ouml;nnen). Anmerkung: Es gibt auch noch andere Beschr&auml;n-
  kungen, so da&szlig; es sein kann, da&szlig; ein bestimmtes Programm nicht in
  der Lage ist, diese Menge momentan zu &ouml;ffnen. Eine guter Wert ist 20,
  obwohl manche Programme 30, 40 oder sogar 255 vorschlagen / erfordern.
  Der Befehl FILESHIGH versucht im Gegensatz zu FILES zuerst, 
  in den hohen Speicher zu laden. Wenn das nicht funktioniert, versucht
  er in den konventionellen Speicher zu laden.
  Bitte beachten: Die Art und Weise, wie Sie Ger&auml;tetreiber laden,
  hat eine gro&szlig;e Auswirkung auf die sp&auml;ter frei verf&uuml;gbare 
  Speichermenge (insbesondere konventioneller Speicher). Versuchen
  Sie deshalb, (im Speicherverbrauch) gro&szlig;e Programme (insbesondere
  Treiber) zuerst in den hohen Speicherbereich zu laden.
  Wichtig: Sie m&uuml;ssen zuvor einen Manager f&uuml;r den hohen Speicherbereich
  wie z.B. (<a href="../base/himem.htm">HIMEM</a>) oder <a href="../base/himemx.htm">HIMEMX</a> oder <a href="../base/jemmex.htm">JEMMEX</a> geladen haben, um diesen Befehl
  ausf&uuml;hren zu k&ouml;nnen. (d.h. in der <a href="../cnfigsys/index.htm">CONFIG.SYS</a> / <a href="../cnfigsys/fdconfig.htm">FDCONFIG.SYS</a> zuerst
  device=himem.exe oder device=himemx.exe oder &auml;hnliches gesetzt haben).
  FILESHIGH ist ein interner Befehl, d.h. der Befehl ist in der 
  kernel.sys enthalten. Es wird zur Ausf&uuml;hrung des Befehls kein 
  zus&auml;tzlicher Befehl (Datei) ben&ouml;tigt.
</pre>
<h2>Beispiel:</h2>
<pre>
  IN DER CONFIG.SYS / FDCONFIG.SYS:
    fileshigh=20
</pre>
<h2>Siehe auch:</h2>
<pre>
  <a href="../cnfigsys/index.htm">config.sys</a>
  <a href="../cnfigsys/fcbs.htm">fcbs</a>
  <a href="../cnfigsys/fdconfig.htm">fdconfig.sys</a>
 (<a href="../base/fdxms.htm">fdxms</a>)
 (<a href="../base/fdxms286.htm">fdxms286</a>)
  <a href="../cnfigsys/files.htm">files</a>
 (<a href="../base/himem.htm">himem</a>)
  <a href="../base/himemx.htm">himemx</a>
  <a href="../base/jemmex.htm">jemmex</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2003 Robert Platt, aktualisiert 2011 von W. Spiegl.</b>

  Diese Datei ist abgeleitet vom FreeDOS Spezifikationen-HOWTO.
  Vgl. auch die Datei <a href="../other/h2cpying.htm">H2Cpying</a> bez&uuml;glich der Kopierbedingungen.

</pre></body></html>