# This is the translation file model for FreeDOS Password v0.50
#
#               Language: Greek, el
#               Codepage: 737
#
# Author of the translation: Stefanos Stefanidis
#
# All spaces before text must be preserved and each line must not contain
# any space character at its end!
#
0.1:ХиуйлЬк
0.2:ПитзЬа дШ жихйЬлЬ лжмвсоайлжд тдШд оиуйлЮ:
0.3:юджгШ оиуйлЮ.....:
0.4:ЙрЫабцк зицйЩШйЮк..:
0.5:О оиуйлЮк
0.6:зижйЯтЯЮбЬ
0.7: ПРОДИГОПОИЖСЖ! ыдШк сЪдрйлжк зижйзсЯЮйЬ дШ ймдЫЬЯЬх лЮд зижЮЪжчгЬдЮ нжис.
0.8:          ВаШ зЬиаййцлЬиЬк звЮижнжихЬк, ЫЬхлЬ лж ШиоЬхж бШлШЪиШнщд (log).
0.9: ПатйлЬ тдШ звуближ...
0.10:ГЬд ЬзалитзЬлШа Ю зицйЩШйЮ!
0.11:ДайсЪЬлЬ лж цджгШ лжм оиуйлЮ зжм ЬзаЯмгЬхлЬ дШ ЫаШЪиспЬлЬ:
0.12: О оиуйлЮк ЫаШЪиснлЮбЬ.
0.13:ЫЬд ЩитЯЮбЬ!
0.14:ДайсЪЬлЬ лж цджгШ оиуйлЮ зжм ЯтвЬлЬ дШ зижйЯтйЬлЬ:
0.15:О оиуйлЮк зижйЯтЯЮбЬ
0.16: Тж цджгШ оиуйлЮ
0.17:оиЮйагжзжаЬхлШа уЫЮ.
0.18: ПШисгЬлижа:
0.19: /adduser   ПижйЯтйлЬ тдШд дтж оиуйлЮ йлж зицЪиШггШ
0.20: /login     СчдЫЬйЮ
0.21: /remuser   АнШаитйлЬ тдШд оиуйлЮ Шзц лж зицЪиШггШ
0.22:ймдЫтЯЮбЬ гЬ ЬзалмохШ
0.23:зижйзсЯЮйЬ дШ ймдЫЬЯЬх
0.24:ШнШаитЯЮбЬ
