<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Mise en r&eacute;seau de FreeDOS - Chargement du kernel TCP/IP (pile)</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1><a name="top"></a>Mise en r&eacute;seau de FreeDOS - Chargement du kernel TCP/IP (pile)</h1>
<h2><a name="zzz"></a>Vue d'ensemble</h2>
<pre>
  Les syst&egrave;mes d'exploitations modernes ont leur propre kernel <a href="../network/tcpip.htm">TCP/IP</a>
  d&eacute;j&agrave; int&eacute;gr&eacute;s : les syst&egrave;mes Microsoft sont fournis avec "Winsock"
  depuis Windows 95. Dans GNU/Linux la pile TCP/IP fait partie du noyau
  Linux. Cependant DOS est fourni sans kernel. Donc apr&egrave;s avoir install&eacute;
  notre pilote de paquets, nous devons penser au kernel TCP/IP.
</pre>
<h2><a name="aaa"></a>Comment cela fonctionne</h2>
<pre>
  Le kernel TCP/IP est aussi appel&eacute; "pile" ou "pile de protocoles", car
  il consiste en deux couches : IP et TCP. IP s'ex&eacute;cute au-dessus du
  pilote du mat&eacute;riel et TCP au-dessus d'IP, fournissant une interface
  aux applications <a href="../network/network.htm">r&eacute;seau</a>. Pour DOS divers types de kernel TCP/IP sont
  disponibles.
    (image repr&eacute;sentant le kernel TCP/IP)
  Comme nous le voyons sur l'image ci-dessus, ils peuvent fonctionner
  en tant que programmes externes ou bien ils sont d&eacute;j&agrave; int&eacute;gr&eacute;s aux
  applications.
    * Un kernel TCP/IP externe est typiquement d&eacute;marr&eacute; par <a href="../batch/autoexec.htm">AUTOEXEC.BAT</a>
      ou par un fichier batch. Il reste r&eacute;sident en m&eacute;moire, pour
      pouvoir r&eacute;pondre aux requ&ecirc;tes ping par exemple.
    * D'autres applications <a href="../network/network.htm">r&eacute;seau</a> sont fournies avec les fonctionnalit&eacute;s
      de kernel TCP/IP d&eacute;j&agrave; int&eacute;gr&eacute;es et ne n&eacute;cessite pas un kernel
      externe TSR.
      Une application avec un kernel TCP int&eacute;gr&eacute; a l'avantage de ne pas
      avoir besoin d'un autre pilote qui consommerait de la m&eacute;moire DOS
      pr&eacute;cieuse. D'un autre c&ocirc;t&eacute;, les fonctionnalit&eacute;s <a href="../network/tcpip.htm">TCP/IP</a> sont
      limit&eacute;es &agrave; celles de l'application <a href="../network/network.htm">r&eacute;seau</a> et ne sont fournies que
      pendant son fonctionnement.
</pre>
<h2><a name="bbb"></a>Configuration n&eacute;cessaire</h2>
<pre>
  Chaque kernel TCP/IP doit &ecirc;tre configur&eacute; avec des informations
  g&eacute;n&eacute;rales sur le <a href="../network/network.htm">r&eacute;seau</a>, comme les adresses IP, le masque de
  sous-r&eacute;seau, les serveurs de noms et la passerelle, ou bien il faut
  lui dire d'obtenir ces informations via un serveur BOOTP ou DHCP.
</pre>
<h2><a name="ccc"></a>Exemples</h2>
<pre>
  Les exemples de kernels TCP/IP externes pour DOS sont
    * le kernel TCP gratuit Trumpet <a href="../network/ntcpdrv.htm">NTCPDRV</a>.EXE,
    * le kernel TCP/IP de <a href="../network/novell.htm">Novell</a> NetWare TCPIP.EXE,
    * TCPTSR.EXE de Microsoft <a href="../network/msclient.htm">client MS</a> et
    * ETHDRV.EXE de FTP Software Inc.
  Les exemples pour les kernels TCP/IP int&eacute;gr&eacute;s aux applications
  DOS sont :
    * <a href="../network/wattcp.htm">WatTCP</a>, qui est par exemple
      d&eacute;j&agrave; int&eacute;gr&eacute; au navigateur web graphique
      "<a href="../network/tcpip_ap.htm#ccc">Arachne</a>",
    * le kernel <a href="../network/mtcp.htm">mTCP</a>, &eacute;crit en 2009,
    * le kernel <a href="../network/history.htm#bbf">KA9Q</a> qui fait partie de ce programme,
    * le kernel NCSA <a href="../network/history.htm#bbg">Telnet</a> qui est int&eacute;gr&eacute; aux applications incluses
      dans cette suite,
    * le kernel <a href="../network/history.htm#bbh">CUTCP</a> et
    * la pile de l'Universit&eacute; de Minnesota, qui fait partie de "<a href="../network/history.htm#bbi">MINUET</a>".
  <b>Plus de la moiti&eacute; des applications DOS r&eacute;seau disponibles utilisent
  le kernel <a href="../network/wattcp.htm">WatTCP</a></b> d'apr&egrave;s Jeffrey L. Hayes du site d'ordinosaures
  <b>http://www.oldskool.org (*01)</b> (voyez : <b>ftp://ftp.oldskool.org/pub/
  tvdog/internet/readme.txt (*02)</b>).
  Donc la plupart d'entre nous n'auront pas du tout &agrave; installer un noyau
  TCP/IP. Au lieu de cela, nous devons seulement faire attention au
  fichier de configuration WATTCP.CFG pour ces applications de r&eacute;seau.
  Le chapitre suivant examine de plus pr&egrave;s <a href="../network/wattcp.htm">WatTCP</a> et son successeur
  <a href="../network/wattcp.htm">Watt-32</a>. Puis nous examinerons <a href="../network/ntcpdrv.htm">NTCPDRV</a> qui est le seul kernel
  externe libre de disponible. Par la suite nous examinerons bri&egrave;vement
  d'autres kernels TCP/IP.
    * [<a href="../network/wattcp.htm">WatTCP/Watt-32</a>]
    * [<a href="../network/ntcpdrv.htm">TCPDRV</a>]/[<a href="ntcpdrv.htm">NTCPDRV</a>]
    * [<a href="../network/mtcp.htm">mTCP</a>]
    * [<a href="../network/ot_tcpip.htm">Autres</a>]

  <b>(*01) OK</b>
  <b>(*02) OK</b>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2007 Ulrich Hansen, Mainz (Allemagne), modifi&eacute; en 2010
  par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Pour plus d'informations, <a href="../network/intro.htm#ddd">voyez ici</a>.

  La permission est accord&eacute;e de copier, distribuer et/ou modifier ce
  document selon les termes de la licence de documentation libre GNU,
  version 1.2 ou toute version ult&eacute;rieure publi&eacute;e par la Free Software
  Foundation.
  Une copie de la licence est incluse dans la section intitul&eacute;e
  <a href="../other/fdl12.htm">"GNU Free Documentation License 1.2"</a>.

</pre></body></html>
