<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Mise en r&eacute;seau de FreeDOS - Les Modems</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1><a name="top"></a>Mise en r&eacute;seau de FreeDOS - Les Modems</h1>
<pre>
  Le Modem (de modulateur-d&eacute;modulateur) est un appareil qui module un
  signal de porteuse analogique pour coder des informations num&eacute;riques,
  et qui d&eacute;module une tel signal de porteuse pour d&eacute;coder les
  informations transmises.
  Le but est de produire un signal qui peut &ecirc;tre transmis facilement
  et d&eacute;cod&eacute; pour reproduire les donn&eacute;es num&eacute;riques originelles. Les
  modems peuvent &ecirc;tre utilis&eacute;s sur tout moyen de transmission de signaux
  analogiques, des diodes &agrave; la radio. Il existe fondamentalement trois
  types diff&eacute;rents de modem disponibles pour &ecirc;tre utilis&eacute;s avec les PC
  de bureau. Les modems externes qui se branchent sur le port s&eacute;rie de
  votre PC. Et des modems internes qui sont install&eacute;s sur un emplacement
  PCI ou ISA. Ces derniers peuvent &ecirc;tre sous divis&eacute;s entre les WinModems
  et les modems complets. Seuls les derniers fonctionneront sous DOS
  (voyez le probl&egrave;me similaire avec GNU/Linux !). Il est n&eacute;cessaire
  d'utiliser un pilote SLIP ou plus souvent un pilote PPP, qui agit
  en tant que pilote de paquets <a href="../network/ethernet.htm">Ethernet</a> si vous voulez vous connecter &agrave;
  un <a href="../network/network.htm">r&eacute;seau</a> distant via une ligne t&eacute;l&eacute;phonique. La pile  <a href="../network/tcpip.htm">TCP/IP</a> est alors
  charg&eacute;e par la suite. Les piles <a href="../network/tcpip.htm">TCP/IP</a> &agrave; la fois de <a href="../network/novell.htm">Novell</a> et de
  Microsoft int&eacute;graient un programme de num&eacute;rotation et des pilotes
  SLIP/PPP avec le logiciel principal.
  Avec l'arriv&eacute;e du haut d&eacute;bit, les modems c&acirc;ble et ADSL sont &eacute;galement
  apparus, ceux-ci font soit semblant d'&ecirc;tre des appareils <a href="../network/ethernet.htm">Ethernet</a>,
  soit ne fonctionneront pas sous DOS. </pre>
<hr>
<pre>
  <b>Copyright &copy; 2007 Ulrich Hansen, Mainz (Allemagne), modifi&eacute; en 2010
  par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Pour plus d'informations, <a href="../network/intro.htm#ddd">voyez ici</a>.

  La permission est accord&eacute;e de copier, distribuer et/ou modifier ce
  document selon les termes de la licence de documentation libre GNU,
  version 1.2 ou toute version ult&eacute;rieure publi&eacute;e par la Free Software
  Foundation.
  Une copie de la licence est incluse dans la section intitul&eacute;e
  <a href="../other/fdl12.htm">"GNU Free Documentation License 1.2"</a>.

</pre></body></html>
