<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>H2cpying</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>H2cpying:</h1>
<pre>
Anmerkung:
  Dies ist nur der Versuch einer &Uuml;bersetzung; bitte lesen Sie im 
  Zweifelsfall das englische Original! Nur das englischsprachige
  Original ist im Zweifelsfall g&uuml;ltig!

Copyright &copy; 1998 Jim Hall
Jedermann darf wortgetreue Kopien dieses Lizenzdokuments kopieren und
vertreiben, aber eine Ver&auml;nderung ist verboten.

Wenn nicht anders angegeben, stehen die FreeDOS-DOC HOWTO Dokumente
unter dem Urheberrecht Ihrer jeweiligen Autoren. Die FreeDOS-DOC HOWTO
Dokumente k&ouml;nnen im Ganzen oder in Teilen auf jedem physikalischen oder 
elektronischen Medium vertrieben werden, solange diese Copyright-Notiz
auf allen Kopien erhalten bleibt. Kommerzieller Vertrieb ist erlaubt und
erw&uuml;nscht; jedoch sollte der Autor &uuml;ber solche Distributionen
informiert werden.

Alle &Uuml;bersetzungen, abgeleitete Arbeiten oder zusammengef&uuml;gte Arbeiten,
die irgendwelche FreeDOS-DOC HOWTO Dokumente sich einverleiben, m&uuml;ssen
diesen Urheberrechtsvermerk enthalten. Das bedeutet, da&szlig; Sie nicht ein
abgeleitetes Werk von einem HOWTO erzeugen und zus&auml;tzliche 
Beschr&auml;nkungen auf dessen Verteilung auferlegen d&uuml;rfen. Ausnahmen
k&ouml;nnen unter bestimmten Umst&auml;nden gew&auml;hrt werden; bitte kontaktieren
Sie ggfs. den FreeDOS-DOC HOWTO Koordinator unter der unten angef&uuml;hrten
Adresse.

Kurz zusammengefasst, wir wollen die Verbreitung dieser Information durch
so viele Kan&auml;le wie m&ouml;glich f&ouml;rdern. Jedoch m&ouml;chten wir das 
Urheberrecht auf die HOWTO Dokumente behalten und m&ouml;chten &uuml;ber alle
Pl&auml;ne, die HOWTOs weiterzuverbreiten informiert werden.

Wenn Sie irgendwelche Fragen haben sollten, kontaktieren Sie bitte den
FreeDOS Koordinator unter jhall@freedos.org.

</pre></body></html>