<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Redes de FreeDOS - Instalaci&oacute;n de Paquetes de Controladores</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1><a name="top"></a>Redes de FreeDOS - Instalaci&oacute;n de Paquetes de Controladores</h1>
<h2><a name="zzz"></a>Resumen</h2>
<pre>
    (Imagen de Paquetes de Controladores)
  Los controladores de paquetes funcionan como una interfaz entre el
  hardware (la tarjeta de interfaz de <a href="../network/network.htm">red</a>) y el <a href="../network/ldtcpipk.htm">n&uacute;cleo TCP/IP</a> (que
  tambi&eacute;n se llama "pila de protocolos"). Un tipo de  <a href="../network/ldtcpipk.htm">N&uacute;cleos TCP/IP</a>
  funciona como un programa externo que se puede llamar y utilizada por
  varias aplicaciones de <a href="../network/network.htm">red</a>. Otro n&uacute;cleo <a href="../network/ldtcpipk.htm">TCP/IP</a> ya est&aacute;n integrados en
  aplicaciones de <a href="../network/network.htm">red</a>, un navegador web, por ejemplo, o un cliente
  de FTP.
  Vamos a aprender m&aacute;s acerca de estos <a href="../network/ldtcpipk.htm">n&uacute;cleos</a> un poco m&aacute;s en este wiki.
  La mayor&iacute;a de nosotros va a utilizar el controlador de paquetes para
  redes <a href="../network/tcpip.htm">TCP/IP</a>. Y eso es todo. Pero los controladores de paquetes son
  controladores multiprotocolo - as&iacute; <a href="../network/tcpip.htm">TCP/IP</a> no es el &uacute;nico n&uacute;cleo que
  puede trabajar en lo alto de la misma. Como se puede ver en la figura
  anterior (en los campos de color gris oscuro), tambi&eacute;n es posible
  ejecutar <a href="../network/novell.htm">Novell</a> NetWare m&aacute;s de un controlador de paquetes:
  controladores especializados como IPXPD.COM o PDIPX.COM  apoya IPX a
  lo largo de la interfaz del controlador de paquetes. El protocolo
  <a href="../network/cifs.htm">NetBEUI</a> no se puede utilizar en la parte superior de un controlador
  de paquetes, aunque, como la interfaz del controlador paquete es
  demasiado diferente de <a href="../network/ndis.htm">NDIS</a>.
</pre>
<h2><a name="aaa"></a>D&oacute;nde encontrarlos</h2>
<pre>
  El primer lugar para buscar un controlador de paquetes debe estar en
  el medio de instalaci&oacute;n que viene con su tarjeta. Los controladores de
  paquetes suelen tener las letras "PD" en sus nombres, por lo que el
  controlador de paquetes de un <a href="../network/3com.htm">3Com</a> 3C589 PC-Card se llama "3C589PD.COM"
  y el controlador de la D-Link DFE-670TXD PC-Card se llama "DFE670PD.
  COM". Busque un directorio "PKTDRV" en el CD o disquete que viene con
  su tarjeta.
  Si no existe tal controlador en el medio de instalaci&oacute;n o usted no
  tiene ninguno, intente buscar en la web. Para tarjetas de <a href="../network/network.htm">red</a> ISA y
  PCI existe la posibilidad de un controlador de paquetes se puede
  encontrar en la p&aacute;gina web de Russell Nelson <a href="../network/crynwr.htm">Crynwr</a> (ver: <b>http://www.
  crynwr.com/project (*01)</b>) un recurso de controladores de paquetes de
  dominio p&uacute;blico. Controladores PCMCIA parecen ser raras ah&iacute;, sin
  embargo. Georg Potthast ofrece una colecci&oacute;n de controladores de
  paquetes de tarjetas PCI (ver: <b>http://www.georgpotthast.de/sioux/
  packet.htm (*02)</b>) y una herramienta llamada NICSCAN.EXE (ver:
  <b>http://www.georgpotthast.de/sioux/pktdrv/nicscan.zip (*03)</b>)
  para determinar el conjunto de chips de tarjetas de <a href="../network/network.htm">red</a> PCI. &Eacute;l hizo la
  experiencia que el paquete controladores suelen ser los mismos para un
  gran n&uacute;mero de modelos por el mismo fabricante, por lo que recomienda
  que no se trate de encontrar un determinado controlador de paquetes
  para su n&uacute;mero de modelo.
</pre>
<h2><a name="bbb"></a>Instalaci&oacute;n de un paquete de controladores</h2>
<pre>
  Para <a href="../network/install.htm">instalar</a> un controlador de paquetes, a&ntilde;adir una l&iacute;nea como esta
  en tu <a href="../batch/autoexec.htm">AUTOEXEC.BAT</a> (ejemplo para la tarjeta PCMCIA 3c589):
    LH 3C589PD.COM 0x60 5 0x300
  En el ejemplo anterior, el controlador se carga en memoria alta
  mediante el comando "LH". La primera opci&oacute;n ("0x60") establece la
  interrupci&oacute;n de software (vector) utilizado por el controlador. El
  n&uacute;mero de interrupciones de software de paquete de controladores
  m&aacute;s utilizado es 0x60. La segunda opci&oacute;n ("5") establece el IRQ, la
  tercera opci&oacute;n ("0x300") establece el puerto de E/S. Algunos
  controladores s&oacute;lo necesitan el vector y encuentran los otros valores
  por s&iacute; mismos. La mayor&iacute;a de los controladores de paquetes se pueden
  descargar despu&eacute;s de su uso con la opci&oacute;n "-u".
</pre>
<h2><a name="ccc"></a>Reinicio</h2>
<pre>
  Eso es todo. No es necesario ning&uacute;n otro controlador (<a href="../network/odi.htm">ODI</a> o <a href="../network/ndis.htm">NDIS</a>).
  Despu&eacute;s de instalar correctamente un de paquete de controladores,
  ahora se puede instalar sus aplicaciones <a href="../network/tcpip.htm">TCP/IP</a> con un n&uacute;cleo
  interno (<a href="../network/wattcp.htm">WatTCP</a>) o instalar un <a href="../network/ldtcpipk.htm">n&uacute;cleo TCP/IP</a> externo (<a href="../network/ntcpdrv.htm">NTCPDRV</a>).
    (Imagen: Mensaje de Arranque de paquete de controladores )

  <b>(*01) ?</b>
  <b>(*02) OK</b>
  <b>(*03) OK</b>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2007 Ulrich Hansen, Mainz (Alemania), modificado en 2010
  por W.Spiegl. Actualizado en 2013 por Lorenzo del Toro Saravia.</b>
  Para m&aacute;s informaci&oacute;n <a href="../network/intro.htm#ddd">consulte aqu&iacute;</a>.

  Se concede permiso para copiar, distribuir y/o modificar este documento
  en los t&eacute;rminos de la Licencia de Documentaci&oacute;n Libre GNU, Versi&oacute;n 1.2
  o cualquier versi&oacute;n posterior publicada por la Free Software
  Foundation.
  Una copia de la licencia est&aacute; incluida en la secci&oacute;n titulada
  <a href="../other/fdl12.htm">"GNU Free Documentation License 1.2"</a>.

</pre></body></html>
