<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : command (command.com ou FreeCom)</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : command (command.com ou FreeCom)</h1>
<pre>
  COMMAND d&eacute;marre une nouvelle copie du shell de commandes de FreeDOS.
</pre>
<h2>Syntaxe :</h2>
<pre>
  COMMAND [[lecteur]chemin] [p&eacute;riph&eacute;rique] [/E:nnnnn] [/L:nnnn] [/U:nnn]
          [/P] [/MSG] [/LOW] [/Y [/[C|K] commande]]
  COMMAND [/?]
          [lecteur]chemin  Sp&eacute;cifie le dossier contenant COMMAND.COM,
                       par exemple C:\exemple\
          lecteur      La lettre du lecteur, par exemple C:
          chemin       Le r&eacute;pertoire, par exemple \exemple\
          p&eacute;riph&eacute;rique Sp&eacute;cifie le p&eacute;riph&eacute;rique &agrave; utiliser pour l'entr&eacute;e
                       et la sortie des commandes.
</pre>
<h2>Options :</h2>
<pre>
  /E:nnnnn    R&egrave;gle la taille initiale de l'environnement sur nnnnn
              octets. (nnnnn devrait &ecirc;tre entre 256 et 32,768).
  /L:nnnn     Sp&eacute;cifie la taille des tampons internes (n&eacute;cessite
              &eacute;galement /P). (nnnn devrait &ecirc;tre entre 128 et 1,024).
  /U:nnn      Sp&eacute;cifie la taille du tampon d'entr&eacute;e (n&eacute;cessite
              &eacute;galement /P). (nnn devrait &ecirc;tre entre 128 et 255).
  /P          Rend le nouveau shell de commandes permanent (impossible
              de quitter).
  /MSG        Stocke tous les messages d'erreur en m&eacute;moire (n&eacute;cessite
              &eacute;galement /P).
  /LOW        Force le shell de commandes &agrave; garder ses donn&eacute;es
              r&eacute;sidentes dans la m&eacute;moire basse.
  /Y          Parcourt le programme batch sp&eacute;cifi&eacute; par /C o
  /C commande Ex&eacute;cute la commande sp&eacute;cifi&eacute;e et retourne
  /K commande Ex&eacute;cute la commande sp&eacute;cifi&eacute;e et continue
  /?          Affiche l'aide
</pre>
<h2>Commentaires :</h2>
<pre>
  [lecteur]chemin  Le lecteur et le chemin o&ugrave; le shell doit rechercher
               la partie transitoire tu du programme. C'est g&eacute;n&eacute;ralement
               n&eacute;cessaire seulement pour d&eacute;finir le COMSPEC.
  p&eacute;riph&eacute;rique P&eacute;riph&eacute;rique alternatif pour toutes les e/s.
  /e:nnnnn     La taille de l'environnement, en octets, dans la plage
               160-32768.
               Ce nombre sera arrondi aux 16 octets les plus proches.
               La valeur par d&eacute;faut est 256.
  /p           Rend le shell permanent, donc la commande EXIT ne quitte
               pas le shell.
  /c {cha&icirc;ne}  Ex&eacute;cute la commande dans {cha&icirc;ne}, puis quitte.
  /msg         Charge dans la m&eacute;moire tout message d'erreur qui pourrait
               &ecirc;tre stock&eacute; sur le disque.
  Command (command.com) est aussi appel&eacute; FreeCom. Il contient de
  nombreuses commandes internes qui ne n&eacute;cessite aucun autre fichier
  pour fonctionner.
  Vous pouvez retrouver la liste des commandes internes <a href="../../index.htm#command">ici</a>.
</pre>
<h2>Exemples :</h2>
<pre>
  C:\command /E:1024 /L:1024 /U:128 /P
  command /?
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../command/exit.htm">exit</a>
  <a href="../base/kernel.htm">kernel</a>
  <a href="../cnfigsys/shell.htm">shell</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 1998 Jim Hall, mis &agrave; jour en 2008 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
