<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : if</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : if</h1>
<pre>
  IF effectue des traitements conditionnels dans les programmes batch.
  IF est une commande de <a href="../batch/index.htm">FICHIER BATCH</a> / <a href="../batch/autoexec.htm">AUTOEXEC.BAT</a>.
  Elle peut &eacute;galement &ecirc;tre utilis&eacute;e sur la ligne de commande.
</pre>
<h2>Syntaxe :</h2>
<pre>
  IF [NOT] NIVEAUERREUR nombre commande
  IF [NOT] cha&icirc;ne1==cha&icirc;ne2 commande
  IF [NOT] EXIST nomfichier commande
     lecteur   La lettre du lecteur, par exemple C:
     chemin    Le r&eacute;pertoire, par exemple \exemple\
     nomfichier Le fichier, par exemple test.txt
</pre>
<h2>Options :</h2>
<pre>
  NOT               Sp&eacute;cifie que le shell de commande doit ex&eacute;cuter
                    la commande uniquement si la condition est fausse.
                    (Sans cela, la commande sera ex&eacute;cut&eacute;e si la
                    condition est vraie.)
  NIVEAUERREUR nombre Sp&eacute;cifie une condition vraie si la derni&egrave;re
                    ex&eacute;cution du programme a retourn&eacute; un code de sortie
                    &eacute;gal ou sup&eacute;rieur au num&eacute;ro sp&eacute;cifi&eacute;.
  commande          Sp&eacute;cifie la commande &agrave; ex&eacute;cuter si la condition
                    est remplie.
  cha&icirc;ne1==cha&icirc;ne2  Sp&eacute;cifie une condition vraie si les cha&icirc;nes de texte
                    sp&eacute;cifi&eacute;s correspondent.
  EXIST nomfichier  Sp&eacute;cifie une condition vraie si le nom de fichier
                    sp&eacute;cifi&eacute; existe.
</pre>
<h2><a name="comment"></a>Commentaires :</h2>
<pre>
  <I>NIVEAUERREUR</I>  nombre:   Les programmes DOS retournent un nombre quand
                       ils quittent, et ce nombre contient parfois des
                       informations permettant de savoir si le programme
                       a r&eacute;ussi. Si le dernier programme &agrave; quitter a
                       retourn&eacute; le nombre donn&eacute;, alors la condition
                       est vraie.
  cha&icirc;ne1==cha&icirc;ne2     Si les deux cha&icirc;nes de caract&egrave;res sont &eacute;gales,
                       alors la condition est vraie.
  exist [lecteur][chemin]  Si le fichier donn&eacute; est l&agrave;, alors la condition
        nomfichier          est vraie.

  IF est une commande interne &agrave; command.com est n'a besoin d'aucun autre
  fichier pour fonctionner.
</pre>
<h2>Exemples :</h2>
<pre>
  DANS UN FICHIER .BAT / AUTOEXEC.BAT:
    if exist c:\kernel.sys ECHO Le kernel (noyau) existe
                  (affiche un message si le kernel existe)
    set A=freedos
    set B=freedos
    set C=autredos
    if %A%==%B% ECHO A et B sont la m&ecirc;me cha&icirc;ne
                  (A et B sont "freedos", donc le message appara&icirc;tra)
    if %A%==%C% ECHO A et C sont la m&ecirc;me cha&icirc;ne
                  (A est "freedos", C est "autredos", donc aucun message
                   n'appara&icirc;tra)
    if not %A%==%C% ECHO A et C ne sont pas la m&ecirc;me cha&icirc;ne
                  (A est "freedos", C est "autredos", comme ils ne sont
                   PAS identiques, le message appara&icirc;tra)
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../batch/autoexec.htm">autoexec.bat</a>
  <a href="../batch/index.htm">fichiers batch</a>
  <a href="../batch/choice.htm">choice</a>
  <a href="../batch/goto.htm">goto</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2003 Robert Platt, mis &agrave; jour en 2007 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
