# Language: Russian
# File ending: ru
# Codepage: 866
# This translation was made by Google Gemini.
# Please help the FreeDOS group to improve it.

# Help Message

0.0:FDPKG v0.2 - GPL by Blair Campbell 2005\n
0.1:Устанавливает пакеты FreeDOS в специальном и обычном форматах.\n
0.2:Вызов: FDPKG [/INSTALL] [/REMOVE] [/CHECK] [/CONFIGURE] [/E] PKGX.ZIP...\n
0.3:  /INSTALL        Режим установки; установить пакет (по умолчанию)\n
0.4:  /REMOVE         Режим удаления; удалить пакет\n
0.5:  /CHECK          Режим проверки; проверить зависимости пакета\n
0.6:  /CONFIGURE      Режим настройки; настроить пакет\n
0.7:  /DESC[:FIELD]   Показать описание из LSM. Field (необязательно)\n
0.8:                  - это поле LSM. Поиск сначала в текущем\n
0.9:                  каталоге, затем в %%DOSDIR%%\\APPINFO\n
0.10:  /DISPLAY        Список установленных пакетов по аргументу\n
0.11:  /E              Только извлечь, без проверки зависимостей\n
0.12:                  (если не установлен), без настройки\n
0.13:  /B              Обратная совместимость с fdpkg.bat\n
0.14:  /S[:|=]ARG      Заменить обратные косые черты в ARG на прямые\n
0.15:  /[-]F|/[-]Y     Принудительно; без вопросов (МОЖЕТ БЫТЬ ОПАСНО)\n
0.16:  /?[E]|/H[E]     Эта справка; /?E или /HE - расширенная справка\n
0.17:  PKGX.ZIP        Пакет; можно маски или несколько имен\n
0.18:Коды выхода:\n
0.19:   255            Неверный путь\n
0.20:   0              Нет проблем\n
0.21:   1              Неразрешенные зависимости\n
0.22:   2              Неверное имя\n
0.23:   3              Неверные переменные среды\n
0.24:   4              Неверные параметры или аргументы\n
0.25:   5              Прервано пользователем\n
0.26:   6              Распаковщик не в пути\n
0.27:   7              Недостаточно памяти\n
0.28:   8              Не все файлы удалось удалить\n
0.29:   9              Ошибка извлечения\n
0.30:   10             Замена успешна\n
0.31:   11             Замена не удалась\n

# FDPKG Messages

1.0:Неверные переменные среды.\n
1.1:Недостаточно аргументов.\n
1.2:Диск или каталог не существует.\n
1.3:Неверный параметр в %s\n
1.4:Неверное поле LSM : %s\n

# FUNC Misc Messages

2.0:Нажмите любую клавишу...
2.1:Архиватор не в пути.\n
2.2:Не удалось получить версию установленного %s %s.\n
2.3:Не удалось получить версию для установки.\n
2.4:Версия для установки совпадает с установленным пакетом.\n
2.5:Версия установленного пакета - "%s",\nа версия для установки - "%s".\nПродолжить (Д/Н)? 
2.6:Предупреждения при извлечении %s.\n
2.7:Ошибка распаковки для %s.\n
2.8:Настройка...\n
2.9:двоичные файлы
2.10:исходные коды

# FUNC Messages

3.0:Этому пакету нужен установленный "%s"\nПопытаться установить (Д/Н)? 
3.1:Этот пакет конфликтует с "%s" Удалить (Д/Н)? 
3.2:Запуск depends.bat...\n
3.3:Проверка наличия...\n
3.4:Пакет не найден : %s\n
3.5:Неверная переменная %%DOSDIR%%.\n
3.6:Обновление...\n
3.7:Пакет извлечен\n
3.8:Распаковка...\n
3.9:Пакет установлен.\n
3.10:Не удалось получить поле "%s" для : %s\n
3.11:Вы уверены? Удалить %s %s (Д/Н)? 
3.12:Не все файлы удалось удалить\n
3.13:Не все зависимости выполнены.\n
3.14:Все зависимости выполнены или их нет.\n
3.15:Настройка завершена.\n
3.16:Настройка не требуется.\n
3.17:Этот пакет рекомендует "%s"\n

# Yes character

4.0:Д
