# Language: Russian (ru)
# File ending: ru
# Codepage: 866
# This translation was created by Google AI.
# Please help the FreeDOS group to improve it.

# ВНИМАНИЕ: Использование кириллицы (Д/Н/В) для ввода может вызвать ошибки
# в некоторых средах DOS.

SHARE [/F:space] [/L:locks] [/U] [/S] [/O] [/D] [/E]
  /F:space   Выделяет место (в байтах) для данных о разделении файлов.
  /L:locks   Устанавливает макс. число одновременно блокируемых файлов.
  /U         Выгрузить резидентную копию из памяти.
  /S         Показать статус исправлений и размеры таблиц.
  /O         Работать только если программа уже в памяти.
  /D         Отключить резидентную копию.
  /E         Включить резидентную копию. (По умолчанию.)

Устанавливает средства разделения и блокировки файлов на жестком диске.

