<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : fdshield</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : fdshield</h1>
<pre>
  Le bouclier anti-malware de FreeDOS FDSHIELD surveille les sessions
  DOS et aide &agrave; bloquer les activit&eacute;s dangereuses typiques des chevaux
  de Troie, virus, malware et des erreurs humaines. Ce n'est pas un
  analyseur de virus comme Clamcan et ne v&eacute;rifie pas les signatures de
  virus connus, mais surveille seulement les comportements risqu&eacute;s
  connus.
</pre>
<h2>Syntaxe :</h2>
<pre>
  FdShield [/v][/t][/T][/x][/X][/b][/B][/w][/W]
</pre>
<h2>Options:</h2>
<pre>
      Protection de base si le programme est lanc&eacute; sans options. Arr&ecirc;te
      le syst&egrave;me si un programme tente de d&eacute;sactiver certains autres
      moniteurs antivirus communs, et bloque les effacements
      potentiellement dangereux bas&eacute;s sur <a href="../cnfigsys/fcbs.htm">FCB</a> avec des jokers dans les
      extensions du nom de fichier. Si vous utilisez FdShield dans une
      machine virtuelle, seule DOS dans cette machine virtuelle est
      stopp&eacute;e, pas le syst&egrave;me dans son ensemble.
  /v  Mode verbeux. Donne des informations additionnelles sur les
      raisons d'interdiction des actions, et lorsque FdShield arr&ecirc;te
      le syst&egrave;me, il attend 20 secondes avant de red&eacute;marrer
      automatiquement ou fermer la machine virtuelle.
  /t  Interdit le TSR. Lorsque cela est s&eacute;lectionn&eacute;, Fdshield affichera
      un message d'arr&ecirc;t du syst&egrave;me et red&eacute;marrera ou fermera la session
      si un programme tente de rester r&eacute;sident. Cela peut aider &agrave; arr&ecirc;ter
      les chevaux de Troie et certains infecteurs de fichiers r&eacute;sidents
      et les virus multipartites. Les extenseurs de DOS CWSDPMI et RTM
      sont explicitement autoris&eacute;s &agrave; charger dans ce mode. Notez que les
      virus tendent &agrave; devenir r&eacute;sidents sans utiliser les fonctions de
      DOS pour cela, ce qui leur permet de contourner Fdshield. Cette
      option a du sens car de nombreux programmes comme <a href="../util/dosfsck.htm">DOSFSCK</a>, BZIP2,
      UPX, WGET et d'autres viennent d'UNIX et sont port&eacute;s sous DOS par
      les outils de compilation comme DJGPP et n&eacute;cessitent CWSDPMI.
  /T  Interdit le TSR. Lorsque cette option est s&eacute;lectionn&eacute;e, FdShield
      affichera un message d'arr&ecirc;t du syst&egrave;me et red&eacute;marrera ou fermera
      la session si un programme tente de rester r&eacute;sident. Cette option
      fonctionne de mani&egrave;re similaire &agrave; l'option /t. Les extenseurs DOS
      CWSDPMI et RTM ne sont pas autoris&eacute;s &agrave; charger dans ce mode. Dans
      une session DOS OS/2 ou similaire, CWSDPMI n'est de toute fa&ccedil;on
      pas n&eacute;cessaire. Certains autres extenseurs de DOS ne sont pas TSR
      et fonctionneront donc sans probl&egrave;me avec FdShield /T.
  /x  Prot&egrave;ge en &eacute;criture les fichiers de programmes avec les extensions
      com, exe et sys. Lorsque vous s&eacute;lectionnez cette option, FdShield
      emp&ecirc;che la plupart des tentatives d'&eacute;criture sur les fichiers
      syst&egrave;me, mais permet de cr&eacute;er de nouveaux fichiers de programmes
      tant qu'ils &eacute;vitent explicitement d'&eacute;craser les fichiers existants
      De nombreux outils comme les compilateurs ou les gestionnaires
      d'archive utilisent d'autres fa&ccedil;ons non s&ucirc;res de cr&eacute;er des
      fichiers, et seront donc bloqu&eacute;s par FdShield. Vous devriez
      d&eacute;marrer sans la protection fdShield /x si vous pr&eacute;voyez de
      compiler ou d'installer des programmes. Cependant, si vous avez la
      protection /x activ&eacute;e, de nombreux virus ne seront pas capables
      d'infecter les fichiers de programme.
  /X  Prot&egrave;ge en &eacute;criture les fichiers syst&egrave;me avec les extensions bat,
      com, exe, et sys. Cette option ne permet aucune cr&eacute;ation de fichier
      syst&egrave;me.
      Les fichiers batch ne sont pas une cible commune des virus, mais
      il existe des situations o&ugrave; vous ne voudrez pas qu'ils soient
      modifi&eacute;s de toute fa&ccedil;on. Ni la protection /x ni celle /X emp&ecirc;chent
      l'acc&egrave;s aux fichiers programmes bas&eacute; sur <a href="../util/doslfn.htm">les noms de fichier longs</a>
      Cela n'affecte que les versions de DOS prenant en charge les noms
      de fichiers longs.
  /b  Prot&egrave;ge en &eacute;criture les zones d'amor&ccedil;age (BOOT) des disquettes.
      Cela peut emp&ecirc;cher les virus de secteur de boot et les virus
      multipartites de se se diffuser sous DOS. Cependant, cette
      protection ne fonctionne pas sous OS/2 et les sessions DOS de
      Win NT. Comme ces secteurs sont g&eacute;n&eacute;ralement seulement &eacute;crits par
      des outils comme <a href="../base/format.htm">FORMAT</a>, <a href="../base/sys.htm">SYS</a> et <a href="../base/fdisk.htm">FDISK</a>, /b et /B ne devraient pas
      &ecirc;tre utilis&eacute;es lors du fonctionnement de ces outils.
  /B  Prot&egrave;ge en &eacute;criture les zones d'amor&ccedil;age des disques durs. Cela
      peut emp&ecirc;cher les virus multipartites de se propager aux partitions
      de disque dur. Cela peut ne pas fonctionner sous les sessions DOS
      d'OS/2 et de Win NT, mais ceux-ci disposent de protections contre
      les modifications du secteur d'amor&ccedil;age.
  /w  Prot&egrave;ge en &eacute;criture les disquettes (/w). Les pipes ne fonctionnent
      pas si le r&eacute;pertoire temporaire est <a href="../command/set.htm">d&eacute;fini</a> sur un disque en
      lecture seule (si aucun r&eacute;pertoire n'est d&eacute;fini, le dossier
      courant sera utilis&eacute;). Cette protection ne fonctionne pas dans
      les sessions DOS d'OS/2 et NT.
  /W  Prot&egrave;ge en &eacute;criture les disques durs et les autres lecteurs FAT
      qui ne sont pas des disquettes, tels que les RAMDISK. Si DOS
      essaye d'&eacute;crire sur un disque "fixe", il peut rester coinc&eacute; sur
      une invite qui ne vous laissera que r&eacute;essayer et non annuler la
      tentative d'&eacute;criture. Si vous utilisez /w et /W en m&ecirc;me temps,
      FdShield donnera l'impression que tous les fichiers sont en
      lecture seule, ce qui emp&ecirc;che g&eacute;n&eacute;ralement DOS d'essayer d'&eacute;crire
      sur le disque. Le m&ecirc;me avertissement au sujet des pipes et des
      sessions DOS avec la protection /w reste valable pour
      la protection /W.
  /?  Affiche l'aide.
</pre>
<h2>Commentaires :</h2>
<pre>
  Chargez FdShield aussi t&ocirc;t que possible (apr&egrave;s les logiciels TSR comme
  les pilotes de clavier et de lecteur de CD-ROM) pour b&eacute;n&eacute;ficier de
  sa protection puisque toutes les actions avant le chargement de
  FdShield peuvent endommager votre syst&egrave;me. Pour cette raison vous
  devriez modifier l'ordre d'amor&ccedil;age dans le BIOS pour utiliser C: en
  premier au lieu de A:. De nombreuses nouvelles machines permettent de
  changer manuellement l'ordre d'amor&ccedil;age lors du d&eacute;marrage de
  l'ordinateur si vous en avez besoin. Comme FdShield n'offre aucune
  fonction pour &ecirc;tre d&eacute;charg&eacute; de la m&eacute;moire, vous devez red&eacute;marrer
  l'ordinateur si certains programmes sont bloqu&eacute;s par ses
  fonctionnalit&eacute;s. Pour cette raison il est recommand&eacute; d'ajouter un
  menu d'amor&ccedil;age &agrave; des fins diff&eacute;rentes (cf. l'exemple).
</pre>
<h2>Exemples :</h2>
<pre>
  Dans CONFIG.SYS / FDCONFIG.SYS:
    MENU 0. Syst&egrave;me FreeDOS
    MENU 1. protection antivirus minimale
    MENU 2. protection moyenne (1.-TSR + protection d'&eacute;criture
            du secteur d'amor&ccedil;age du disque dur)
    MENU 3. protection moyenne (recommand&eacute;) (2.+ protection en
            &eacute;criture des programmes)
    MENU 4. protection maximale (3.- tous les TSR + protection en
            &eacute;criture totale)
  et dans AUTOEXEC.BAT:
    IF "%CONFIG%"=="0" echo Le syst&egrave;me n'est pas prot&eacute;g&eacute; par FdShield
    IF "%CONFIG%"=="1" LH FdShield /v
    IF "%CONFIG%"=="2" LH FdShield /v /t /B
    IF "%CONFIG%"=="3" LH FdShield /v /t /B /x
    IF "%CONFIG%"=="4" LH FdShield /v /T /B /b /X /w /W
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
  <a href="../util/dosfsck.htm">dosfsck</a>
  <a href="../util/doslfn.htm">doslfn</a>
  <a href="../cnfigsys/fcbs.htm">fcbs</a>
  <a href="../base/fdisk.htm">fdisk</a>
  <a href="../base/format.htm">format</a>
  <a href="../command/set.htm">set</a>
  <a href="../base/sys.htm">sys</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2005 Eric Auer, Walt Gregg, mis &agrave; jour en 2008 par
  W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
