<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Commande FreeDOS : uide.sys / uidejr.sys</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Commande : uide.sys / uidejr.sys</h1>
<pre>
  UIDE.SYS / UIDEJR.SYS est un pilote de mise en cache DOS "IDE
  universel" qui prend en charge les disques durs IDE et SATA, les
  CD et les DVD.
  UIDE.SYS / UIDEJR.SYS doit &ecirc;tre charg&eacute; dans <a href="../cnfigsys/index.htm">CONFIG.SYS</a> / <a href="../cnfigsys/fdconfig.htm">FDCONFIG.SYS</a>.
  Lorsque FreeDOS fonctionne d&eacute;j&agrave;, vous pouvez charger UIDE.SYS /
  UIDEJR.SYS par la suite avec <a href="../util/devload.htm">DEVLOAD</a>.
  Comme UIDE.SYS est toujours en d&eacute;veloppement, il se peut que certaines
  options ne soient pas disponibles dans la version actuelle. Veuillez
  vous r&eacute;f&eacute;rer au fichier d'aide actuel dans un tel cas.
</pre>
<h2>Syntaxe :</h2>
<pre>
  DEVICE = [chemin] UIDE.SYS [/A] [/B] [/D:NomAppareil] [/F] [/H] [/N1]
           [/N2] [/N3] [/N4] [/Q] [/Rnn] [/Snnnn] [/UX] [/Z]
  DEVICEHIGH = [chemin] UIDE.SYS [/A] [/B] [/D:NomAppareil] [/F] [/H]
               [/N1] [/N2] [/N3] [/N4] [/Q] [/Rnn] [/Snnnn] [/UX] [/Z]
</pre>
<h2>Options :</h2>
<pre>
  UIDE.SYS a g&eacute;n&eacute;ralement besoin seulement de l'option taille /Sn et
  /D: pour sp&eacute;cifier un nom d'appareil pour le redirecteur de CD-ROM
  <a href="../base/shsucdx.htm">SHSUCDX</a>.
  Les options de UIDE.SYS sont :
  /A   Sp&eacute;cifie l'utilisation des adresses E/S "IDE ancien" ALTERNATIFS.
       Le premier contr&ocirc;leur ancien utilisera les adresses alternatives
       01E8h/0168h et un second contr&ocirc;leur utilisera les adresses
       normales 01F0h/0170h. Si /A est omis, le premier contr&ocirc;leur
       utilisera les adresses normales et le second contr&ocirc;leur les
       adresses alternatives, comme c'est g&eacute;n&eacute;ralement le cas pour la
       plupart des programmes de BIOS et des cartes m&egrave;res.
       /A est pour les cas "singuliers" o&ugrave; les adresses "IDE anciennes"
       sont INVERS&Eacute;ES.
       /A n'affecte pas les contr&ocirc;leurs "PCI natifs".
  /B   Pour l'UIDE seulement, demande un pilote basique "autonome"
       UltraDMA pour les disques ou lecteurs CD/DVD (pas de cache ou
       disquettes). Cela peut aider lors des tests et les diagnostics.
       L'UIDE basique peut utiliser 128Ko de m&eacute;moire XMS et peut
       d&eacute;sormais se charger dans l'espace HMA. UIDEJR ignorera /B.
  /D:  Sp&eacute;cifie le nom d'appareil voulu, utilis&eacute; par <a href="../base/shsucdx.htm">SHSUCDX</a> pour
       acc&eacute;der aux lecteurs CD/DVD.
       Exemple : /D:CDROM1 /D:MONCDROM etc.
       Les noms de p&eacute;riph&eacute;rique doivent comporter de 1 &agrave; 8 octets valides
       pour &ecirc;tre utilis&eacute;s dans les noms de fichier DOS. Si /D: est omis,
       ou si le nom de p&eacute;riph&eacute;rique apr&egrave;s le /D: est manquant ou
       invalide, UDVD1 est utilis&eacute; par d&eacute;faut. Lorsque des disques/
       disquettes sont pr&eacute;sents mais qu'il n'y a pas de lecteur CD/DVD,
       le nom UIDE$  ou UIDEJR$ remplacera tout nom /D:.
  /E   Pour UIDE seulement, fait en sorte que le lecteur "appelle le
       BIOS" pour toute E/S disque dur. /E &eacute;vite les probl&egrave;mes de
       configuration avec certains "&eacute;mulateurs" (VirtualBox, etc.) qui
       n'&eacute;mulent pas toute la logique mat&eacute;rielle ! /E permet encore &agrave;
       l'UIDE de mettre en cache les donn&eacute;es du disque dur (au contraire
       de /N1 qui n'effectue aucune gestion de disque dur). UIDEJR
       ignorera /E.
       ***** REMARQUE *****
       L'utilisation de /E sur les syst&egrave;mes en mode prot&eacute;g&eacute; (JEMM386
       etc.) peut r&eacute;sulter en un fonctionnement TR&Egrave;S lent ! De nombreux
       programmes BIOS bas de gamme omettent la logique "VDS" DOS pour
       les disques durs, et en mode prot&eacute;g&eacute; ils ne peuvent que g&eacute;rer les
       transferts en "mode PIO" ancien, pas en UltraDMA ! Si /E est
       n&eacute;cessaire pour l'UIDE, les utilisateurs devraient configurer
       leur syst&egrave;me en mode r&eacute;el (UMBPCI, etc.) chaque fois que ce sera
       possible.
  /F   Pour l'UIDE seulement, demande un cache "rapide" utilisant des
       blocs de cache de 32Ko avec des caches de 40 ou 50 Mo et des
       blocs de cache de 64Ko avec des caches de 80 Mo ou plus. Sans
       /F, les caches de 40 &agrave; 1023 Mo ont des blocs de 16 Ko, et les
       caches de 1024 &agrave; 2047 Mo ont des blocs de 32 Ko, pour jusqu'&agrave;
       25% de capacit&eacute; de cache suppl&eacute;mentaire en raison de moins
       "d'espace perdu" dans le dernier bloc de cache d'un fichier.
       /F renonce a une petite quantit&eacute; de capacit&eacute; au profit d'une
       vitesse plus rapide, car moins de blocs sont g&eacute;r&eacute;s.
       /F est ignor&eacute; avec les caches de 2048 Mo (2 Gigaoctets) et
       davantage, puisqu'ils doivent utiliser des blocs de 64 Ko.
       UIDEJR ignorera /F.
  /H   Demande l'utilisation de l'espace HMA "libre" pour la plus grande
       partie du pilote. /H fait en sorte que l'UIDE utilise seulement
       944 octets ou que UIDEJR n'utilise que 768 octets de m&eacute;moire
       haute. /D NE doit PAS &ecirc;tre utilis&eacute; avec ROM-DOS qui n'a aucun
       HMA ! Lorsque /N3 est aussi entr&eacute;, /H est ignor&eacute;.
       ***** REMARQUE *****
         Les noyaux MS-DOS ont des ERREURS dans l'indication de
         l'espace HMA libre, ce qui peut provoquer des PLANTAGES !
         Entrer /H est aux risques et p&eacute;rils de l'utilisateur !
         Aucun tel plantage n'sest not&eacute; pour d'autres noyaux DOS, mais
         les utilisateurs devraient TESTER un syst&egrave;me avant d'utiliser
         /H ou /HL avec l'UIDE et l'UIDEJR !
  /N1  NE demande AUCUNE gestion des lecteurs de disque dur. /N1 est
       destin&eacute; aux diagnostics et aux situations particuli&egrave;res, pas &agrave;
       une utilisation normale !
  /N2  NE demande AUCUNE gestion des lecteurs CD ou DVD.
       seulement, toute la logique CD/DVD sera ignor&eacute;e, ce qui
       &eacute;conomisera 1680 octets HMA ! /N2 est destin&eacute; aux diagnostics
       et aux situations particuli&egrave;res, pas &agrave; une utilisation normale !
  /N3  Ne demande pas de m&eacute;moire XMS. /N3 n&eacute;cessite un chargement en
       m&eacute;moire basse ou le pilote quittera. Pour l'UIDE, son pilote /B
       "basique" sera utilis&eacute;. /N3 perd beaucoup de vitesse, car une
       E/S "mal align&eacute;e" ou inadapt&eacute; d'une autre fa&ccedil;on &agrave; l'UltraDMA doit
       utiliser la logique BIOS pour les disques ou le "mode PIO" pour
       l'entr&eacute;e CD/DVD.
  /N4  Cf. /Z ci-dessous.
  /Q   Active l'attente d'une "demande de donn&eacute;es" avant de d&eacute;marrer
       les transferts de disque UltraDMA. /Q est pour les syst&egrave;mes
       "anciens" et ne doit &ecirc;tre utilis&eacute; que si l'UIDE se charge
       correctement mais semble incapable de transf&eacute;rer des donn&eacute;es.
       /Q doit &ecirc;tre omis avec un adaptateur SATA-vers-IDE de chez
       Sabrent ou d'autres, car de telles cartes n'&eacute;mulent pas les
       "demandes de donn&eacute;es" depuis un disque SATA !
       /Q n'affecte pas les lecteurs CD/DVD.
  /R15 R&egrave;gle la m&eacute;moire XMS du pilote &agrave; 16 ou 64 Mo. /R15 r&eacute;servera
       15 Mo de
  /R63 XMS, et /R63 r&eacute;servera 63 Mo de XMS, pour les anciens programmes
       de "jeu" qui n&eacute;cessitent de la m&eacute;moire XMS sous 16 Mo ou 64 Mo !
       UIDE/UIDEJR doit &ecirc;tre capable de r&eacute;server cette m&eacute;moire, puis de
       r&eacute;server leur XMS requis au-dessus de cela, puis de "lib&eacute;rer" la
       m&eacute;moire XMS r&eacute;serv&eacute;e. Sinon le pilote affichera "XMS init error"
       et quittera !
       /R15 ou /R63 n&eacute;cessitent que UIDE/UIDEJR soient charg&eacute;s apr&egrave;s
       le gestionnaire XMS de l'utilisateur (XMGR, HIMEMX, etc.) donc un
       autre pilote ne peut pas prendre de la m&eacute;moire XMS en premier,
       et la m&eacute;moire XMS doit &ecirc;tre juste au-del&agrave; de l'espace HMA. Voyez
       la section 7 du fichier README pour davantage de d&eacute;tails.
  /Sn  Pour l'UIDE seulement, sp&eacute;cifie la taille du cache d&eacute;sir&eacute;, en
       m&eacute;gaoctets de m&eacute;moire XMS. Les valeurs pour /S sont 5, 15, 25,
       40, 50, et n'importe quel nombre de 80 &agrave; 4093. /S1024 ou plus
       donne un cache de 1- &agrave; 4-GIGAOCTETS ! Utilisez un cache aussi
       grand que possible pour g&eacute;rer les GROS fichiers de donn&eacute;es de
       nos jours --
         Sous 128-Mo de m&eacute;moire :     Utilisez /S5 /S15 /S25 ou /S40
         Avec 128-Mo de m&eacute;moire :      Utilisez /S25 /S40 /S50 ou /S80
         Avec 256-Mo de m&eacute;moire :      Utilisez /S80  jusqu'&agrave; /S127
         Avec 512-Mo de m&eacute;moire :      Utilisez /S160 jusqu'&agrave; /S255
         Avec 1-Go de m&eacute;moire :        Utilisez /S320  jusqu'&agrave; /S511
         Avec 2-Go de m&eacute;moire :        Utilisez /S640  jusqu'&agrave; /S1023
         Avec 4-Go de m&eacute;moire :        Utilisez /S1280 jusqu'&agrave; /S3072
       Les petits syst&egrave;mes peuvent pr&eacute;f&eacute;rer /S25 ou /S50 qui d&eacute;finissent
       des blocs de cache de 1600 et sont plus efficaces. Si /S est
       omis/invalide, un cache de 80-Mo est d&eacute;fini. Sauf pour 25 ou 50,
       les valeurs en-dessous de 80 sont "arrondies" &agrave; 40- 15- ou 5-Mo.
       UIDE affiche "XMS init error" et quitte lorsqu'il n'y a pas assez
      de m&eacute;moire XMS de libre !
       Si c'est le cas, un cache plus petit doit &ecirc;tre demand&eacute;. Pour les
       gestionnaires XMS V2.0 anciens (ROM-DOS etc.), seuls les options
       de /S5 &agrave; /S50 peuvent &ecirc;tre utilis&eacute;es. UIDEJR ignorera /S.
  /U8  Pour UIDEJR seulement, g&egrave;re jusqu'&agrave; 8 lecteurs CD/DVD, pas 4.
       Cela ajoute 80 octets &agrave; la taille d'UIDEJR. /U8 est rarement
       n&eacute;cessaire, car peu de PC ont plus de 4 CD/DVD. UIDE et UIDE2
       ignoreront /U8, car ils g&egrave;rent toujours jusqu'&agrave; 8 lecteurs
       CD/DVD.
  /UX  D&eacute;sactive tout l'UltraDMA des CD/DVD, m&ecirc;me pour les lecteurs qui
       peuvent le g&eacute;rer. Le mode PIO est alors utilis&eacute; pour toutes les
       requ&ecirc;tes CD/DVD.
       &Agrave; l'exception de certains lecteurs "inhabituels" de Sony, etc.
       qui ne se conforment pas &agrave; toutes les "r&egrave;gles" ATAPI, /UX est
       rarement .
       n&eacute;cessaire. /UX n'affecte pas les disques durs.
  /Z   Pour XMGR ou UIDE seulement, limite leur d&eacute;placement &agrave; 2 Ko en
       mode prot&eacute;g&eacute;, pas &agrave; 64 Ko. /Z est ignor&eacute; par les syst&egrave;mes de
       mode r&eacute;el (UMBPCI etc.) et n'est pas n&eacute;cessaire si JEMM386 ou
       EMM386 g&egrave;rent le mode prot&eacute;g&eacute;. Les syst&egrave;mes utilisant d'autres
       pilotes VCPI/DPMI/EMM doivent &ecirc;tre TEST&Eacute;S pour voir si XMGR ou
       UIDE ont besoin de /Z
       -- de MAUVAIS sch&eacute;mas n'autorisant PAS assez d'interruptions
       dans un d&eacute;placement XMS peuvent encore exister ! L'ancienne
       option /N4 de l'UIDE est identique &agrave; /Z et peut toujours &ecirc;tre
       utilis&eacute;e. UIDEJR ignore /Z ou /N4 et &eacute;m&eacute;t toujours des appels
       XMS standards.
  Pour chaque option un tiret d'union peut remplacer la barre oblique,
  et des lettres minuscules peuvent &ecirc;tre utilis&eacute;es.
</pre>
<h2>Commentaires :</h2>
<pre>
  UIDE.SYS est un pilote de mise cache DOS "IDE universel". Il intercepte
  les requ&ecirc;tes BIOS E/S "Int13h" et met en cache les donn&eacute;es pour
  jusqu'&agrave; 34 unit&eacute;s de BIOS, y compris les disquettes A: et B: si elles
  sont pr&eacute;sentes, et les disques durs jusqu'&agrave; 2 To. UIDE.SYS accepte
  les appels E/S 48-bit LBA et 24-bit CHS par les syst&egrave;mes DOS nouveaux
  ou anciens. Il utilise sa propre logique pour les disques durs SATA
  ou IDE et fera fonctionner jusqu'&agrave; 10 contr&ocirc;leurs "anciens" ou "PCI
  natifs". Toute l'E/S possible est g&eacute;r&eacute;e en m&eacute;moire cache pour obtenir
  une vitesse &eacute;lev&eacute;e. UIDE "appelle le BIOS" pour les diquettes, le SCSI
  et d'autres mod&egrave;les de disques pour pouvoir mettre en cache TOUS les
  diques sur un syst&egrave;me DOS ! Les pilotes "Int 13h" peuvent &ecirc;tre
  charg&eacute;s avant UIDE, et il interceptera et mettra en cache l'E/S pour
  leurs disques aussi. ("ASPI et d'autres pilotes qui n'utilisent pas
  Int 13h ne sont pas pris en charge.)
  UIDE prend aussi en charge jusqu'&agrave; 8 lecteurs CD/DVD, y compris les
  contr&ocirc;leurs SATA, IDE, ou ceux du "mode PIO" plus anciens. Au
  chargement, il v&eacute;rifie jusqu'&agrave; 10 contr&ocirc;leurs IDE "natifs PCI" ou
  "anciens" et ex&eacute;cute les 8 premiers lecteurs CD/DVD trouv&eacute;s. UIDE
  g&egrave;re les entr&eacute;es de fichiers pour SHCDX33E et d'autres "redirecteurs
  de CD-ROM" comme MSCDEX, et il met en cache toutes les donn&eacute;es de
  fichier et de r&eacute;pertoire pour une vitesse accrue ! Il g&egrave;re &eacute;galement
  les requ&ecirc;tes "audio" DOS et peut jouer un CD audio. Les donn&eacute;es,
  jouer un CD et les programmes "trackwriter" peuvent &ecirc;tre g&eacute;r&eacute;s par
  UIDE en utilisant plusieurs lecteurs sur un seul syst&egrave;me.
  L'audio et le "trackwriting" ne sont pas mis en cache. UIDE met en
  cache de 5 M&eacute;gaoctets &agrave; 4 GIGAOCTETS de donn&eacute;es ! Il utilise 5344
  octets de m&eacute;moire haute quelle que soit la taille du cache. Tous les
  tableaux de cache et les donn&eacute;es sont en m&eacute;moire XMS. Un UIDE
  "autonome" (option /B, pas de mise en cache ni disquettes) peut &ecirc;tre
  utilis&eacute;e pour des test/diagnostics et prend 3824 octets de m&eacute;moire
  haute. UIDE peut aussi &ecirc;tre charg&eacute; dans la m&eacute;moire DOS de 640Ko, et
  son option /H peut &ecirc;tre utilis&eacute;e pour mettre la plupart du pilote
  en espace HMA libre, ne prenant ainsi que 944 octets de m&eacute;moire
  haute ou de DOS. UIDEJR.SYS ("UIDE junior") omet la mise en cache
  mais g&egrave;re encore jusqu'&agrave; 10 contr&ocirc;leurs SATA/IDE, 32 disques durs
  SATA/IDE et 8 lecteurs CD/DVD SATA/IDE/"mode PIO".
  Vous devriez charger un gestionnaire XMS (par ex. <a href="../base/xmgr.htm">XMGR.SYS</a>, <a href="../base/himemx.htm">HIMEMX</a>
  ou <a href="../base/jemmex.htm">JEMMEX</a> avant UIDE.SYS.
</pre>
<h2>Exemples :</h2>
<pre>
  Dans CONFIG.SYS / FDCONFIG.SYS:
    DEVICE=C:\FDOS\BIN\XMGR.SYS /N128 /B
    DEVICEHIGH=C:\FDOS\DRIVERS\UIDE.SYS /S125 /D:MONDVD
  Dans AUTOEXEC.BAT:
    c:\fdos\bin\SHSUCDX /D:MONDVD
</pre>
<h2>Voir &eacute;galement :</h2>
<pre>
 (<a href="../base/atapicdd.htm">atapicdd.sys</a>)
  <a href="../batch/autoexec.htm">autoexec.bat</a>
  <a href="../cnfigsys/index.htm">config.sys</a>
  <a href="../util/devload.htm">devload</a>
  <a href="../cnfigsys/fdconfig.htm">fdconfig.sys</a>
 (<a href="../base/gcdrom.htm">gcdrom.sys</a>)
 (<a href="../base/mscdex.htm">mscdex</a>)
  <a href="../base/shsucdx.htm">shsucdx</a>
 (<a href="../base/udma.htm">udma.sys</a>)
 (<a href="../base/udma2.htm">udma2.sys</a>)
 (<a href="../base/udvd.htm">udvd.sys</a>)
 (<a href="../base/xcdrom.htm">xcdrom.sys</a>)
 (<a href="../base/xdma.htm">xdma.sys</a>)
  <a href="../base/xmgr.htm">xmgr.sys</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2007 Jack Ellis, mis &agrave; jour en 2011 par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Ce fichier est d&eacute;riv&eacute; de FreeDOS Spec Command HOWTO.
  Voyez le fichier <a href="../other/h2cpying.htm">H2Cpying</a> pour les conditions de copie.

</pre></body></html>
