# Language: Russian
# File ending: ru
# Codepage: 866
# This translation was made by Google Gemini.
# Please help the FreeDOS group to improve it.

vdelete [опции]

Удалить строку в текущем местоположении.

    [нет]       Удалить строку.
    n           Удалить n строк.
    /A n        Установить атрибут текста на n.
    /B цвет     Установить атрибут текста фона на цвет (или значение).
    /F цвет     Установить атрибут текста переднего плана на цвет (или
                значение).
    /G          Глобальное удаление.
    /L          Локальное удаление. (По умолчанию)
    /K n        Использовать n вместо символа рамки для обнаружения
                границ.
