# Language: Russian
# File ending: ru
# Codepage: 866
# This translation was made by Google Gemini.
# Please help the FreeDOS group to improve it.

vprogres [options]

Рисует индикатор выполнения в текущей позиции без смещения курсора.

[none]          Рисует индикатор выполнения на 0%.
/A n            Устанавливает атрибут текста в n.
/B color        Устанавливает атрибут цвета фона в color (или
                значение).
/F color        Устанавливает атрибут цвета текста в color (или
                значение).
/W width        Переопределяет ширину индикатора по умолчанию.
                (по умолчанию - от курсора до конца строки)
/K n            Использует n вместо символа рамки для определения
                границ.
value           Устанавливает значение в процентах выполнения.
off             Не отображать число процентов.
align           Число процентов слева, по центру (по умолчанию)
                или справа от индикатора.
OF max          Вычисляет процент от max. Пример 5 OF 7.
