<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Mise en r&eacute;seau de FreeDOS - Historique de la mise en r&eacute;seau de DOS</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1><a name="top"></a>Mise en r&eacute;seau de FreeDOS - Historique de la mise en r&eacute;seau de DOS</h1>
<h2><a name="zzz"></a>Pourquoi DOS &eacute;tait livr&eacute; sans connectivit&eacute; r&eacute;seau</h2>
<pre>
  L'IBM Personal Computer (PC) a &eacute;t&eacute; mis sur le march&eacute; le 12 ao&ucirc;t 1981
  en tant que r&eacute;ponse &agrave; l'Apple II qui mena&ccedil;ait le march&eacute; d'IBM avec
  des logiciels bureatiques comme VisiCalc et WordStar. Le syst&egrave;me
  d'exploitation (SE) pour le PC a d&ucirc; &ecirc;tre fait dans un laps de temps
  extr&ecirc;mement court, apr&egrave;s que Digital Research (DR) ait rat&eacute; l'occasion
  d'accorder une licence de leur "Control Program for Micros" ou
  "Programme de contr&ocirc;le pour micros" (CP/M) &agrave; IBM. La jeune compagnie
  de logiciels Microsoft, &agrave; l'origine seulement cens&eacute;e fournir les
  interpr&eacute;teurs et compilateurs de langage tels que BASIC et Fortran,
  est intervenue. Microsoft a accept&eacute; de proposer un prototype de syst&egrave;me
  d'exploitation similaire &agrave; CP/M, en seulement trois mois. Ils ont
  achet&eacute; et adapt&eacute; le "Quick and Dirty OS" (QDOS) de Seattle Computer
  pour r&eacute;pondre aux attentes d'IBM. La version 1.0 du "Microsoft Disk
  Operating System" (MS DOS, aussi vendu en tant que "PC DOS" par IBM)
  avait 4000 lignes de code. La mise en <a href="../network/network.htm">r&eacute;seau</a> ne faisait pas partie de
  ses fonctionnalit&eacute;s et d'autres t&acirc;ches ont pu &ecirc;tre bien plus
  importantes :
  Le premier DOS ne savait m&ecirc;me pas comment g&eacute;rer les disques durs.
  Microsoft &eacute;tait aussi occup&eacute;e &agrave; travailler sur les applications qui
  devaient devenir la pierre angulaire de son succ&egrave;s : "Multiplan"/
  "Excel" et "Word". Les fonctionnalit&eacute;s <a href="../network/network.htm">r&eacute;seau</a> semblent avoir &eacute;t&eacute;
  report&eacute;es au successeur de DOS, soit OS/2, qui a &eacute;t&eacute; officiellement
  annonc&eacute; par Microsoft et IBM en 1985 (et lanc&eacute; en 1987). En attendant,
  Microsoft a fourni XENIX, une variante UNIX qui &eacute;tait disponible pour
  l'IBM PC depuis 1983. Cela a laiss&eacute; du temps &agrave; d'autres. Il y avait
  deux approches pour la mise en <a href="../network/network.htm">r&eacute;seau</a> de DOS, qui peuvent &ecirc;tre
  appel&eacute;es les approches "centr&eacute;e sur le PC" et "centr&eacute;e sur UNIX"
  (<b>http://www.sju.edu/~jhodgson/netw/kw_hwk4.html (*01)</b>).
    * L'approche "centr&eacute;e sur le PC" veut dire une fa&ccedil;on de mettre en
      <a href="../network/network.htm">r&eacute;seau</a> un groupe de PC pour partager des fichiers et des
      ressources (par exemple des imprimantes).
    * L'approche "centr&eacute;e sur UNIX" consiste &agrave; d&eacute;velopper des versions
      DOS de programmes <a href="../network/network.htm">r&eacute;seau</a> standards UNIX et &agrave; les utiliser pour
      acc&eacute;der &agrave; ou fournir des services similaires &agrave; UNIX sur des
      r&eacute;seaux locaux ou sur Internet (ce qui, au bout du compte,
      revenait aussi &agrave; partager des fichiers et des ressources).
</pre>
<h2><a name="aaa"></a>L'approche "centr&eacute;e sur le PC"</h2>
<pre>
  <b><a href="../network/novell.htm">Novell</a> NetWare</b>

  En 1985 <a href="../network/novell.htm">Novell</a>, un ancien
  fabriquant de syst&egrave;mes CP/M, a lanc&eacute; son produit "NetWare 86" (v 1.5)
  pour le PC. Une version pour AT a suivi avec "NetWare 286" (v 2.0)
  en 1986.
  <a href="../network/novell.htm">Novell</a> a mis en r&eacute;seau les ordinateurs selon le mod&egrave;le client/serveur:
  Les clients ex&eacute;cutant MS DOS et certains logiciels r&eacute;sidents en
  m&eacute;moire (TSR) <a href="../network/novell.htm">Novell</a> &eacute;taient en mesure "d'ouvrir une session" sur un
  serveur qui ex&eacute;cutait "<a href="../network/novell.htm">Novell</a> NetWare Server" (serveur Netware).
  Ce serveur &eacute;tait une machine con&ccedil;ue pour g&eacute;rer le <a href="../network/network.htm">r&eacute;seau</a> et contr&ocirc;ler
  l'acc&egrave;s aux p&eacute;riph&eacute;riques partag&eacute;s, tels que les lecteurs de disques
  et les imprimantes. Une fois connect&eacute;s, les clients pouvaient "mapper"
  un volume sur le serveur &agrave; une lettre de lecteur sous DOS et l'utiliser
  comme un lecteur local. Ils &eacute;taient aussi capables d'utiliser les
  imprimantes connect&eacute;es au serveur.
  Le client et le serveur communiquaient sur le protocle "Internetwork
  Packet Exchange/Sequenced Packet Exchange" de <a href="../network/novell.htm">Novell</a> (<a href="../network/ipxspx.htm">protocole IPX/SPX</a>)
  L'architecture du pilote &eacute;tait appel&eacute; "Open Datalink Interface" (<a href="../network/odi.htm">ODI</a>).
  NetWare a &eacute;tabli une position dominante sur le march&eacute; jusqu'au milieu
  des ann&eacute;es quatre-vingt-dix.

  <b><a name="aab"></a>GESTIONNAIRE LAN</b>
    (Image du gestionnaire LAN)
  En 1983, ind&eacute;pendamment de <a href="../network/novell.htm">Novell</a>, IBM et la compagnie californienne
  Sytek Inc. (rachet&eacute;e par Hughes <b>http://www.hughes.com/ (*02)</b> en 1989)
  ont d&eacute;velopp&eacute; le protocole de mise en r&eacute;seau <b>NetBIOS</b>.
  Il &eacute;tait con&ccedil;u pour des petites installations LAN de 72 &agrave; 80 machines.
  En 1985 IBM a produit un &eacute;mulateur de <b>NetBIOS</b>, appel&eacute; <a href="../network/cifs.htm">NetBEUI</a> (<b>NetBIOS</b>
  Extended User Interface) qui prenaient en charge jusqu'&agrave; 260 machines.
  En 1985 Microsoft a lanc&eacute; sa propre impl&eacute;mentation de <b>NetBIOS</b>, appel&eacute;e
  MS-Net. Elle n'a pas &eacute;t&eacute; utilis&eacute;e &agrave; grande &eacute;chelle. En 1987
  l'entreprise a lanc&eacute;  "Microsoft LAN Manager" 1.0 - sa premi&egrave;re
  comp&eacute;tition s&eacute;rieuse contre <a href="../network/novell.htm">Novell</a> Netware. Tout comme <a href="../network/novell.htm">Novell</a> Netware,
  le gestionnaire LAN de Microsoft impl&eacute;mentait une architecture
  <b>client/</b><b>serveur</b> :
    * Le serveur ex&eacute;cutait le syst&egrave;me d'exploitation OS/2 et le
      gestionnaire LAN en tant que logiciel serveur.
    * Le client ex&eacute;cutait DOS, OS/2 ou Macintosh en tant que SE et
      utilisait un logiciel client comme "LAN Manager client" or
      "<a href="../network/msclient.htm">Client MS</a>" pour la connexion au serveur.
  Avec l'ajout du protocole <b>"Server Message Block" (SMB)</b> au gestionnaire
  LAN depuis 1991, les <a href="../network/network.htm">r&eacute;seaux</a> Microsoft sont &eacute;galement devenus capables
  d'&eacute;changes <b>pair &agrave; pair</b>. Cela &eacute;tait utilis&eacute; par Windows for Workgroups
  3.11, lanc&eacute; en 1993. Le m&eacute;canisme est connu des utilisateurs Windows
  en tant que "Partage Windows", "voisinage <a href="../network/network.htm">r&eacute;seau</a>" ou "Workgroup"
  (groupe de travail).
    (Image de l'extension groupe de travail pour MS-DOS)
  En octobre 1993 Microsoft a lanc&eacute; un outil appel&eacute; "Extension groupe de
  travail Microsoft pour MS-DOS" qui a permis d'avoir les m&ecirc;mes
  possibilit&eacute;s de mise en <a href="../network/network.htm">r&eacute;seau</a> pair &agrave; pair sous DOS. Bien que l'outil
  ne soit plus en vente, la plupart de ses fonctionnalit&eacute;s sont toujours
  disponibles avec l'utilisation du "<a href="../network/msclient.htm">client MS</a>" et une mise &agrave; jour
  sp&eacute;ciale appel&eacute;e "WG1049" (voyez : <a href="../network/msclient.htm">Client MS</a>).
  Les logiciels de mise en r&eacute;seau de Microsoft &eacute;taient livr&eacute;s avec son
  propre mod&egrave;le de pilote  <a href="../network/network.htm">r&eacute;seau</a> appel&eacute; "Network Driver Interface
  Specification" (<a href="../network/ndis.htm">NDIS</a>) que l'entreprise avait d&eacute;velopp&eacute; avec <a href="../network/3com.htm">3Com</a>.
  Le gestionnaire LAN n'a pas battu son comp&eacute;titeur <a href="../network/novell.htm">Novell</a> Netware.
  En plus d'&ecirc;tre  second sur le march&eacute;, un autre inconv&eacute;nient peut-&ecirc;tre
  &eacute;t&eacute; caus&eacute; par fait que vous deviez installer le syst&egrave;me d'exploitation
  OS/2 sur le serveur. OS/2 n'&eacute;tait pas populaire chez les consommateurs.
  Depuis 1993, "Microsoft Windows NT Advanced Server (v3.1)" &eacute;tait
  utilis&eacute; &agrave; sa place du c&ocirc;t&eacute; serveur. En ao&ucirc;t 1995, le lancement (et la
  r&eacute;ception positive) de "Windows 95" a mis fin aux activit&eacute;s r&eacute;seau
  sous DOS. Cette version Windows avait sa propre pile <a href="../network/tcpip.htm">TCP/IP</a> d&eacute;j&agrave;
  int&eacute;gr&eacute;e et &eacute;tait livr&eacute; avec le r&eacute;seau <b>SMB</b> pair &agrave; pair donc de
  nombreuses solutions tierces parties n'&eacute;taient plus n&eacute;cessaires.
</pre>
<h2><a name="bbb"></a>L'approche "centr&eacute;e sur Unix"</h2>
<pre>
  Les exp&eacute;riences pour faire fonctionner <a href="../network/tcpip.htm">TCP/IP</a> sur PC ont commenc&eacute; peu
  de temps apr&egrave;s son lancement par IBM. Les premiers &agrave; travailler sur
  le sujet &eacute;taient Dave Clark, Jerry Saltzer et l'&eacute;tudiant de premi&egrave;re
  ann&eacute;e John Romkey (<b>http://www.romkey.com/ (*03)</b>) au laboratoire
  d'informatique du Massachusetts Institute of Technology (MIT). En 1981
  ils ont commenc&eacute; un projet de recherche dont le but &eacute;tait "de voir
  si <a href="../network/tcpip.htm">TCP/IP</a> pouvait fonctionner sur quelque chose d'aussi petit que
  l'IBM PC" comme s'en souvient Romkey
  (<b>http://www.drizzle.com/~aboba/internaut/pc-ip.html (*04)</b>).

  <b><a name="bbc"></a>PC-IP (PC/IP)</b>

  Le r&eacute;sultat &eacute;tait appel&eacute; "PC-IP", une impl&eacute;mentation <a href="../network/tcpip.htm">TCP/IP</a> l&eacute;g&egrave;re
  qui &eacute;tait li&eacute;e &agrave; quelques applications comme finger, whois et netwatch.
  PC-IP a &eacute;t&eacute; publi&eacute; avec son code source dans le domaine public. Drew
  Perkins de l'Universit&eacute; Carnegie Mellon (CMU) et Dan Lanciani de
  l'Universit&eacute; Harvard ont encore am&eacute;lior&eacute; le code. PC-IP peut encore
  &ecirc;tre trouv&eacute; sur Internet (<b>http://members.aol.com/Karima4483/pcip/
  (*05)</b>) ou
  (<b>ftp://ftp.kuzbass.ru/pub/networks/tcpip/tool/pcip.zip (*06)</b>).

  <b><a name="bbd"></a>PC-TCP (PC/TCP)</b>
    (Ic&ocirc;nes des applications PC/TCP)
  Le succ&egrave;s de PC-IP a inspir&eacute; Romkey et ses amis &agrave; prendre la version
  CMU du code et &agrave; le d&eacute;velopper en un produit propri&eacute;taire : "PC/TCP",
  qu'ils ont vendu &agrave; travers leur entreprise "FTP Software, Inc.",
  fond&eacute;e en 1986 (<b>http://en.wikipedia.org/wiki/FTP_Software (*07)</b>).
  Le nom avait &eacute;t&eacute; choisi d'apr&egrave;s le populaire protocole de transfert de
  fichiers : PC/TCP comprenait l'une des premi&egrave;res applications pour les
  services FTP sur le PC.

  <b><a name="bbe"></a>Les pilotes de paquets</b>

  Avec PC/TCP, FTP Software Inc. a d&eacute;velopp&eacute; "la sp&eacute;cification de pilote
  de paquets", (<b>http://www.crynwr.com/packet_driver.html (*08)</b>)
  la premi&egrave;re sp&eacute;cification multiprotocole pour les cartes d'interface
  <a href="../network/network.htm">r&eacute;seau</a> pour PC. Le 12 d&eacute;cembre 1988, cette sp&eacute;cification a &eacute;t&eacute;
  publi&eacute;e en tant que standard ouvert, pour que tout un chacun puisse
  l'impl&eacute;menter.
  Les pilotes de paquets se sont r&eacute;v&eacute;l&eacute;s utiles &agrave; la fois pour les
  fabricants de mat&eacute;riel et les d&eacute;veloppeurs de logiciels. La plupart
  des applications <a href="../network/tcpip.htm">TCP/IP</a> du domaine public ou shareware ont &eacute;t&eacute; &eacute;crits
  pur s'interfacer seulement avec les pilotes de paquets. De nombreux
  pilotes de paquets furent &eacute;crits ou g&eacute;r&eacute;s par Russ Nelson &agrave; l'Universit&eacute;
  de Clarkson, qui fut connu comme le "roi des pilotes de paquets" - une
  histoire qu'il raconte sur son site Internet (<b>http://russnelson.com/
  bio.html (*09)</b>). Nelson distribue toujours ces pilotes en tant que
  logiciels libres &agrave; travers le site de son entreprise "<a href="../network/crynwr.htm">Crynwr</a>"
  (<b>http://www.crynwr.com/ (*10)</b>) (qui fut nomm&eacute; d'apr&egrave;s le mot gallois
  signifiant "Quaker", sa croyance religieuse). Apprenez-en davantage
  sur <a href="../network/crynwr.htm">Crynwr</a> ici.
  L'une des raisons du succ&egrave;s de PC/TCP de FTP Software &eacute;tait cette
  interface ouverte de pilote de paquets, qui a rendu facile le
  d&eacute;veloppement des pilotes et des applications. Lorsque d'autres
  interfaces comme <a href="../network/odi.htm">ODI</a> et <a href="../network/ndis.htm">NDIS</a> sont apparues sur la sc&egrave;ne, PC/TCP a
  inclus des convertisseurs : avec un outil appel&eacute; <a href="../network/odi_ins.htm#ccc">ODIPKT.COM</a>, les
  pilotes ODI sont devenus utilisables en tant que pilotes de paquets,
  un outil appel&eacute; DIS_PKT.GUP a fait de m&ecirc;me pour les <a href="../network/ndis_ins.htm">pilotes NDIS</a>.
  PC/TCP &eacute;tait aussi livr&eacute; avec un <a href="../network/ldtcpipk.htm">Kernel TCP/IP</a> externe appel&eacute;
  ETHDRV.EXE qui permettait &agrave; d'autres programmeurs d'appeler les
  fonctionnalit&eacute;s <a href="../network/network.htm">r&eacute;seau</a> depuis leurs programmes sans avoir &agrave; le
  programmer eux-m&ecirc;mes. Toutes ces fonctionnalit&eacute;s et une suite
  d'applications qui a permis aux ordinateurs sous DOS d'acc&eacute;der &agrave; ou
  de fournir des services <a href="../network/tcpip.htm">TCP/IP</a> tels que les news, l'e-mail, le ftp,
  <b>Telnet</b> ou le stockage <a href="../network/network.htm">r&eacute;seau</a> (PC/TCP avait m&ecirc;me inclus un client
  <a href="../network/nfs.htm">NFS</a> appel&eacute; InterDrive) ont fait de FTP Software le leader du march&eacute;
  des logiciels <a href="../network/tcpip.htm">TCP/IP</a> pour DOS.
  PC/TCP a &eacute;t&eacute; install&eacute; sur plus de 10 millions de machines DOS machines
  &agrave; travers le monde. Au milieu des ann&eacute;es 90, FTP Software Inc. avait
  plus de 700 employ&eacute;s (voyez ici pour plus d'informations
  <b>http://www.answers.com/topic/ftp-software?cat=biz-fin (*11)</b>).

  <b>Logiciels d&eacute;velopp&eacute;s par les universit&eacute;s et les passionn&eacute;s</b>

  PC-IP et son successeur PC/TCP ont peut-&ecirc;tre &eacute;t&eacute; les premiers et les
  plus r&eacute;ussis des <a href="../network/ldtcpipk.htm">noyaux TCP/IP</a> pour DOS mais ils n'&eacute;taient pas
  les seuls.

  <b><a name="bbf"></a>KA9Q</b>

  Deuxi&egrave;me apr&egrave;s le premier kernel PC-IP &eacute;tait le "syst&egrave;me d'exploitation
  <a href="../network/network.htm">r&eacute;seau</a> KA9Q" (NOS, voyez : <b>http://www.ka9q.net/code/ka9qnos/ (*12)</b>) par
  Phil Karn en 1985. Karn, un ing&eacute;nieur de Baltimore, Maryland l'avait
  cr&eacute;&eacute; pour CP/M deux ans auparavant puis l'avait port&eacute; sous DOS. C'&eacute;tait
  aussi l'une des premi&egrave;res applications <a href="../network/tcpip.htm">TCP/IP</a> pour DOS qui utilisaient
  la sp&eacute;cification de pilote de paquets de FTP Software. KA9Q agissait
  simultan&eacute;ment comme un client Internet, un serveur et un routeur de
  paquets IP. Le programme &eacute;tait sp&eacute;cialis&eacute; dans la radio par paquets
  amateur, mais pouvait aussi &ecirc;tre utilis&eacute; par exemple comme serveur web
  ou ftp. KA9Q a attir&eacute; de nombreux contributeurs. Comme le d&eacute;crit
  Karn : "c'&eacute;tait le Linux de son &eacute;poque" (<b>http://www.ka9q.net/code/
  ka9qnos/ (*13)</b>). En 2002 KA9Q est devenu un logiciel libre (GNU GPL).
  Ses descendants, JNOS (<b>http://www.langelaar.net/projects/jnos2/ (*14)</b>)
  et <a href="../network/tcpip_ap.htm#ddd">EZ-NOS2</a> (<b>http://eznos.knevel.info/index.php (*15)</b>) (voyez &eacute;galement
  <b>http://www.hippy.freeserve.co.uk/eznos.htm (*16)</b> and
  <b>http://www.dossolutions.pwp.blueyonder.co.uk/eznos.htm (*17)</b>)
  sont toujours activement maintenus.

  <b><a name="bbg"></a>NCSA Telnet</b>

  Sur la base de la sp&eacute;cification des pilotes de paquets, plusieurs
  universit&eacute;s ont &eacute;crit des applications et utilitaires <a href="../network/tcpip.htm">TCP/IP</a> pour les
  PC DOS. En 1986, le "National Center for Supercomputing Applications"
  (NCSA) &agrave; l'Universit&eacute; d'Illinois a publi&eacute; "<b>Telnet</b>"
  (<b>ftp://ftp.uu.net/.vol/1/applic/NCSA_Telnet/PC/tel2308b.zip (*18)</b>)
  - un client pour les services <b>Telnet</b> UNIX qui pouvait  &eacute;galement
  agir en tant que serveur FTP et rcp. Il &eacute;tait accompagn&eacute; par des
  outils <a href="../network/tcpip.htm">TCP/IP</a> comme finger, whois et lpr. NCSA <b>Telnet</b> &eacute;tait livr&eacute;
  avec son propre <a href="../network/ldtcpipk.htm">kernel TCP/IP</a>, qui &eacute;tait d&eacute;j&agrave; int&eacute;gr&eacute; aux applications.
  Le logiciel a &eacute;t&eacute; d&eacute;velopp&eacute; jusqu'en 1995 (v2.308) et publi&eacute; avec son
  code source dans le domaine public.
  (<b>ftp://ftp.uu.net/.vol/1/applic/NCSA_Telnet/PC/tel2308s.zip (*19)</b>)

  <b><a name="bbh"></a>CUTCP</b>

  L'Universit&eacute; de Clarkson &agrave; Potsdam, New York a pris la version 2.2 de
  NCSA <b>Telnet</b> et l'a modifi&eacute;. Ils ont appel&eacute; leur version CUTE ou CUTCP.
  Par la suite l'Universit&eacute; de Rutgers &agrave; New Jersey a repris la
  maintenance et a publi&eacute; la derni&egrave;re version en juillet 1993
  (<b>ftp://ftp.cc.umanitoba.ca/software/pc_network/cutcp-b.zip (*20)</b>).
  &Agrave; la diff&eacute;rence de NCSA <b>Telnet</b>, CUTCP prenait en charge
  l'&eacute;mulation IBM-3270 et &eacute;tait techniquement am&eacute;lior&eacute;. Il est aussi
  entr&eacute; dans le domaine public.

   <b><a name="bbi"></a>Autres</b>
    (Image de MINUET Version 1.0 Beta 18A)
  D'autres d&eacute;veloppements par des universit&eacute;s qui devraient &ecirc;tre
  mentionn&eacute;s sont "Kermit", (<b>http://www.columbia.edu/kermit/ (*21)</b>)
  un &eacute;mulateur de terminal pour DOS &eacute;crit &agrave; l'Universit&eacute; de Columbia &agrave;
  New York et "Minnesota InterNet Users Essential Tool" de l'Universit&eacute;
  de Minnesota ("<b>MINUET</b>" <b>http://www.fdisk.com/doslynx/minuet/ (*22)</b>),
  une suite d'applications <a href="../network/tcpip.htm">TCP/IP</a> fond&eacute; sur un pilote de paquets.
  Minuet fournissait une interface graphique utilisable &agrave; la souris qui
  avait des applications clientes comme l'E-mail, le Gopher, <b>Telnet</b>,
  Usenet, un navigateur web et FTP. Minuet est un bon exemple de la
  malheureuse conception des licences des logiciels DOS durant cette
  &eacute;poque. &Agrave; la diff&eacute;rence de la Licence publique g&eacute;n&eacute;rale GNU (GPL) qui
  est devenu le standard dans le monde GNU/Linux, les licences pour les
  logiciels DOS &eacute;crits par les universit&eacute;s et les passionn&eacute;s &eacute;taient
  principalement "fait maison". Par exemple la licence Minuet autorisait
  une utilisation libre pour les professeurs, le personnel et les
  &eacute;tudiants de l'Universit&eacute; du Minnesotta. Tous les autres devaient
  payer 50$ au bout de 15 jours d'&eacute;valuation. La distribution n'&eacute;tait
  autoris&eacute;e que pour des buts non commerciaux.
  Alors que ces licences shareware ont peut-&ecirc;tre fonctionn&eacute; il y a
  quinze ans, aujourd'hui elles ressemblent plus &agrave; un certificat de
  d&eacute;c&egrave;s pour le logiciel :
  Celui-ci n'est plus vendu ou distribu&eacute; officiellement. Alors que vous
  pouvez peut-&ecirc;tre encore trouver quelqu'un &agrave; qui payer les 50$, il est
  peu probable qu'il vous fournisse un support ou des mises &agrave; jour. Donc
  le co&ucirc;t peut d&eacute;passer ce que le logiciel vaut aujourd'hui, apr&egrave;s que
  son march&eacute; ait disparu et que les d&eacute;veloppeurs d'origine ont perdu
  l'int&eacute;r&ecirc;t qu'ils y portaient. Plus important encore : sans la source,
  il n'est pas utile aux autres programmeurs donc le d&eacute;veloppement
  s'arr&ecirc;te &agrave; cause de la licence. Et interdire la "distribution
  commerciale" a pour effet que les endroits o&ugrave; par exemple Minuet
  peut &ecirc;tre trouv&eacute;e sont pour la plupart changeantes et peu stables.
  Gr&acirc;ce &agrave; certains d&eacute;veloppeurs, des logiciels essentiels de <a href="../network/network.htm">r&eacute;seau</a> pour
  DOS avec leur code source respectif sont dans le domaine public ou
  sont des logiciels libres. Cela permet aux utilisateurs comme aux
  d&eacute;veloppeurs d'&eacute;crire encore et d'utiliser des applications <a href="../network/tcpip.htm">TCP/IP</a>
  pour DOS.
  Ces logiciels importants comprennent :
    * Des versions libres des convertisseurs de pilotes de paquets pour
      les pilotes <a href="../network/odi_ins.htm">ODI</a> et <a href="../network/ndis_ins.htm">NDIS</a> communs d'aujourd'hui : <a href="../network/odi_ins.htm#ccc">ODIPKT.COM</a>, &eacute;crit
      par Dan Lanciani (Universit&eacute; de Harvard) permet d'utiliser les
      <a href="../network/odi_ins.htm">pilotes ODI</a> comme des pilotes de paquets, DIS_PKT9.DOS par Prof.
      Joe R. Doupnik (Universit&eacute; de l'&Eacute;tat de l'Utah) et Dan Lanciani
      fait de m&ecirc;me avec les <a href="../network/ndis_ins.htm">pilotes NDIS</a>.
    * "<a href="../network/wattcp.htm">WatTCP</a>", une librairie de <a href="../network/ldtcpipk.htm">kernel TCP/IP</a> populaire libre &eacute;crit
      en 1990 par Erick Engelke de l'Universit&eacute; canadienne de Waterloo
      et son successeur <a href="../network/wattcp.htm">Watt-32</a> par Gisle Vanem (Norv&egrave;ge). Ces
      librairies permettent aux programmeurs d'int&eacute;grer des
      fonctionnalit&eacute;s <a href="../network/tcpip.htm">TCP/IP</a> &agrave; leurs applications sans avoir &agrave;
      r&eacute;inventer la roue.
    * "Pilote TCP Trumpet (<a href="../network/ntcpdrv.htm">NTCPDRV</a>)" de 1992, un <a href="../network/ldtcpipk.htm">kernel TCP/IP</a> libre
       externe cr&eacute;&eacute; par le programmeur australien Peter Tattam (aussi
       c&eacute;l&egrave;bre pour son Trumpet Winsock).
  Nous en apprendrons davantage sur ce logiciel un peu plus loin dans
  ce document.

  <b>Logiciels propri&eacute;taires</b>

  &Agrave; part PC/TCP de FTP Software Inc. beaucoup d'autres applications
  commerciales pouvaient &ecirc;tre trouv&eacute;es sur le march&eacute; pour la mise en
  <a href="../network/network.htm">r&eacute;seau</a> <a href="../network/tcpip.htm">TCP/IP</a> de DOS il y a dix ou quinze ans. Jusqu'&agrave; 30 paquets
  <a href="../network/tcpip.htm">TCP/IP</a> (<b>ftp://ftp.cac.psu.edu/pub/dos/info/tcpip.packages (*23)</b>)
  pour DOS &eacute;taient disponibles au milieu des ann&eacute;es quatre-vingt-dix, y
  compris IBM "<a href="../network/tcpip.htm">TCP/IP</a> pour DOS", NetManage "Chameleon", Sun "PC-<a href="../network/nfs.htm">NFS</a>",
  <a href="../network/novell.htm">Novell</a> "LAN WorkPlace", "SuperTCP" de Frontier Technologies ou Artisoft
  "LANtastic" - un syst&egrave;me de <a href="../network/network.htm">r&eacute;seau</a> qui &eacute;tait presque aussi populaire
  dans la premi&egrave;re moiti&eacute; des ann&eacute;es quatre-vingt-dix que le leader du
  march&eacute; de l'&eacute;poque, <a href="../network/novell.htm">Novell</a>. Une comparaison de leurs fonctionnalit&eacute;s
  peut &ecirc;tre trouv&eacute;e ici (<b>http://img.cmpnet.com/nc/820/graphics/tcpip.pdf
  (*24)</b>). Lisez &eacute;galement l'article correspondant dans le magazine
  "<a href="../network/network.htm">Network</a> Computing"
  (<b>http://www.networkcomputing.com/820/820buyers.html (*25)</b>).
</pre>
<h2><a name="ccc"></a>La fin de la mise en r&eacute;seau de DOS</h2>
<pre>
  Nous devons garder &agrave; l'esprit que tout ce d&eacute;veloppement des logiciels
  <a href="../network/tcpip.htm">TCP/IP</a> pour DOS s'est produit dans une p&eacute;riode relativement courte.
  Le PC d'IBM n'avait aucune capacit&eacute; de <a href="../network/network.htm">r&eacute;seau</a> lorsqu'il a &eacute;t&eacute; lanc&eacute;
  en 1981. Ceux qui travaillaient avec des machines UNIX &agrave; cette &eacute;poque
  consid&eacute;raient le comme un jouet. Mais le  <a href="../network/network.htm">r&eacute;seau</a> est devenu une option
  s&eacute;rieuse quand le PC AT (i286) a &eacute;t&eacute; lanc&eacute; en 1984 et en 1986, lorsque
  Compaq a lanc&eacute; le premier PC avec un processeur i386. Cette fen&ecirc;tre
  d'opportunit&eacute; a commenc&eacute; &agrave; se refermer avec l'introduction de Windows
  NT en 1993 et s'est referm&eacute;e avec Windows 95 en ao&ucirc;t 1995, qui avait
  son propre <a href="../network/ldtcpipk.htm">kernel TCP/IP</a> d&eacute;j&agrave; int&eacute;gr&eacute; et comprenait le protocole
  Point-to-Point (PPP), un num&eacute;roteur ainsi que la prise en charge des
  <a href="../network/network.htm">r&eacute;seaux</a> <b>SMB</b> pair &agrave; pair.
  Ce fut un coup dur pour les logiciels r&eacute;seau commerciaux, y compris
  <a href="../network/novell.htm">Novell</a> NetWare.
  FTP Software Inc. a &eacute;t&eacute; rachet&eacute; en 1998 par l'ancien concurrent
  NetManage pour un prix &agrave; peine sup&eacute;rieur &agrave; la somme des fonds dans le
  compte bancaire de FTP software (voyez ici pour plus d'informations
  <b>http://www.apocalypse.org/pub/ftp-alumni/archives/ftp-alumni.9806
  (*26)</b>). Aujourd'hui, il n'existe plus, bien entendu. En 2007 le march&eacute;
  des logiciels <a href="../network/network.htm">r&eacute;seau</a> pour DOS est abandonn&eacute;. La plupart des solutions
  commerciales ne sont plus disponibles. Leurs fabricants ont chang&eacute; de
  propri&eacute;taires ou de march&eacute;, ou ont simplement cess&eacute; d'exister. Ceux
  qui travaillaient sur l'approche "centr&eacute;e sur UNIX" il y a 10 ans
  travaillent peut-&ecirc;tre aujourd'hui sur des solutions GNU/Linux.
  Lisez davantage sur l'historique de la mise en <a href="../network/network.htm">r&eacute;seau</a> <a href="../network/tcpip.htm">TCP/IP</a> sur des
  ordinateurs sous DOS dans l'article de Steven Baker "Net Worth -
  Desktop <a href="../network/tcpip.htm">TCP/IP</a> At Middle Age"
  (<b>http://web.archive.org/web/20070314043508/http://www.ece.ubc.ca/
  ~gillies/9802net.html (*27)</b>).
</pre>
<h2><a name="ddd"></a>Ramasser les morceaux</h2>
<pre>
  <a href="../network/network.htm">La mise en r&eacute;seau</a> de DOS au XXIe si&egrave;cle signifie essentiellement de
  prendre ce qui reste de l'&eacute;poque du <a href="../network/network.htm">r&eacute;seau</a> DOS du milieu des ann&eacute;es
  quatre-vingt jusqu'au milieu des ann&eacute;es quatre-vingt-dix. Certains
  outils <a href="../network/novell.htm">Novell</a> et Microsoft peuvent toujours &ecirc;tre l&eacute;galement t&eacute;l&eacute;charg&eacute;s
  et utilis&eacute;s. Et les solutions  <a href="../network/tcpip.htm">TCP/IP</a> des universit&eacute;s et passionn&eacute;s
  qui ont &eacute;t&eacute; publi&eacute;s dans le domaine public, en tant que shareware
  voire postcardware, sont toujours l&agrave;, m&ecirc;me si la plupart ne peuvent
  plus &ecirc;tre trouv&eacute;es &agrave; son emplacement d'origine.
  Mais il y a davantage. Certains projets sont toujours vivants : Le
  navigateur graphique DOS <a href="../network/tcpip_ap.htm#ccc">Arachne</a> est &agrave; nouveau d&eacute;velopp&eacute; activement par
  un groupe de programmeurs apr&egrave;s qu'il a &eacute;t&eacute; publi&eacute; sous GNU GPL.
  &Eacute;galement <a href="../network/tcpip_ap.htm#eee">SSH2DOS</a>, <a href="../network/wattcp.htm">Watt-32</a> et les successeurs de KA9Q <a href="../network/tcpip_ap.htm#ddd">EZ-NOS2</a> et JNOS2
  sont toujours maintenus et d&eacute;velopp&eacute;s. Un nouveau logiciel DOS <a href="../network/tcpip.htm">TCP/IP</a>
  a m&ecirc;me &eacute;t&eacute; &eacute;crit r&eacute;cemment.

  <b>(*01) http://people.sju.edu/~jhodgson/netw/kw_hwk4.html</b>
  <b>(*02) OK</b>
  <b>(*03) OK</b>
  <b>(*04) https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=
        &cad=rja&uact=8&ved=2ahUKEwjmnqmTiJvqAhVtQUEAHSx2BBYQFjAAegQIB
        hAB&url=ftp%3A%2F%2Fnic.funet.fi%2Findex%2Fnetworking%2Fmagazines
        %2FInternaut%2Fpc-ip.html&usg=AOvVaw2xp6u7ieLlJMNfvpiqtLq5</b>
  <b>(*05) https://web.archive.org/web/20050529012400/http://members.
        aol.com/Karima4483/pcip/</b>
  <b>(*06) ?</b>
  <b>(*07) OK</b>
  <b>(*08) https://web.archive.org/web/20120608031912/
        http://www.crynwr.com/packet_driver.html</b>
  <b>(*09) OK</b>
  <b>(*10) https://web.archive.org/web/20200110122004/http://crynwr.com/</b>
  <b>(*11) OK</b>
  <b>(*12) OK</b>
  <b>(*13) OK</b>
  <b>(*14) OK</b>
  <b>(*15) https://vetusware.com/download/EZ-NOS%202.0%20DOS%20Internet
        %20server%20OS%202.0/</b>
  <b>(*16) https://web.archive.org/web/20090711165409/http:
        //www.hippy.freeserve.co.uk/eznos.htm</b>
  <b>(*17) https://web.archive.org/web/20081016111245/http:
        //www.dossolutions.pwp.blueyonder.co.uk/eznos.htm</b>
  <b>(*18) https://ftp.gwdg.de/pub/msdos/ncsa-telnet/</b>
  <b>(*19) https://ftp.gwdg.de/pub/msdos/ncsa-telnet/</b>
  <b>(*20) OK</b>
  <b>(*21) OK http://www.kermitproject.org/</b>
  <b>(*22) OK</b>
  <b>(*23) ?</b>
  <b>(*24) OK</b>
  <b>(*25) https://web.archive.org/web/20090308122027/http://www.
        networkcomputing.com/820/820buyers.html</b>
  <b>(*26) https://en.wikipedia.org/wiki/FTP_Software</b>
  <b>(*27) OK</b>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2007 Ulrich Hansen, Mainz (Allemagne), modifi&eacute; en 2010
  par W. Spiegl.</b>
  <b>Traduit en 2020 par Berki Yenig&uuml;n.</b>

  Pour plus d'informations, <a href="../network/intro.htm#ddd">voyez ici</a>.

  La permission est accord&eacute;e de copier, distribuer et/ou modifier ce
  document selon les termes de la licence de documentation libre GNU,
  version 1.2 ou toute version ult&eacute;rieure publi&eacute;e par la Free Software
  Foundation.
  Une copie de la licence est incluse dans la section intitul&eacute;e
  <a href="../other/fdl12.htm">"GNU Free Documentation License 1.2"</a>.

</pre></body></html>
