<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Como usar la ayuda de FreeDOS (hhstndrd 1.0.8a es)</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="hhstndrd/other/fdhelp.css">
</head>
<body>
<h1>Como usar la ayuda de FreeDOS (hhstndrd 1.0.8a es)</h1>
<pre>
  Utilizando el "RAT&Oacute;N":
  * Los enlaces de temas est&aacute;n resaltados en amarillo (en la ayuda de 
    Freedos). En internet se marcan como de costumbre.
  * Haga clic en un elace para ver m&aacute;s informaci&oacute;n sobre este tema.
  * Haga clic en la barra de desplazamiento para desplazarse por la p&aacute;gina
    hacia arriba y hacia abajo.
  * Salir de la ayuda haciendo clic en "Exit" en la parte superior de la 
    pantalla. (en la ayuda de FreeDOS)
  * M&aacute;s de navegaci&oacute;n se proporciona en la parte inferior de la pantalla.

  Utilizando el "TECLADO" (en la ayuda de FreeDOS - no en internet):
  * Usa las teclas de flechas para relastar un tema, a continuaci&oacute;n, pulsa
    la tecla intro.
  * ReP&aacute;g y AvP&aacute;g para desplazarse por la informaci&oacute;n de la ayuda.
  * Alt+X para salir de la ayuda. (Alt+F4 tambi&eacute;n funciona)
  * Alt+Flecha Izquierda vuelve a un tema. (Escape, Alt+B y Retroceso 
    tambi&eacute;n funciona)
  * Alt+Flecha Derecha avanza un tema. (Alt+F tambi&eacute;n funciona)
  * Alt+C regresa a la p&aacute;gina de contenidos.
  * F1 va a esta patalla de ayuda.
  * Tambi&eacute;n hay otras maneras de desplazarse por la informaci&oacute;n de la ayuda
    en pantalla. Inicio y Fin traslada a la parte superior y la parte infe-
    rior del documento. Manteniendo la tecla Atl mientras pulsa las teclas
    de flecha arriba y abajo se desplaza la ayuda gradualmente.

  La comprensi&oacute;n de temas de la ayuda "Syntax":
    En la mayor&iacute;a de los temas de ayuda ver&aacute; algo como esto:

      comando requerido [opcional] [/interruptor] [/A|/B]

  Aqu&iacute; est&aacute; una explicaci&oacute;n de las diferentes partes de esta l&iacute;nea:
    comando
  Este es el nombre del comando.
    requerido
  Cualquier cosa que sigue el nombre del comando, que no est&aacute; en corchetes,
  [y], es un par&aacute;metro necesario.
  El comando informar&aacute; de un error si no se da esta informaci&oacute;n.
    [opcional]
  las opciones que se escriben entre corchetes, [y]. Estas cambian la forma
  en que se ejecuta el comando. Los corchetes no est&aacute;n destinados a ser
  escritos cuando se utiliza el comando.
    [/interruptures]
  Las opciones que comienzan con un / se llaman interruptures. El s&iacute;mbolo /
  en realidad es escrito cuando se usa el interruptor.
    [/A|/B]
  Cuando hay un s&iacute;mbolo |, esto significa que hay una elecci&oacute;n entre dos
  opciones. Se permite cualquiera /A o /B, pero no ambos. El s&iacute;mbolo | se 
  entiende que no se estribe cuando se utiliza el comando.

  Otras formas de obtenci&oacute;n de ayuda:
  1. La mayoria de los comandos se describen sus funciones y opciones, me-
     diante el uso de /? en ellos en la l&iacute;nea de comandos. Por ejemplo:
     dir /?
  2. El comando "FASTHELP" ("FDHELP") or "FSUITE04". Este es un clon
     de MS-DOS fasthelp. Si no puede encontrar lo que busca en la ayuda,
     puede estar en fasthelp, o viceversa.
  3. Los comandos "WHATIS" y "APROPOS".
  4. El comando "HELP" ("HTMLHELP").
  5. El subdirectorio doc en el directorio DOS contiene muchos de los 
     manuales detallados para diversos programas de FreeDOS.
  6. Visita el sitio web de FreeDOS, <b>http://www.freedos.org</b>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2004 Robert Platt, updated 2007 by W. Spiegl.</b>
  <b>Traducido al Espa&ntilde;ol por Lorenzo del Toro en 2018.</b>

  Este archivo se deriva del FreeDOS Spec Command HOWTO.
  Vea el archivo "H2Cpying" para condiciones de copia.

</pre></body></html>
