# Language: Russian
# File ending: ru
# Codepage: 866
# This translation was made by Google Gemini.
# Please help the FreeDOS group to improve it.

vinsert [опции]

Вставить пустую строку в текущем местоположении.

    [нет]       Вставить пустую строку.
    n           Вставить n пустых строк.
    /A n        Установить атрибут текста на n.
    /B цвет     Установить атрибут текста фона на цвет (или значение).
    /F цвет     Установить атрибут текста переднего плана на цвет (или
                значение).
    /G          Глобальная вставка.
    /L          Локальная вставка. (По умолчанию)
    /K n        Использовать n вместо символа рамки для обнаружения
                границ.
