<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Trabajo en red con FreeDOS - Conclusi&oacute;n</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1><a name="top"></a>Trabajo en red con FreeDOS - Conclusi&oacute;n</h1>
<pre>
  Hay un mont&oacute;n de de aplicaciones de redes para usuarios disponebles de
  FreeDOS, algunos programas gratuitos, algunos programas de software
  libre. Esta es una buena noticia: <b>Para servir archivos para navegar
  por la web - todo es posible con FreeDOS.</b>
  Hay desventajas, sin embargo: Una integraci&oacute;n sin costuras en otros
  sistemas operativos <a href="../network/network.htm">networks</a> es dif&iacute;cil de lograr. Ni la moderna <a href="../network/history.htm#aab">SMB</a>
  (Windows y GNU/Linux <a href="../network/network.htm">networks</a>) ni <a href="../network/nfs.htm">NFS</a> (GNU/Linux, UNIX) <a href="../network/network.htm">networks</a> est&aacute;n
  trabajando sin defectos con una m&aacute;quina DOS.
  Y tarjetas modernas de interfaz de red casi dejaron de dar soporte con
  paquetes de controladores que una vez fueron los controladores
  predeterminado para la DOS <a href="../network/network.htm">networking</a>. Otros
  controladores necesitan software adicional que no es libre y no pueden
  distribuirse libremente. As&iacute; que todav&iacute;a hay mucho que hacer - para los
  desarrolladores, sino tambi&eacute;n para las personas que quieran ayudar con
  esta documentaci&oacute;n:
    * PPP no se explica - &iquest;no hay nadie que tenga un <a href="../network/modem.htm">Modem</a>?
    * Una guia para el uso de FreeDOS con <a href="../network/wifi.htm">WiFi</a> (LAN inal&aacute;mbrica) ser&iacute;a
      genial.
    * <a href="../network/nfs.htm">NFS</a> no est&aacute; cubierto todav&iacute;a.
    * <a href="../network/network.htm">Redes</a> de FreeDOS dentro de una m&aacute;quina virtual no se explica aqu&iacute;.
    * Una mirada m&aacute;s profunda en el <a href="../network/msclient.htm">cliente MS</a> podr&iacute;a ayudar a muchos
      usuarios.
    * Todav&iacute;a no se document&oacute; como <a href="../network/novell.htm">Novell Netware</a> se puede utilizar
      con FreeDOS.
  Como este es un wiki ahora, eres bienvenido para a&ntilde;adir informaciones y
  continuar este trabajo. Que se diviertan.

</pre>
<hr>
<pre>
  <b>Copyright &copy; 2007 Ulrich Hansen, Mainz (Alemania), modificado en 2010
  por W.Spiegl. Actualizado en 2013 por Lorenzo del Toro Saravia.</b>
  Para m&aacute;s informaci&oacute;n <a href="../network/intro.htm#ddd">consulte aqu&iacute;</a>.

  Se concede permiso para copiar, distribuir y/o modificar este documento
  en los t&eacute;rminos de la licencia de documentaci&oacute;n libre GNU, versi&oacute;n 1.2 o
  cualquier versi&oacute;n posterior publicada por la Free Software Foundation.
  Una copia de la licencia est&aacute; incluida en la secci&oacute;n titulada
  <a href="../other/fdl12.htm">"GNU Free Documentation License 1.2"</a>.

</pre></body></html>
