# Language: Russian
# File ending: ru
# Codepage: 866
# This translation was made by Google Gemini.
# Please help the FreeDOS group to improve it.

vpcspkr [hz:][ms]

Генерация тона с помощью встроенного динамика.

[none]          Нет вывода.
hz:ms           Использовать динамик ПК для генерации тона с частотой
                hz. Затем задержка на ms миллисекунд. (Примечание:
                частота 0 выключает динамик. Если частота не указана,
                предполагается 0)
/D              Определить метод измерения времени. (Несовместимо с
                VirtualBox)
/S              Использовать безопасный таймер общего назначения.
                (По умолчанию)
/I              Использовать высокоточный таймер прерываний.
                (Несовместимо с VirtualBox)
tba             (Еще в разработке, больше будет объявлено)
