<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Comando de FreeDOS: undelete</title>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1"><link rel="stylesheet" type="text/css" href="../other/fdhelp.css">
</head>
<body>
<h1>Comando: undelete</h1>
<pre>
  UNDELETE intenta la recuperaci&oacute;n de archivos eliminados.
</pre>
<h2>Sintaxis:</h2>
<pre>
  undelete [directorio] [opciones]
           directorio  La ubicaci&oacute;n donde est&aacute; el archivo que se va a
                       recuperar es. Si no se proporciona ning&uacute;n
                       directorio, se supone el directorio de trabajo
                       actual.
  Tambi&eacute;n hay opciones de recuperaci&oacute;n m&aacute;s avanzadas:
  undelete /acci&oacute;n que destino [tama&ntilde;o]
</pre>
<h2>Opciones:</h2>
<pre>
    /ALL      Recupere TODOS los archivos en el directorio dado sin
              solicitar cada archivo.
    /LIST     Enumera los archivos que se pueden recuperar sin solicitar
              la recuperaci&oacute;n; No se toman medidas.
    /E        Exporta todos los archivos no eliminados a un disco externo
              y directorio. Con esta opci&oacute;n, el disco de origen no se 
              modifica.
  Posibles [acci&oacute;n]es:
    /syssave  Guarda la primera o segunda copia de FAT, sector de
              arranque o directorio ra&iacute;z. Seleccione fat1, fat2, boot o
              root en [what].
    /follow   Busca un archivo (posiblemente eliminado) que comience en
              el cl&uacute;ster [what] y guarda los datos en un archivo dado
              como [destino]. El resultado de DIRSAVE le ayuda a
              encontrar el n&uacute;mero de cl&uacute;ster correcto.
    /dirsave  Como FOLLOW, pero guarda un directorio en un archivo. El
              directorio [what] debe ser dado por una ruta absoluta que
              comienza con \ OR por un n&uacute;mero de cl&uacute;ster. Tambi&eacute;n
              muestra una lista de directorios t&eacute;cnicos en la pantalla.
    destino   Debe estar en una unidad que no sea la unidad actual. Los
              datos siempre se leen/recuperan de la unidad desde la que
              se invoca recuperar.
    tama&ntilde;o    No es necesario especificar el tama&ntilde;o, pero puede anular
              la autodetecci&oacute;n especificando el tama&ntilde;o (en grupos para
              FOLLOW, en sectores para DIRSAVE).
</pre>
<h2><a name="comment"></a>Comentarios:</h2>
<pre>
  &iexcl;UNDELETE solo funciona en discos FAT12 / FAT16!
  Usando UNDELTE:
    1. Encontrar archivos y directorios no recuperables:
       Ejecuta recuperar en modo DIRSAVE. Ver&aacute; entradas de directorio
       eliminadas especialmente marcadas, y ver&aacute; sus n&uacute;meros de cl&uacute;ster
       en la pantalla. Puede redirigir la salida de la pantalla a un
       archivo, por ejemplo:
         undelete /DIRSAVE \ x:\rescued.dir &gt; y:\logfile
       Donde el archivo de registro contendr&aacute; la salida de la pantalla.
       Si tiene las utilidades FreeDOS instaladas en su sistema, podr&iacute;a
       usar algo como uno de los siguientes:
         undelete  /DIRSAVE \ x:\rescued.dir | <a href="../util/tee.htm">TEE</a> y:\logfile
         undelete /DIRSAVE \ x:\rescued.dir | <a href="../util/tee.htm">TEE</a> y:\logfile | <a href="../base/more.htm">MORE</a>
       Estos mostrar&aacute;n la informaci&oacute;n en la pantalla y la alamacenar&aacute;n
       en el archivo de registro.
    2. Recuperaci&oacute;n de un archivo no recuperable Busque el cl&uacute;ster
       inicial del archivo utilizando DIRSAVE, como se explic&oacute;
       anteriormente. Luego use FOLLOW en ese cl&uacute;ster, por ejemplo:
         undelete FOLLOW 1234 x:\rescued.bin
       guardar&iacute;a el contenido del archivo eliminado que comienza en el
       cl&uacute;ster 1234 en el archivo rescued.bin en la unidad x.
  Usos Avanzados:
    - Recuperaci&oacute;n desde dentro de directorios eliminados.
      Ejecutar DIRSAVE en un directorio existente para encontrar el
      cl&uacute;ster inicial del directorio eliminado. Luego ejecute DIRSAVE en
      ese cl&uacute;ster para buscar archivos y directorios eliminados dentro
      del directorio eliminado ... y as&iacute; sucesivamente con los n&uacute;meros
      de cl&uacute;ster sucesivos seg&uacute;n sea necesario.
    - Recuperaci&oacute;n de archivos parcialmente sobrescritos.
      Use FOLLOW en los nuevos archivos existentes y anule el valor del
      tama&ntilde;o (en grupos, undelete le dice qu&eacute; tan grande es un grupo en
      la unidad actual cuando comienza a recuperar). Entonces, si ha
      sobrescrito accidentalmente un archivo largo "ANTIGUO" con un
      nuevo archivo corto "NUEVO":
      * encuentre el n&uacute;mero de cl&uacute;ster de "NUEVO"
      * dar el tama&ntilde;o de "ANTIGUO" cuando se utiliza FOLLOW
      * La salida recuperada comenzar&aacute; con el contenido de "NUEVO" pero
        tambi&eacute;n deber&iacute;a contener el final no sobrescrito de "ANTIGUO",
        con suerte.
    - Usar undelete para "reflejar" datos importantes del disco.
      Si su sistema de archivos se romple por completo, puede intentar
      escribir los datos importantes guardados por SYSSAVE. La
      informaci&oacute;n guardada debe almacenarse en un disco separado. Tambi&eacute;n
      puede usar el comando <a href="../base/mirror.htm">MIRROR</a>, que es m&aacute;s simple de usar pero
      almacena la informaci&oacute;n guardada al final del disco.
      * Ejecuta undelete en modo SYSSAVE para las 4 fuentes: fat1, fat2,
        boot, root.
      * Mantenga los archivos en un lugar seguro.
    - Restauraci&oacute;n de los datos "mirror".
      Esto puede ser necesario en algunos casos de desastre de disco.
      ADVERTENCIA: &iexcl;Esto es solo para expertos, reparadores y personas
      muy desesperadas! &iexcl;Hacer esto de manera incorrecta o innecesaria
      podr&iacute;a empeorar las cosas!
      * Pegue las 4 fuentes juntas en el orden "boot fat1 fat2 root"
        para reconstruir la primera parte de su partici&oacute;n, comenando con
        el primer sector.
      * Podr&iacute;a usar <a href="../base/debug.htm">DEBUG</a> (comando w) para restaurar esta informaci&oacute;n.
      * Tambi&eacute;n puede combinar datos guardados y existentes con un
        editor hexadecimal.
</pre>
<h2>Ejemplos:</h2>
<pre>
  - Ver <a href="#comment">comentarios</a> -
</pre>
<h2>Ver tambi&eacute;n:</h2>
<pre>
  <a href="../base/debug.htm">debug</a>
  <a href="../command/del.htm">del</a>
  <a href="../base/deltree.htm">deltree</a>
  <a href="../command/erase.htm">erase</a>
  <a href="../base/format.htm">format</a>
  <a href="../base/mirror.htm">mirror</a>
  <a href="../base/more.htm">more</a>
  <a href="../command/rd.htm">rd</a>
  <a href="../command/rmdir.htm">rmdir</a>
  <a href="../util/tee.htm">tee</a>
  <a href="../base/unformat.htm">unformat</a>
</pre>
<hr>
<pre>
  <b>Copyright &copy; 2003 Eric Auer, modificado en 2008 por W. Spiegl.</b>
  Traducido en 2020 por <b>Lorenzo del Toro Saravia</b>.

  Este archivo se deriva del comando de especificaciones HOWTO de FreeDOS.
  Consulte el archivo <a href="../other/h2cpying.htm">H2Cpying</a> para ver las condiciones de copia.

</pre></body></html>
